
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СписокНормРасхода") Тогда
		Для Каждого ТекЭл Из Параметры.СписокНормРасхода Цикл
			НоваяСтрока = РасшифровкаНорм.Добавить();
			НоваяСтрока.Норма = ТекЭл.Представление;
			НоваяСтрока.Значение = Формат(ТекЭл.Значение, "ЧДЦ=3");
		КонецЦикла;
	КонецЕсли;
	Если Параметры.Свойство("ЭтоТЖ") И Параметры.ЭтоТЖ = ИСТИНА Тогда
		Заголовок = "Расшифровка нормы расхода ТЖ";
	Иначе
		Заголовок = "Расшифровка нормы расхода ГСМ";
	КонецЕсли;
КонецПроцедуры
