
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ТекущийПользователь = Пользователи.ТекущийПользователь();
    
    ОтборПодразделение = ТекущийПользователь.Подразделение;
    
    Если НЕ ЗначениеЗаполнено(ОтборПодразделение) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    ЗаданияКПроверке, "Подразделение", , , , Ложь);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    ЗаданияКПроверке, "Подразделение", ОтборПодразделение, , , Истина);
    КонецЕСли;        
    
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
    
    Если НЕ ЗначениеЗаполнено(ОтборПодразделение) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    ЗаданияКПроверке, "Подразделение", , , , Ложь);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    ЗаданияКПроверке, "Подразделение", ОтборПодразделение, , , Истина);
    КонецЕСли;        

КонецПроцедуры

&НаСервере
Процедура ИсправитьНаСервере(ЗаданиеНаПеревозку, ЗаявкаНаАрендуТехники)
    
    ЗаданиеНаПеревозкуОбъект = ЗаданиеНаПеревозку.ПолучитьОбъект();
    ЗаданиеНаПеревозкуОбъект.ЗаявкаНаАрендуТехники = ЗаявкаНаАрендуТехники;
    
    Попытка
        ЗаданиеНаПеревозкуОбъект.Записать(РежимЗаписиДокумента.Проведение);
    Исключение
        ЗаданиеНаПеревозкуОбъект.КПроверке = Истина;
        ЗаданиеНаПеревозкуОбъект.Записать(РежимЗаписиДокумента.Проведение);
    КонецПопытки;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	пкПогрузкаВыгрузкаПоДоставке.Ссылка
    |ИЗ
    |	Документ.пкПогрузкаВыгрузкаПоДоставке КАК пкПогрузкаВыгрузкаПоДоставке
    |ГДЕ
    |	пкПогрузкаВыгрузкаПоДоставке.Проведен
    |	И пкПогрузкаВыгрузкаПоДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку";
    
    Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", ЗаданиеНаПеревозку);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        ПогрузкаВыгрузкаПоДоставке = Выборка.Ссылка.ПолучитьОбъект();
        
        Попытка
        	ПогрузкаВыгрузкаПоДоставке.Записать(РежимЗаписиДокумента.Проведение);
        Исключение
        КонецПопытки;
    КонецЦикла;
    
    Элементы.ЗаданияКПроверке.Обновить();
    
КонецПроцедуры

&НаСервере
Процедура ПровестиЗаданиеНаСервере(ЗаданиеНаПеревозку)
    
    ЗаданиеНаПеревозкуОбъект = ЗаданиеНаПеревозку.ПолучитьОбъект();
    
    Попытка
        ЗаданиеНаПеревозкуОбъект.Записать(РежимЗаписиДокумента.Проведение);
    Исключение
    КонецПопытки;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	пкПогрузкаВыгрузкаПоДоставке.Ссылка
    |ИЗ
    |	Документ.пкПогрузкаВыгрузкаПоДоставке КАК пкПогрузкаВыгрузкаПоДоставке
    |ГДЕ
    |	пкПогрузкаВыгрузкаПоДоставке.Проведен
    |	И пкПогрузкаВыгрузкаПоДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку";
    
    Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", ЗаданиеНаПеревозку);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        ПогрузкаВыгрузкаПоДоставке = Выборка.Ссылка.ПолучитьОбъект();
        
        Попытка
        	ПогрузкаВыгрузкаПоДоставке.Записать(РежимЗаписиДокумента.Проведение);
        Исключение
        КонецПопытки;
    КонецЦикла;
    
    Элементы.ЗаданияКПроверке.Обновить();
    
КонецПроцедуры    

&НаКлиенте
Процедура Исправить(Команда)
    
    ТекущиеДанные = Элементы.ЗаданияКПроверке.ТекущиеДанные;
    
    Если ТекущиеДанные <> Неопределено Тогда
        Если ТекущиеДанные.ЗаменаЗаявки И ЗначениеЗаполнено(ТекущиеДанные.ЗаявкаНаАрендуТехникиДляЗамены) Тогда
            ИсправитьНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.ЗаявкаНаАрендуТехникиДляЗамены);
        ИначеЕсли НЕ ТекущиеДанные.ЗаменаЗаявки Тогда
            ПровестиЗаданиеНаСервере(ТекущиеДанные.Ссылка);
        КонецЕсли;
    КонецЕсли;    
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияКПроверкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    ТекущиеДанные = Элементы.ЗаданияКПроверке.ТекущиеДанные;
    
    Если ТекущиеДанные <> Неопределено Тогда
        Если Поле.Имя = "ЗаданияКПроверкеТекущаяЗаявкаНаАрендуТехники" Тогда
            Отбор = Новый Структура();
            Отбор.Вставить("Ключ", ТекущиеДанные.ТекущаяЗаявкаНаАрендуТехники);
            
            ОткрытьФорму("Документ.пкЗаявкаНаАрендуТехники.Форма.ФормаДокумента", Отбор, ЭтаФорма);
            
        ИначеЕсли Поле.Имя = "ЗаданияКПроверкеЗаявкаНаАрендуТехникиДляЗамены" Тогда
            Отбор = Новый Структура();
            Отбор.Вставить("Ключ", ТекущиеДанные.ЗаявкаНаАрендуТехникиДляЗамены);
            
            ОткрытьФорму("Документ.пкЗаявкаНаАрендуТехники.Форма.ФормаДокумента", Отбор, ЭтаФорма);
            
        Иначе
            Отбор = Новый Структура();
            Отбор.Вставить("Ключ", ТекущиеДанные.Ссылка);
            
            ОткрытьФорму("Документ.пкЗаданиеНаПеревозку.Форма.ФормаДокумента", Отбор, ЭтаФорма);
        КонецЕсли; 
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
    
    Элементы.ЗаданияКПроверке.Обновить();
    
КонецПроцедуры
