
&НаСервере
Процедура УстановитьНаСервере()
    
    МенеджерЗаписи = РегистрыСведений.пкРабочиеДатыПользователей.СоздатьМенеджерЗаписи();
    
    Пользователь = Пользователи.ТекущийПользователь();
    МенеджерЗаписи.Пользователь = Пользователь;
    
    МенеджерЗаписи.Прочитать();
    
    Если Дата <> НачалоДня(ТекущаяДата()) Тогда
        Если МенеджерЗаписи.Выбран() Тогда
            МенеджерЗаписи.Дата = Дата;
        Иначе
            МенеджерЗаписи.Пользователь = Пользователь;
            МенеджерЗаписи.Дата         = Дата;
        КонецЕсли;
        
        МенеджерЗаписи.Записать();
    Иначе
        Если МенеджерЗаписи.Выбран() Тогда
            МенеджерЗаписи.Удалить();    
        КонецЕсли;    
    КонецЕсли;    

КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
    
    УстановитьНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    МенеджерЗаписи = РегистрыСведений.пкРабочиеДатыПользователей.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
    
    МенеджерЗаписи.Прочитать();
    
    Если МенеджерЗаписи.Выбран() Тогда
        Дата = МенеджерЗаписи.Дата;
    Иначе
        Дата = ТекущаяДата();
    КонецЕсли;    
    
КонецПроцедуры
