
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	HTML = "http://hosting.wialon.com/login.html?client_id=""UAT Prof 2.0""&access_type=-1&activation_time=0&duration=0&lang=ru&response_type=token";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьТокен(Команда)
	
	Токен = "";
	
	Попытка
		Поз = Найти(Элементы.HTML.Документ.URLUnencoded, "access_token=");
		Если Поз <> 0 Тогда 
			Токен = Прав(Элементы.HTML.Документ.URLUnencoded, СтрДлина(Элементы.HTML.Документ.URLUnencoded)-Поз-12);
			Поз = Найти(Токен, "&");
			Если Поз <> 0 Тогда 
				Токен = Лев(Токен, Поз-1);
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если Токен = "" Тогда 
		ТекстОшибки = "Токен сессии не получен и не может быть установлен.";
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Закрыть(Токен);
	
КонецПроцедуры

#КонецОбласти
