
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ИмяОбъектаВыбора") Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.ИмяОбъектаВыбора = "АЗС" Тогда
		Заголовок = "Выберите АЗС";
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатАЗС.Ссылка
		|ИЗ
		|	Справочник.уатАЗС КАК уатАЗС
		|ГДЕ
		|	НЕ уатАЗС.ПометкаУдаления
		|	И уатАЗС.ЭтоАЗССклад = &ЭтоАЗССклад
		|УПОРЯДОЧИТЬ ПО
		|	уатАЗС.Наименование");
		Запрос.УстановитьПараметр("ЭтоАЗССклад",
			Параметры.Свойство("ЭтоАЗССклад") И Параметры.ЭтоАЗССклад);
				
	ИначеЕсли Параметры.ИмяОбъектаВыбора = "Прицеп" Тогда
		Заголовок = "Выберите прицеп или оборудование";
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТранспортныеСредства.Ссылка
		|ИЗ
		|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
		|ГДЕ
		|	НЕ ТранспортныеСредства.ПометкаУдаления
		|	И (ТранспортныеСредства.уатВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Прицеп)
		|	ИЛИ ТранспортныеСредства.уатВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Оборудование))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортныеСредства.Наименование");
		
	ИначеЕсли Параметры.ИмяОбъектаВыбора = "УсловиеРаботы" Тогда
		Заголовок = "Выберите условие работы";
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатУсловияРаботы.Ссылка
		|ИЗ
		|	Справочник.уатУсловияРаботы КАК уатУсловияРаботы
		|ГДЕ
		|	НЕ уатУсловияРаботы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатУсловияРаботы.Наименование");
				
	ИначеЕсли Параметры.ИмяОбъектаВыбора = "ВидПростоя" Тогда
		Заголовок = "Выберите вид простоя";
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатСостояниеТС.Ссылка
		|ИЗ
		|	Справочник.уатСостояниеТС КАК уатСостояниеТС
		|ГДЕ
		|	НЕ уатСостояниеТС.ПометкаУдаления
		|	И уатСостояниеТС.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.уатВидыСостоянийТС.ВПростое)
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатСостояниеТС.Наименование");
				
	Иначе
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Список.Добавить();
		НоваяСтрока.Ссылка = Выборка.Ссылка;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Элементы.Список.ТекущиеДанные.Ссылка);
КонецПроцедуры
