Процедура ВыполнитьЗаписьВРегистры() Экспорт
	
	Для каждого СтрокаОС Из ОсновныеСредства Цикл
		Если СтрокаОС.ТекущаяСтавка=СтрокаОС.НоваяСтавка или не ЗначениеЗаполнено(СтрокаОС.НоваяСтавка) Тогда
			Продолжить;
		КонецЕсли; 
		ЗаписьРегистрации = РегистрыСведений.РегистрацияТранспортныхСредств.СоздатьМенеджерЗаписи();
		ЗаписьРегистрации.Организация = СтрокаОС.Организация;
		ЗаписьРегистрации.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
		ЗаписьРегистрации.Период = СтрокаОС.ДатаРегистрации;
		ЗаписьРегистрации.Прочитать();
	    ЗаписьРегистрации.НалоговаяСтавка=СтрокаОС.НоваяСтавка;
		
		ЗаписьИсторииСтавки = РегистрыСведений.пкДатыУстановкиСтавкиТранспортногоНалога.СоздатьМенеджерЗаписи();
		ЗаписьИсторииСтавки.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
		ЗаписьИсторииСтавки.Период = НачалоДня(ТекущаяДата());
		ЗаписьИсторииСтавки.Прочитать();
		ЗаписьИсторииСтавки.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
		ЗаписьИсторииСтавки.Период = НачалоДня(ТекущаяДата());
	    ЗаписьИсторииСтавки.НалоговаяСтавка=СтрокаОС.НоваяСтавка;
		
		Попытка
		ЗаписьРегистрации.Записать();
		ЗаписьИсторииСтавки.Записать();	
		Исключение
		
		КонецПопытки; 
	КонецЦикла;
	
КонецПроцедуры
 