
//+++rarus-spb_zlov 11.10.2016   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
    
    Если Параметры.Свойство("Отбор") Тогда
        Если Параметры.Отбор.Количество() = 0 И НЕ Параметры.Свойство("БезОтборов") Тогда
            Отказ = Истина;
        КонецЕсли; 
    Иначе
        Отказ = Истина;
    КонецЕсли;    

КонецПроцедуры

//---rarus-spb_zlov 11.10.2016 


