
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	ТабДанных   = Неопределено;
	ТекстОшибки = "";
	
	Если уатЗащищенныеФункцииСервер_проф.Wialon_ПолучитьДанныеВсехТС(ТабДанных, ТекстОшибки) Тогда 
		ТекстОшибки = "Неудалось получить данные от системы GPS ""Wialon""." + Символы.ПС + ТекстОшибки;
		ВызватьИсключение ТекстОшибки;
		
	Иначе 
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("ТабДанныхWialon", ТабДанных);
		СхемаКомпоновкиДанных = ЭтотОбъект.СхемаКомпоновкиДанных;
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		
		КомпоновщикМакета         = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки           = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
		ПроцессорВывода           = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ДокументРезультат.АвтоМасштаб = Истина;
	КонецЕсли;
	
КонецПроцедуры

