
&НаКлиенте
Процедура ПодборКонтрагентов(Команда)
	Оповещение = Новый ОписаниеОповещения("ПодборКонтрагентовЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.ОС_ПользователиМП.Форма.ФормаПодбораКонтрагентов",Новый Структура("МножественныйВыбор",Истина),ЭтаФорма,,,,Оповещение);	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКонтрагентовЗавершение (Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого Эл Из Результат Цикл
		Если Объект.рсДоступныеКонтрагенты.НайтиСтроки(Новый Структура("Контрагент",Эл)).Количество() = 0 Тогда
			НоваяСтрока            = Объект.рсДоступныеКонтрагенты.Добавить();
			НоваяСтрока.Контрагент = ЭЛ;
			Модифицированность     = Истина;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Эл Из Метаданные.Языки Цикл
		Элементы.Язык.СписокВыбора.Добавить(Эл.Имя,Эл.Синоним);
	КонецЦикла;	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость ()
	//Элементы.ПользовательДО.Видимость = Объект.ДоступностьПодсистемыСогласованиеЗаявок;
	//Элементы.ПарольДО.Видимость       = Объект.ДоступностьПодсистемыСогласованиеЗаявок;
	Элементы.ПраваЛогиста.Доступность = Объект.ДоступностьПодсистемыПеревозки;
	Элементы.ЗаведениеЗаявокНаАрендуЗаДругогоМенеджера.Доступность = Объект.ДоступностьПодсистемыАрендаТехники;
	Элементы.КогоЗамещает.Доступность = Объект.ЗаведениеЗаявокНаАрендуЗаДругогоМенеджера;
КонецПроцедуры	

&НаКлиенте
Процедура ДоступностьПодсистемыСогласованиеЗаявокПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПодсистемыПеревозкиПриИзменении(Элемент)
	Если НЕ Объект.ДоступностьПодсистемыПеревозки Тогда
		Объект.ПраваЛогиста = Ложь;
	КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПодсистемыПродажиПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ЗаведениеЗаявокНаАрендуЗаДругогоМенеджераПриИзменении(Элемент)
	Если Не Объект.ЗаведениеЗаявокНаАрендуЗаДругогоМенеджера Тогда
		Объект.КогоЗамещает = Неопределено;
	КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры


