
&НаКлиенте
Процедура ОС_КаталогВременныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Диалог.Выбрать() Тогда
		НаборКонстант.пкКаталогВременныхФайлов = Диалог.Каталог;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАктуальнуюВерсию(Команда)
	ЗаполнитьАктуальнуюВерсиюСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАктуальнуюВерсиюСервер ()
	Каталог = НаборКонстант.пкКаталогВременныхФайлов + "\UPDATE\";
	МассивФайлов = НайтиФайлы(Каталог,"*",Ложь);
	мНомер = "";
	Для Каждого Файл Из МассивФайлов Цикл
		мНомер = ?(Файл.ЭтоКаталог() И Файл.Имя > мНомер,Файл.Имя,мНомер);
	КонецЦикла;	
	НаборКонстант.пкАктуальнаяВерсияМП = мНомер;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчаниюНаСервере()
	НаборКонстант.пкАктуальнаяВерсияМП   = "1.0.1";
	НаборКонстант.пкМинимальнаяВерсияМП  = "1.0.1";
	НаборКонстант.пкАдресРабочегоСервиса = "Localhost\PekkaniskaMobile";
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПоУмолчанию(Команда)
	ЗаполнитьНастройкиПоУмолчаниюНаСервере();
КонецПроцедуры
