#ОБЛАСТЬ СЕРИАЛИЗАЦИЯ  

Функция пкСериализовать (Объект) Экспорт
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(Объект);
	Запись             = Новый ЗаписьXML;
	Запись.УстановитьСтроку("UTF-8");
	ФабрикаXDTO.ЗаписатьXML(Запись,ОбъектXDTO);
	Текст = Запись.Закрыть();	
	Возврат Текст;
КонецФункции

Функция пкДесериализовать (СтрокаXML) Экспорт
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(СокрЛП(СтрокаXML));
	Попытка
		Рез = СериализаторXDTO.ПрочитатьXML(Чтение);
	Исключение
		мОшибка = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Ошибка синхронизации: " + мОшибка.Описание,УровеньЖурналаРегистрации.Ошибка);
		ВызватьИсключение мОшибка.Описание;
	КонецПопытки;	
	Чтение.Закрыть();
	Возврат Рез;
КонецФункции	

#КОНЕЦОБЛАСТИ
		
// Генерирует случайное имя файла в заданном каталоге //
// Разбиаем по подпапкам по дням //
Функция пкПолучитьСвободноеИмяФайла (Знач Каталог, Знач Префикс = "", Знач Расширение = "", Знач ТекстXML = "", СЧ = 0) Экспорт
	ИмяКаталога = Каталог + "/" + Формат(ТекущаяДата(),"ДФ=yyyy_MM_dd");
	
	мКаталог = Новый Файл(ИмяКаталога);
	Если НЕ мКаталог.Существует() Тогда
		СоздатьКаталог(ИмяКаталога);	
	КонецЕсли;	
	
	НовыйПрефикс = Префикс;
		
	ИмяФайла = ИмяКаталога + "/" + Формат(ТекущаяДата(),"ДФ=yyyy_MM_dd_ЧЧ_мм_сс") + "_" + пкУдалитьНедопустимыеСимволы(НовыйПрефикс) + ?(ЗначениеЗаполнено(Сч),"_" + Формат(СЧ,"ЧДЦ=; ЧН=0; ЧГ=0"),"") + "." + Расширение;
	
	
	Файл = Новый Файл(ИмяФайла);
	
	Если Файл.Существует() Тогда
		Возврат пкПолучитьСвободноеИмяФайла(Каталог,Префикс,Расширение,ТекстXML,СЧ + 1);
	Иначе
		Возврат ИмяФайла;
	КонецЕсли;	
КонецФункции

Функция пкУдалитьНедопустимыеСимволы (Знач ИмяXML)  Экспорт
	НедопустимыеСимволы = Новый Массив;
	НедопустимыеСимволы.Добавить("/");
	НедопустимыеСимволы.Добавить("\");
	НедопустимыеСимволы.Добавить(".");
	НедопустимыеСимволы.Добавить(":");
	НедопустимыеСимволы.Добавить("?");
	
	Значение = ИмяXML;
	
	Для Каждого Символ Из НедопустимыеСимволы Цикл 
		Значение = СтрЗаменить(Значение,Символ,"_");
	КонецЦикла;	
	
	Возврат Значение;
КонецФункции	
