
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка=Ложь;        
		СтруктураПараметров = Новый Структура;
   		СтруктураПараметров.Вставить("СсылкаНаОбъект", ВыбраннаяСтрока);
    	ОткрытьФорму("Документ.пкУчетРабочегоВремениСотрудников.Форма.Форма", СтруктураПараметров);
КонецПроцедуры


&НаКлиенте
Процедура СкопироватьВНовМес(Команда)
		СтандартнаяОбработка=Ложь;
		ТекСсылка = Элементы.Список.ВыделенныеСтроки.Получить(0);        
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("СоздатьКопированием", ТекСсылка);
    	ОткрытьФорму("Документ.пкУчетРабочегоВремениСотрудников.Форма.Форма", СтруктураПараметров);
КонецПроцедуры

