
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЭтоНовый() И ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		Запрос       = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	пкПользователиМП.Ссылка
		|ИЗ
		|	Справочник.пкПользователиМП КАК пкПользователиМП
		|ГДЕ
		|	пкПользователиМП.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ
		|	И пкПользователиМП.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("ИдентификаторПользователяИБ",ИдентификаторПользователяИБ);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Если Не Запрос.Выполнить().Пустой() Тогда
			ИдентификаторПользователяИБ = Неопределено;
		КонецЕсли;	
	КонецЕсли;	
		
	ЭлектроннаяПочта = НРег(СокрЛП(ЭлектроннаяПочта));
	
	Если ПометкаУдаления И ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		мПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если мПользовательИБ <> Неопределено Тогда
			мПользовательИБ.Удалить();
		КонецЕсли;	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ИдентификаторПользователяИБ)Тогда
		мПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	Иначе	
		мПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если мПользовательИБ = Неопределено Тогда
			мПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();   
		КонецЕсли;	
	КонецЕсли;
	
	мПользовательИБ.АутентификацияСтандартная = Истина;
	мПользовательИБ.Имя                       = Наименование;
	мПользовательИБ.ЗапрещеноИзменятьПароль   = Истина;
	мПользовательИБ.Пароль                    = Пароль;
	мПользовательИБ.ПолноеИмя                 = Наименование;
	мПользовательИБ.ПоказыватьВСпискеВыбора   = Ложь;

	мРоли = мПользовательИБ.Роли;
	мРоли.Очистить();
	мРоли.Добавить(Метаданные.Роли.БазовыеПраваБСП);
	мРоли.Добавить(Метаданные.Роли.пкДоступКМобильнойПодсистеме);
	мРоли.Добавить(Метаданные.Роли.пкПодтверждениеЗаявокНаАрендуТехники);
	
	мПользовательИБ.Записать();
	
	ИдентификаторПользователяИБ = мПользовательИБ.УникальныйИдентификатор;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		мПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если мПользовательИБ <> Неопределено Тогда
			мПользовательИБ.Удалить();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторПользователяИБ = Неопределено;
КонецПроцедуры
