
&НаСервере
Процедура ТехникаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ДопИнформацияПоТехнике КАК ДопИнформацияПоТехнике,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.БлокGSM КАК БлокGSM,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.Заблокирован КАК Заблокирован,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ЗаказНаряд КАК ЗаказНаряд,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ДатаБлокировки КАК ДатаБлокировки,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ДатаРазблокировки КАК ДатаРазблокировки
		|ИЗ
		|	РегистрСведений.пкДополнительнаяИнформацияТехника.СрезПоследних(, Техника = &Техника) КАК пкДополнительнаяИнформацияТехникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Техника", Запись.Техника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 ЗаполнитьЗначенияСвойств(Запись,ВыборкаДетальныеЗаписи,,);
		 Если ВыборкаДетальныеЗаписи.ДатаБлокировки <> Неопределено И ВыборкаДетальныеЗаписи.Заблокирован Тогда
		 
		 	ДатаБлокировкиСтарая = ВыборкаДетальныеЗаписи.ДатаБлокировки;	
		 
		 КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ТехникаПриИзменении(Элемент)
	ТехникаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Ключ.Пустой() Тогда
		Запись.Период 					= ТекущаяДата();
		Запись.ДопИнформацияПоТехнике  	= "";
		Запись.БлокGSM 					= Ложь;	
		Запись.Заблокирован 			= Ложь;
		Запись.ЗаказНаряд 				= Неопределено;
		Запись.ДатаБлокировки 			= Неопределено;
		Запись.ДатаРазблокировки 		= Неопределено;
		ТехникаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры
