// {Рарус koteld 2017.02 techlab@rarus.ru 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени("Обработка.УправлениеСчетамиИРеализациямиУслуг.ОткрытьФорму");
	ОткрытьФорму("Обработка.пкУправлениеСчетамиИРеализациямиУслуг.Форма", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
// }Рарус koteld 2017.02 techlab@rarus.ru 
