&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Префикс = Перечисления.пкПрефиксыПультовДляПодъемников.PTE;
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьКод(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда
		Объект.Код = СгенерироватьКодНаСервере(Префикс); 	
	КонецЕсли;  
КонецПроцедуры

&НаСервереБезКонтекста
Функция СгенерироватьКодНаСервере(рсПрефикс)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Префикс", рсПрефикс);	
	ТекущийНомер = РегистрыСведений.пкНомерПультаПоПрефиксу.Получить(Отбор).ТекущийНомер;
	ТекущийНомер = Макс(ТекущийНомер, 1);
	рсПрефиксСтрокой = "" + рсПрефикс;	
	
	Пока Истина Цикл
		
		Если ТекущийНомер > 999 Тогда
			ПроверяемыйКод = рсПрефиксСтрокой + ТекущийНомер;
		Иначе
			ПроверяемыйКод = рсПрефиксСтрокой + Формат(ТекущийНомер, "ЧЦ=3; ЧВН=");		
		КонецЕсли;
		
		ПроверяемыйОбъект = Справочники.пкПультыДляПодъемников.НайтиПоКоду(ПроверяемыйКод);		
		
		Если ПроверяемыйОбъект = Справочники.пкПультыДляПодъемников.ПустаяСсылка() Тогда
			Прервать;		
		КонецЕсли; 
		
		ТекущийНомер = ТекущийНомер + 1;
		
	КонецЦикла;
	
	ЗапистьНомера = РегистрыСведений.пкНомерПультаПоПрефиксу.СоздатьМенеджерЗаписи();
	ЗапистьНомера.Префикс = рсПрефикс;	
	ЗапистьНомера.ТекущийНомер = ТекущийНомер;
	ЗапистьНомера.Записать(Истина);
		
	Возврат ПроверяемыйКод;

КонецФункции


