
Функция СоздатьЗаявкуНаАрендуТехникиКоммерческоеПредложениеКлиенту(ОписаниеКоманды) Экспорт
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ОписаниеКоманды.ДополнительныеПараметры);
	    
    Если ОписаниеКоманды.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Множественный Тогда
		Основание = ОписаниеКоманды.ОбъектыОснований;
	Иначе
		Основание = ОписаниеКоманды.ОбъектыОснований[0];
    КонецЕсли;
    
    ПараметрыОткрытияФормы = Новый Структура("Основание", Основание);

	ОткрытьФорму(
		"Документ.пкЗаявкаНаАрендуТехники.Форма.ФормаДокумента",
		ПараметрыОткрытияФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);

КонецФункции

Функция СоздатьпкПостановкаСнятиеНаУчетВРостехнадзоре(ОписаниеКоманды) Экспорт
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ОписаниеКоманды.ДополнительныеПараметры);
	    
    Если ОписаниеКоманды.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Множественный Тогда
		Основание = ОписаниеКоманды.ОбъектыОснований;
	Иначе
		Основание = ОписаниеКоманды.ОбъектыОснований[0];
    КонецЕсли;
    
    ПараметрыОткрытияФормы = Новый Структура("Основание", Основание);

	ОткрытьФорму(
		"Документ.пкПостановкаСнятиеНаУчетВРостехнадзоре.Форма.ФормаДокумента",
		ПараметрыОткрытияФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);

КонецФункции
