
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("ЗаявкиНаАрендуТехники") Тогда
        ЗаявкиНаАрендуТехники = Параметры.ЗаявкиНаАрендуТехники;
    КонецЕсли;
    
    Если Параметры.Свойство("Модели") Тогда
        Модели = Параметры.Модели;
    КонецЕсли;
    
    Если Параметры.Свойство("Дата") Тогда
        Дата = Параметры.Дата;
    Иначе
        Дата = Неопределено;
    КонецЕсли;
    
    Если Параметры.Свойство("ДатаАренды") Тогда
        ДатаАренды = Параметры.ДатаАренды;
    Иначе
        ДатаАренды = Неопределено;
    КонецЕсли;
    
    Если Параметры.Свойство("ВидДоставки") Тогда
        ВидДоставки = Параметры.ВидДоставки;
        
        Если ВидДоставки = "Отгрузка" Тогда
            Элементы.ТехникаКДоставкеДатаДоставки.Заголовок = "Дата отгрузки";  
            Элементы.ТехникаКДоставкеДатаАренды.Заголовок   = "Начало аренды"; 
            
            Элементы.ОбщаяДатаДоставки.Заголовок = "Дата отгрузки";  
            Элементы.ОбщаяДатаАренды.Заголовок   = "Начало аренды";
        Иначе
            Элементы.ТехникаКДоставкеДатаДоставки.Заголовок = "Дата возврата";    
            Элементы.ТехникаКДоставкеДатаАренды.Заголовок   = "Последний день";
            
            Элементы.ОбщаяДатаДоставки.Заголовок = "Дата возврата";  
            Элементы.ОбщаяДатаАренды.Заголовок   = "Последний день";
        КонецЕсли;    
    КонецЕсли;
    
	ТехникаКДоставке.Очистить();
	
//++ Рарус Лимаренко 30.11.2017
	
	Если Не Параметры.Свойство("АдресТабКВозврату") Тогда
		
//-- Рарус Лимаренко 30.11.2017
	
	Для Каждого текМодель Из Модели Цикл
		Для Каждого текЗаявка Из ЗаявкиНаАрендуТехники Цикл
		 
			Если НЕ ЗначениеЗаполнено(текЗаявка.Значение) ИЛИ НЕ ЗначениеЗаполнено(текМодель.Значение) ИЛИ НЕ ЗначениеЗаполнено(ВидДоставки) Тогда
		        Продолжить;    
		    КонецЕсли;  
		    
			табТехника = пкУправлениеТехникойСервер.ПолучитьТехникуКДоставке(текЗаявка.Значение, текМодель.Значение, ВидДоставки);
			Для Каждого текСтрока Из табТехника Цикл
				
				НоваяСтрока = ТехникаКДоставке.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, текСтрока);
				НоваяСтрока.ЗаявкаНаАрендуТехники = текЗаявка.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
//++ Рарус Лимаренко 30.11.2017
	Иначе
		Если Параметры.АдресТабКВозврату = Неопределено Тогда
			
			Для Каждого текМодель Из Модели Цикл
			
			Для Каждого текЗаявка Из ЗаявкиНаАрендуТехники Цикл
		 
			Если НЕ ЗначениеЗаполнено(текЗаявка.Значение) ИЛИ НЕ ЗначениеЗаполнено(текМодель.Значение) ИЛИ НЕ ЗначениеЗаполнено(ВидДоставки) Тогда
		        Продолжить;    
		    КонецЕсли;  
		    
			табТехника = пкУправлениеТехникойСервер.ПолучитьТехникуКДоставке(текЗаявка.Значение, текМодель.Значение, ВидДоставки);
			Для Каждого текСтрока Из табТехника Цикл
				
				НоваяСтрока = ТехникаКДоставке.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, текСтрока);
				НоваяСтрока.ЗаявкаНаАрендуТехники = текЗаявка.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
			
		Иначе
	ТабКВозврату = ПолучитьИзВременногоХранилища(Параметры.АдресТабКВозврату);
	
	Для каждого Строка Из ТабКВозврату Цикл
	
		табТехника = пкУправлениеТехникойСервер.ПолучитьТехникуКДоставке(Строка.ЗаявкаНаАрендуТехники, Строка.Модель, ВидДоставки,Строка.ДатаВозврата);
			Для Каждого текСтрока Из табТехника Цикл
				НоваяСтрока = ТехникаКДоставке.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, текСтрока);
				НоваяСтрока.ЗаявкаНаАрендуТехники = Строка.ЗаявкаНаАрендуТехники;
		КонецЦикла;
	
	
	КонецЦикла;
	КонецЕсли;
	КонецЕсли;
//-- Рарус Лимаренко 30.11.2017

    
КонецПроцедуры

&НаКлиенте
Процедура ТехникаКДоставкеДатаАрендыПриИзменении(Элемент)
    
    ТекущиеДанные = Элементы.ТехникаКДоставке.ТекущиеДанные;
    
    Если ВидДоставки = "Отгрузка" Тогда
        ТекущиеДанные.ДатаДоставки = ТекущиеДанные.ДатаАренды;
    Иначе
        ТекущиеДанные.ДатаДоставки = ТекущиеДанные.ДатаАренды + 3600 * 24;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяДатаАрендыПриИзменении(Элемент)
    
    Если ВидДоставки = "Отгрузка" Тогда
        ОбщаяДатаДоставки = ОбщаяДатаАренды;
    Иначе
        ОбщаяДатаДоставки = ОбщаяДатаАренды + 3600 * 24;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляВсех(Команда)
    
    Для Каждого Строка ИЗ ТехникаКДоставке Цикл
        Строка.ДатаДоставки = ОбщаяДатаДоставки;
        Строка.ДатаАренды   = ОбщаяДатаАренды;
    КонецЦикла;    
        
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДаты(Команда)
    
    ИзменитьДатыНаСервере();
    
    ОповеститьОВыборе(Неопределено);
    
КонецПроцедуры

&НаСервере
Процедура ИзменитьДатыНаСервере()
    
    Для Каждого Строка ИЗ ТехникаКДоставке Цикл
        Если Строка.ДатаДоставки <> Строка.ДатаДоставкиДоИзменения ИЛИ Строка.ДатаАренды <> Строка.ДатаАрендыДоИзменения Тогда
            Если ЗначениеЗаполнено(Строка.ЗаданиеНаПеревозку) Тогда
                ЗаданиеНаПеревозку = Строка.ЗаданиеНаПеревозку.ПолучитьОбъект();
                ЗаданиеНаПеревозку.ДатаОтгрузки = Строка.ДатаДоставки;
                ЗаданиеНаПеревозку.ДатаАренды   = Строка.ДатаАренды;
                
                Попытка
                    ЗаданиеНаПеревозку.Записать(РежимЗаписиДокумента.Проведение);
                Исключение
                КонецПопытки;
            Иначе
                ОформитьЗаданиеНаПеревозку(Строка.ЗаявкаНаАрендуТехники, Строка.Модель, Строка.ДатаДоставки, Строка.ДатаАренды);   
            КонецЕсли;    
        КонецЕсли;    
    КонецЦикла; 
        
КонецПроцедуры

&НаСервере
Процедура ОформитьЗаданиеНаПеревозку(ЗаявкаНаАрендуТехники, Модель, ДатаДоставки, ДатаАренды)
            
    ЗаданиеНаПеревозку = Документы.пкЗаданиеНаПеревозку.СоздатьДокумент();
    
    ЗаданиеНаПеревозку.Дата                  = ТекущаяДата();
    ЗаданиеНаПеревозку.Статус                = Перечисления.пкСтатусыЗаданийНаПеревозку.Запланировано;
    
    ЗаданиеНаПеревозку.ВидОперации           = ?(ВидДоставки = "Отгрузка", Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту, 
        Перечисления.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента);
    
    ЗаданиеНаПеревозку.ДатаОтгрузки          = ДатаДоставки;
    ЗаданиеНаПеревозку.ДатаАренды            = ДатаАренды;
    ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники = ЗаявкаНаАрендуТехники;
    ЗаданиеНаПеревозку.Модель                = Модель;
    ЗаданиеНаПеревозку.АдресДоставки         = ЗаявкаНаАрендуТехники.АдресДоставки;
    ЗаданиеНаПеревозку.ВремяДоставкиС        = ЗаявкаНаАрендуТехники.ВремяДоставкиС;
    ЗаданиеНаПеревозку.ВремяДоставкиПо       = ЗаявкаНаАрендуТехники.ВремяДоставкиПо;
    ЗаданиеНаПеревозку.СпособДоставки        = ЗаявкаНаАрендуТехники.СпособДоставки;
    ЗаданиеНаПеревозку.Подразделение         = ЗаявкаНаАрендуТехники.ПодразделениеОтгрузки;
    
    Если ВидДоставки = "Возврат" Тогда
        ЗаданиеНаПеревозку.СкладПолучатель   = ЗаявкаНаАрендуТехники.ПодразделениеОтгрузки.пкСкладТехники;      
    КонецЕсли;
    
    Попытка
        ЗаданиеНаПеревозку.Записать(РежимЗаписиДокумента.Проведение);        
    Исключение
    КонецПопытки;
        
КонецПроцедуры    


 
 

