
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	ОбработкаКомандыСервер(ПараметрКоманды);
КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыСервер (ПараметрКоманды) 
	Выборка = ПланыОбмена.пкОбменСМобильнымиУстройствами.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Не Выборка.ПометкаУдаления И НЕ Выборка.ЭтотУзел Тогда
			Справочники.пкСтруктураДанных.ЗарегистрироватьИзмененияПоСтруктуреДанных(ПараметрКоманды,Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

