
///////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПолучитьЗначениеРеквизитаНаСервере(тОбъект, ИмяРевизита)
	
	Возврат тОбъект[ИмяРевизита];
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеПеречисленияНаСервере(ИмяПеречисления, ИмяЗначения)
	
	Возврат Перечисления[ИмяПеречисления][ИмяЗначения];
	
КонецФункции


///////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.пкЗаданиеНаПеревозку") Тогда
		
		ОткрытьФорму("Документ.пкДоставка.ФормаОбъекта", Новый Структура("Основание", ПараметрКоманды));
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		
		ОткрытьФорму("Документ.пкДоставка.ФормаОбъекта", Новый Структура("Основание", ПараметрКоманды));
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		
		ОткрытьФорму("Документ.пкДоставка.ФормаОбъекта", Новый Структура("Основание", 
			Новый Структура("ВидОперации, 
				|Модель, 
				|Техника", 
				ПолучитьЗначениеПеречисленияНаСервере("пкВидыОперацийЗаданийНаПеревозку", "ПеремещениеМеждуРегионами"), 
				ПолучитьЗначениеРеквизитаНаСервере(ПараметрКоманды, "пкМодель"),
				ПараметрКоманды)));
				
	КонецЕсли;
	
КонецПроцедуры
