
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
    
    //КомандаПечати = КомандыПечати.Добавить();
    //КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    //КомандаПечати.Идентификатор  = "ДополнительноеСоглашение";
    //КомандаПечати.Представление  = НСтр("ru = 'Дополнительное соглашение'");
    //КомандаПечати.Порядок        = 1;
    
    КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
	КомандаПечати.Идентификатор  = "ДополнительноеСоглашениеКраткое";
	КомандаПечати.Представление  = НСтр("ru = 'Введение новых тарифов на доп. оборудование'");
	КомандаПечати.Порядок        = 1;
    
    //КомандаПечати = КомандыПечати.Добавить();
    //КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    //КомандаПечати.Идентификатор  = "ДополнительноеСоглашениеМосква";
    //КомандаПечати.Представление  = НСтр("ru = 'Дополнительное соглашение (Москва)'");
    //КомандаПечати.Порядок        = 2;
    
    КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
	КомандаПечати.Идентификатор  = "ДопСоглашениеНаКонкрентныйОбъект";
	КомандаПечати.Представление  = НСтр("ru = 'Установление тарифов для конкретного объекта'");
	КомандаПечати.Порядок        = 2;
    
    //КомандаПечати = КомандыПечати.Добавить();
    //КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    //КомандаПечати.Идентификатор  = "ДополнительноеСоглашениеФНП";
    //КомандаПечати.Представление  = НСтр("ru = 'Дополнительное соглашение ФНП'");
    //КомандаПечати.Порядок        = 4;
    //
    //КомандаПечати = КомандыПечати.Добавить();
    //КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    //КомандаПечати.Идентификатор  = "ДополнительноеСоглашениеФНПКраткое";
    //КомандаПечати.Представление  = НСтр("ru = 'Дополнительное соглашение ФНП (краткое)'");
    //КомандаПечати.Порядок        = 5;
    //
    //КомандаПечати = КомандыПечати.Добавить();
    //КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    //КомандаПечати.Идентификатор  = "ДополнительноеСоглашениеФНПТранспортировка";
    //КомандаПечати.Представление  = НСтр("ru = 'Дополнительное соглашение ФНП (транспортировка)'");
    //КомандаПечати.Порядок        = 6;
    
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    КомандаПечати.Идентификатор  = "ДС1";
    КомандаПечати.Представление  = НСтр("ru = 'Дальние объекты (наша доставка)'");
    КомандаПечати.Порядок        = 3;
    
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    КомандаПечати.Идентификатор  = "ДС2";
    КомандаПечати.Представление  = НСтр("ru = 'Дальние объекты (самовывоз)'");
    КомандаПечати.Порядок        = 4;
    
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    КомандаПечати.Идентификатор  = "ДопСоглашениеДальниеОбъектыВыездСпециалиста";
    КомандаПечати.Представление  = НСтр("ru = 'Дальние объекты (выезд специалиста)'");
    КомандаПечати.Порядок        = 5;
    
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    КомандаПечати.Идентификатор  = "ДопСоглашениеНаУвеличениеТарифов";
    КомандаПечати.Представление  = НСтр("ru = 'Доп cоглашение на увеличение тарифов'");
    КомандаПечати.Порядок        = 6;
    
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    КомандаПечати.Идентификатор  = "УведомлениеОбУвеличенииТарифовНаРемонт";
    КомандаПечати.Представление  = НСтр("ru = 'Уведомление об увеличении тарифов на ремонт'");
    КомандаПечати.Порядок        = 7;
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Обработка.пкПечатьДоговоровИДопСоглашений";
    КомандаПечати.Идентификатор  = "ОбщееУведомлениеОбУвеличенииТарифовНаРемонт";
    КомандаПечати.Представление  = НСтр("ru = 'Общее уведомление об увеличении тарифов на ремонт'");
    КомандаПечати.Порядок        = 8;

            
КонецПроцедуры

#КонецОбласти

// Добавляет команду создания объекта.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры