#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ГруппаЗатрат = ГруппыЗатратСервер.ПредставлениеГруппыЗатрат(ЭтотОбъект);
	Наименование = Справочники.ПартииПроизводства.НаименованиеПартииПроизводства(ЭтотОбъект, ГруппаЗатрат);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее


#КонецОбласти

#КонецОбласти

#КонецЕсли
