
///////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПолучитьЗначениеРеквизитаНаСервере(тОбъект, ИмяРевизита)
	
	Возврат тОбъект[ИмяРевизита];
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеПеречисленияНаСервере(ИмяПеречисления, ИмяЗначения)
	
	Возврат Перечисления[ИмяПеречисления][ИмяЗначения];
	
КонецФункции

///////////////////////////////////////////////////////////////////////
&НаСервере
Процедура СформироватьПутевыеЛисты(МассивДоставок)
	
	СписокДоставокСПЛ = Новый СписокЗначений;
	
	ЗапросПутевыеЛисты = новый Запрос;
	ЗапросПутевыеЛисты.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатПутевойЛист.Ссылка
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|ГДЕ
	|	уатПутевойЛист.пкДоставка В(&ДокументыОснования)";
	ЗапросПутевыеЛисты.УстановитьПараметр("ДокументыОснования", МассивДоставок);
	
	ТаблицаДоставокСПЛ = ЗапросПутевыеЛисты.Выполнить().Выгрузить();
	Для Каждого текСтрока Из ТаблицаДоставокСПЛ Цикл
		Если СписокДоставокСПЛ.НайтиПоЗначению(текСтрока.Ссылка) = Неопределено Тогда
			СписокДоставокСПЛ.Добавить(текСтрока.Ссылка);
			
			тСообщение = Новый СообщениеПользователю;
			тсообщение.Текст = НСтр("ru=''");
			тСообщение.Сообщить();
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого текДоставка Из МассивДоставок Цикл
		
		Если СписокДоставокСПЛ.НайтиПоЗначению(текДоставка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		тОбъект = Документы.уатПутевойЛист.СоздатьДокумент();
		тОбъект.Заполнить(Новый Структура("пкДоставка", текДоставка));
		
		тОбъект.Дата = ТекущаяДата();
		тОбъект.УстановитьНовыйНомер();
		
		тОбъект.Комментарий = НСтр("ru='Сформирован командой на основании документа:'") + текДоставка + " " + ТекущаяДата() + " " + Пользователи.ТекущийПользователь();
		
		Попытка
			тОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
		Исключение
			тСообщение = Новый СообщениеПользователю;
			тсообщение.Текст = НСтр("ru=''");
			тСообщение.Сообщить();
		КонецПопытки;
		
		Попытка
			тОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			тСообщение = Новый СообщениеПользователю;
			тсообщение.Текст = НСтр("ru=''");
			тСообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.пкДоставка") Тогда
		ОткрытьФорму("Документ.пкДоставка.ФормаОбъекта", 
				Новый Структура("ВидОперации, 
					|Модель, 
					|Техника, 
					|пкДоставка", 
					ПолучитьЗначениеПеречисленияНаСервере("пкВидыОперацийЗаданийНаПеревозку", "ПеремещениеМеждуРегионами"), 
					ПолучитьЗначениеРеквизитаНаСервере(ПараметрКоманды, "пкМодель"),
					ПараметрКоманды));
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		СформироватьПутевыеЛисты(ПараметрКоманды);
	КонецЕсли;
	
КонецПроцедуры
