
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого ТекСтрока Из ГСМвТС Цикл 
		Если ТекСтрока.КоличествоУчет - ТекСтрока.Количество > 0 И Не ЗначениеЗаполнено(АЗС) Тогда 
			ТекстОшибки = "В документе есть ТС с ГСМ, учетное количество которого превышает фактическое" + Символы.ПС
			+ "Для правильного заполнения документа ""Слив ГСМ"" необходимо заполнить реквизит ""Склад""";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,ЭтотОбъект,"АЗС",,Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
