
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайла()
	
	//Проверим наличие файла
	ФайлОб = Новый Файл(ВыборФайла);
	ФайлОб.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ЗагрузитьДанныеИзФайлаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаЗавершение(Существует, ДополнительныеПараметры) Экспорт
    
    Если Не Существует Тогда
        ТекстОшибки = "Файл загрузки не найден";
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"ВыборФайла");
        Возврат;
    КонецЕсли;
    
    Состояние("Идет чтение файла данных");
    ХранилищеФайлаВыгрузки = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВыборФайла));
    ТекстОшибки = "";
    
    КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьМестоположениеТСизФайла(ХранилищеФайлаВыгрузки, ТекстОшибки);
    
    УдалитьИзВременногоХранилища(ХранилищеФайлаВыгрузки);
    
    Если КодВозврата Тогда
        Сообщить(ТекстОшибки);
    Иначе 
        Элементы.ИнфНадписьЗагрузкаЗавершена.Видимость = Истина;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеЧерезВебСервис()
	
	ТекстОшибки = "";
	ХранилищеФайлаВыгрузки = "";
	
	КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьМестоположениеТСDynafleet(ТекстОшибки,,ХранилищеФайлаВыгрузки, ЭтаФорма.УникальныйИдентификатор);
	
	Если КодВозврата Тогда
		Сообщить(ТекстОшибки);
		Возврат;
	Иначе 
		Элементы.ИнфНадписьЗагрузкаЗавершена.Видимость = Истина;
	КонецЕсли;
	
	Если Не ХранилищеФайлаВыгрузки = "" Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "В ходе загрузки получены данные для ТС, идентификатор которых не совпадает ни с одним из имеющихся в справочнике ""ТС"".
		|Эта информация не будет загружена в систему.
		|Сохранить файл с данными во временный каталог для последующей загрузки?";
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьДанныеЧерезВебСервисЗавершение", ЭтотОбъект), Текст, Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеЧерезВебСервисЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
        
        ДиалогВыбораФайла.Фильтр    = "Файл данных (*.xml)|*.xml";
        ДиалогВыбораФайла.Заголовок = "Выберите путь";
        ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
        ДиалогВыбораФайла.Расширение     = "xml";
        ДиалогВыбораФайла.ИндексФильтра  = 0;
        
        ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ЗагрузитьДанныеЧерезВебСервисЗавершениеЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеЧерезВебСервисЗавершениеЗавершение(ВыбранныеФайлы, ДополнительныеПараметры1) Экспорт
    
    ДиалогВыбораФайла = ДополнительныеПараметры1.ДиалогВыбораФайла;
    
    
    Если (ВыбранныеФайлы <> Неопределено) Тогда
        ДанныеХранилища = ПолучитьИзВременногоХранилища(ХранилищеФайлаВыгрузки);
        ДанныеХранилища.Записать(ДиалогВыбораФайла.ПолноеИмяФайла);
    КонецЕсли;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Константы.уатИспользоватьDynafleet.Получить() Тогда
		ТекстСообщения = "Открытие возможно только тогда, когда включено использование системы GPS - Dynafleet.";
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстСообщения, Отказ);
	КонецЕсли;
	
	ВыборРежимаЗагрузки = 1;
	Элементы.ПанельЗагрузки.ТекущаяСтраница = Элементы.ПанельЗагрузки.ПодчиненныеЭлементы.ЗагрузкаССайта;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	
	Если Элементы.ИнфНадписьЗагрузкаЗавершена.Видимость Тогда 
		Элементы.ИнфНадписьЗагрузкаЗавершена.Видимость = Ложь;
	КонецЕсли;
	
	ТекстОшибки = "";
	Отказ = Ложь;
	
	Если ВыборРежимаЗагрузки = 2 И Не ЗначениеЗаполнено(ВыборФайла) Тогда 
		ТекстОшибки = "Необходимо выбрать внешний файл загрузки";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"ВыборФайла",,Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда 
		Если ВыборРежимаЗагрузки = 1 Тогда
			ЗагрузитьДанныеЧерезВебСервис();
		Иначе
			ЗагрузитьДанныеИзФайла();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
Процедура ВыборФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр    = "Файл данных (*.xml)|*.xml";
	ДиалогВыбораФайла.Заголовок = "Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.Расширение     = "xml";
	ДиалогВыбораФайла.ИндексФильтра  = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла = ВыборФайла;
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ВыборФайлаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    
    ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
    
    
    Если (ВыбранныеФайлы <> Неопределено) Тогда
        ВыборФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборРежимаЗагрузкиПриИзменении(Элемент)
	
	ВыборФайла = "";
	
	Если ВыборРежимаЗагрузки = 1 Тогда
		Элементы.ПанельЗагрузки.ТекущаяСтраница = Элементы.ПанельЗагрузки.ПодчиненныеЭлементы.ЗагрузкаССайта;
	Иначе
		Элементы.ПанельЗагрузки.ТекущаяСтраница = Элементы.ПанельЗагрузки.ПодчиненныеЭлементы.ЗагрузкаИзФайла;
	КонецЕсли;
	
КонецПроцедуры
