
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // {Рарус ilkond 2017.03.22 techlab@rarus.ru
    ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремениСКомментарием(
        "Обработка.пкПодборТехники.Форма: Открытие формы", "Обработка.пкПодборТехники.Команды.СостояниеТехники");
    // }Рарус ilkond 2017.03.22 techlab@rarus.ru     
    
    ПараметрЗаголовок = НСтр("ru = 'Состояние техники'");
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Заголовок",       ПараметрЗаголовок);
    ПараметрыФормы.Вставить("КодФормы",        "СостояниеТехники");
    ПараметрыФормы.Вставить("ИзменениеСтроки", Ложь);
    ПараметрыФормы.Вставить("Модель",          Неопределено);
    
    ОткрытьФорму("Обработка.пкПодборТехники.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
    
КонецПроцедуры
