
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	Логин       = Константы.уатЛогинВСистемеDynafleet.Получить();
	Пароль      = Константы.уатПарольВСистемеDynafleet.Получить();
	ТабДанных   = Новый ТаблицаЗначений;
	ТекстОшибки = "";
	
	Если Константы.уатИспользоватьDynafleet.Получить() Тогда 
		Если уатЗащищенныеФункцииСервер_проф.ПолучитьВсеДанныеПоТСDynafleet(Логин, Пароль, ТабДанных, ТекстОшибки) Тогда 
			ТекстОшибки = "Неудалось получить данные от системы ""Dynafleet""." + Символы.ПС + ТекстОшибки;
			ВызватьИсключение ТекстОшибки;
			
		Иначе 
			ВнешниеНаборыДанных = Новый Структура;
			ВнешниеНаборыДанных.Вставить("ТаблицаДанныхПоТС", ТабДанных);
			СхемаКомпоновкиДанных = ЭтотОбъект.СхемаКомпоновкиДанных;
			ВариантНастроек       = СхемаКомпоновкиДанных.ВариантыНастроек.Найти(ЭтотОбъект.ВариантОтчета);
			Если ВариантНастроек = Неопределено Тогда
				Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
			Иначе
				Настройки = ВариантНастроек.Настройки;
			КонецЕсли;
			
			КомпоновщикМакета         = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки           = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
			ПроцессорВывода           = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			ДокументРезультат.АвтоМасштаб = Истина;
		КонецЕсли;
		
	Иначе 
		ДокументРезультат = Новый ТабличныйДокумент;
		ТекстОшибки = "Использование системы GPS ""Dynafleet"" отключено.";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры
