
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыЗавершение",ЭтотОбъект,ПараметрКоманды);
	ОткрытьФорму("ПланОбмена.пкОбменСМобильнымиУстройствами.ФормаВыбора",Новый Структура("МножественныйВыбор",Истина),,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение (Рез, ДополнительныеПараметры) Экспорт
	Если Рез <> Неопределено Тогда
		ОбработкаКомандыСервер(Рез,ДополнительныеПараметры);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ОбработкаКомандыСервер (Рез,ПараметрКоманды) 
	ИменаМета = Справочники.пкСтруктураДанных.ПолучитьИменаГруппМетаданных();
	ПланыОбмена.ЗарегистрироватьИзменения(Рез,Метаданные[ИменаМета[ПараметрКоманды.ИмяТипа]][ПараметрКоманды.ИмяТаблицы]);
КонецПроцедуры	

