#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;

	СуммаДокумента=Расшифровка.Итог("СуммаЗадолженности");	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ПроверяемыеРеквизиты.Добавить("Организация");
	//ПроверяемыеРеквизиты.Добавить("Подразделение");
	//ПроверяемыеРеквизиты.Добавить("ТопливныеКарты.Сотрудник");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.пкПретензия.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СформироватьСписокРегистровДляКонтроля();
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	РегистрыСведений.пкПретензииПоСчетам.СформироватьЗаписи(Отказ, РежимПроведения, ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	СформироватьСписокРегистровДляКонтроля();
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Организация		= ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение	= ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Пользователи.ТекущийПользователь());
	Ответственный	= Пользователи.ТекущийПользователь();
	Автор 			= Пользователи.ТекущийПользователь();
	ОтветственныеЛица = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Организация, ТекущаяДата());
	Подписывает		= ОтветственныеЛица.Руководитель;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

Функция ПолучитьПечатьТаблДокПретензия1(СтруктураПараметровДляПечати) экспорт
	ТабличныйДокумент=Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб=Истина;
	Макет_ШаблонПретензия1_Аренда = ПолучитьМакет("ПретензияАренда");
	ОбластьТело=Макет_ШаблонПретензия1_Аренда.ПолучитьОбласть("Тело");
	ЗаполнитьЗначенияСвойств(ОбластьТело.Параметры,СтруктураПараметровДляПечати);
	ТабличныйДокумент.Вывести(ОбластьТело);
	Возврат ТабличныйДокумент;
КонецФункции	

Функция ПолучитьПечатьТаблДокПретензия2(СтруктураПараметровДляПечати) экспорт
	ТабличныйДокумент=Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб=Истина;
	Макет_ШаблонПретензия1_Аренда = ПолучитьМакет("ПретензияАрендаРемонт");
	ОбластьТело=Макет_ШаблонПретензия1_Аренда.ПолучитьОбласть("Тело");
	ЗаполнитьЗначенияСвойств(ОбластьТело.Параметры,СтруктураПараметровДляПечати);
	ТабличныйДокумент.Вывести(ОбластьТело);
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьПечатьТаблДокПретензия3(СтруктураПараметровДляПечати) экспорт
	ТабличныйДокумент=Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб=Истина;
	Макет_ШаблонПретензия1_Аренда = ПолучитьМакет("ПретензияАрендаВозврат");
	ОбластьТело=Макет_ШаблонПретензия1_Аренда.ПолучитьОбласть("Тело");
	ЗаполнитьЗначенияСвойств(ОбластьТело.Параметры,СтруктураПараметровДляПечати);
	ТабличныйДокумент.Вывести(ОбластьТело);
	Возврат ТабличныйДокумент;
КонецФункции