
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Запрос       = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	МАКСИМУМ(пкОбменСМобильнымиУстройствами.Код) КАК Код
	//|ИЗ
	//|	ПланОбмена.пкОбменСМобильнымиУстройствами КАК пкОбменСМобильнымиУстройствами
	//|ГДЕ
	//|	НЕ пкОбменСМобильнымиУстройствами.ЭтотУзел";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	мНомер = ?(ЗначениеЗаполнено(Выборка.Код),Число(Выборка.Код),1);
	//Иначе
	//	мНомер = 1;
	//КонецЕсли;
	//
	//МаксНомер = Константы.пкМаксимальныйНомерУзлаОбмена.Получить();
	//
	//Если ЗначениеЗаполнено(МаксНомер) Тогда
	//	мНомер = Макс(мНомер,МаксНомер);
	//КонецЕсли;
	//
	//мНомер = мНомер + 1;
	//
	//СтандартнаяОбработка = ЛОЖЬ;
	//
	//Код = Формат(мНомер,"ЧЦ=4; ЧДЦ=; ЧН=0000; ЧВН=; ЧГ=");
	//
	//Константы.пкМаксимальныйНомерУзлаОбмена.Установить(Код);
	
	УстановитьПривилегированныйРежим(ЛОЖЬ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	
КонецПроцедуры
