#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
//++ Рарус Лимаренко 16.02.2018 Заявка 9633
		УстановитьПривилегированныйРежим(Истина);
		ЗаписьИзменения =  РегистрыСведений.пкИзмененияПартнеровСегментов.СоздатьМенеджерЗаписи();
		ЗаписьИзменения.Период = ТекущаяДата();
		ЗаписьИзменения.Контрагент =  Строка(ЭтотОбъект.Отбор.Партнер.Значение);
		ЗаписьИзменения.Сегмент =  ЭтотОбъект.Отбор.Сегмент.Значение;
		ЗаписьИзменения.Пользователь = Пользователи.ТекущийПользователь();
		ЗаписьИзменения.Записать();
		УстановитьПривилегированныйРежим(Ложь);
//-- Рарус Лимаренко 16.02.2018 Заявка 9633

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
