#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Синоним КАК Синоним
	|ПОМЕСТИТЬ ВТТаблицаСпособовРасчетов
	|ИЗ
	|	&ТаблицаСпособовРасчетов КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	ВТТаблицаСпособовРасчетов КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В(&ДоступныеСпособыРасчетов)
	|	И Таблица.Синоним ПОДОБНО &СтрокаПоиска";
	
	Если Параметры.СтрокаПоиска = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Таблица.Синоним ПОДОБНО &СтрокаПоиска", "");
	КонецЕсли;
	
	// Составляем таблицу способов расчетов.
	ТаблицаСпособовРасчетов = Новый ТаблицаЗначений;
	ТаблицаСпособовРасчетов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыРасчетовСФизическимиЛицами"));
	ТаблицаСпособовРасчетов.Колонки.Добавить("Синоним", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(256)));
	
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.СпособыРасчетовСФизическимиЛицами.ЗначенияПеречисления Цикл
		НоваяСтрока = ТаблицаСпособовРасчетов.Добавить();
		НоваяСтрока.Ссылка = Перечисления.СпособыРасчетовСФизическимиЛицами[ЗначениеПеречисления.Имя];
		НоваяСтрока.Синоним = ЗначениеПеречисления.Синоним;
	КонецЦикла;
	
	// Отбор только по доступным способам с учетом введенной строки.
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаСпособовРасчетов", ТаблицаСпособовРасчетов);
	Запрос.УстановитьПараметр("ДоступныеСпособыРасчетов", Перечисления.СпособыРасчетовСФизическимиЛицами.ДоступныеСпособыРасчетов());
	Запрос.УстановитьПараметр("СтрокаПоиска", Строка(Параметры.СтрокаПоиска) + "%");
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формируется массив доступных способов расчетов.
//
Функция ДоступныеСпособыРасчетов() Экспорт
	
	СпособыРасчетов = Новый Массив;
	СпособыРасчетов.Добавить(Перечисления.СпособыРасчетовСФизическимиЛицами.РасчетыСКонтрагентами);
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		СпособыРасчетов.Добавить(Перечисления.СпособыРасчетовСФизическимиЛицами.Дивиденды);
		СпособыРасчетов.Добавить(Перечисления.СпособыРасчетовСФизическимиЛицами.ДивидендыСотрудникам);
	КонецЕсли;
	
	Возврат СпособыРасчетов;
	
КонецФункции

#КонецОбласти

#КонецЕсли