////////////////////////////////////////////////////////////////////////////////
// Переопределяемые процедуры, вызываемые из обработчиков форм, таких как:
// "ПриСозданииНаСервере", "ПриЧтенииНаСервере", "ПередЗаписьюНаСервере", 
// "ПослеЗаписи", а также при изменении некоторых реквизитов табличной части,
// таких как "Номенклатура", "Характеристика".
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ЗаполнениеОбработчиковФормы

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - форма, из обработчика события которой происходит вызов процедуры.
//	см. справочную информацию по событиям управляемой формы.
//
Процедура ПослеЗаписи(Форма, ПараметрыЗаписи)Экспорт
    //+++rarus-spb_zlov 04.07.2016    
    пкМодификацияКлиент.ПослеЗаписи(Форма, ПараметрыЗаписи);
    //---rarus-spb_zlov 04.07.2016 
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеНоменклатуры

// Переопределяемая процедура, вызываемая из обработчика реквизита "Номенклатура" табличной части.
//
// Параметры:
// 	ТекущаяСтрока - ДанныеФормыЭлементКоллекции - текущая строка табличной части.
// 	ПараметрыДействия - Структура - допустимые действия для табличной части.
//	КэшированныеЗначения - Структура - Кэшированные значения табличной части.
Процедура НоменклатураПриИзмененииПереопределяемый(ТекущаяСтрока,ПараметрыДействия,КэшированныеЗначения)Экспорт


КонецПроцедуры
  
#КонецОбласти 

#Область ЗаполнениеХарактеристики

// Переопределяемая процедура, вызываемая из обработчика реквизита "Характеристика" табличной части.
//
// Параметры:
// 	ТекущаяСтрока - ДанныеФормыЭлементКоллекции - текущая строка табличной части.
// 	ПараметрыДействия - Структура - допустимые действия для табличной части.
//	КэшированныеЗначения - Структура - Кэшированные значения табличной части.
Процедура ХарактеристикаПриИзмененииПереопределяемый(ТекущаяСтрока,ПараметрыДействия,КэшированныеЗначения)Экспорт


КонецПроцедуры
	
#КонецОбласти 

#Область Общие

// Проверка необходимость вызова сервера при обработке строки табличной части.
//
// Параметры:
// 	ИмяСвойства - Строка -  имя передаваемого свойства.
// 	ПараметрыДействия - Структура - допустимые действия для табличной части.
//
// Возвращаемое значение:
//	Истина
//
Функция ОбработкаТабличнойЧастиНеобходимВызовСервера(ИмяСвойства,ПараметрыДействия)Экспорт

	Возврат Истина	

КонецФункции   
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры) Экспорт
    //+++rarus-spb_zlov 04.07.2016    
    пкМодификацияКлиент.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);  
    //---rarus-spb_zlov 04.07.2016 
    
    //{УАТ}
    уатИнтеграцияКлиент.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
    //{/УАТ}	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти
