////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы управления ремонтами.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Раньше можно было выбирать статьи с распределением на объект эксплуатации.
//  Теперь только на заказ на ремонт.
//
// Параметры:
//  СтатьиРасходов	 - Массив, ПланВидовХарактеристикСсылка.СтатьиРасходов	 - Статьи расходов, которые надо проверить на доступность.
// 
// Возвращаемое значение:
//  Массив - Содержит статьи расходов, которые недоступны для выбора.
//
Функция НедоступныеСтатьиРасходовНаРемонт(СтатьиРасходов) Экспорт

	Если ТипЗнч(СтатьиРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") Тогда
		СписокСтатьей = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтатьиРасходов);
	Иначе
		СписокСтатьей = СтатьиРасходов;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтатьиРасходов.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|ГДЕ
	|	СтатьиРасходов.Ссылка В (&СтатьиРасходов)
	|	И НЕ СтатьиРасходов.РасходыНаЗаказыНаРемонт";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СтатьиРасходов", СписокСтатьей);
	
	НедоступныеСтатьи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат НедоступныеСтатьи;
	
КонецФункции

#КонецОбласти
