////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен с банками по зарплатным проектам".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ВыгрузитьФайлыДляОбменаСБанком(СтруктураПараметров, АдресХранилища) Экспорт
	
	СтруктураПараметров.Вставить("МассивОписанийФайлов", Новый Массив);
		
	МетаданныеПлатежногоДокумента = ОбменСБанкамиПоЗарплатнымПроектам.МетаданныеПлатежногоДокументаПеречисленияЗарплаты();
	
	ДокументыПоТипам = ОбщегоНазначенияБЗК.ОбъектыПоТипам(СтруктураПараметров.МассивДокументов);
	Для Каждого ДокументыПоТипу Из ДокументыПоТипам Цикл
		
		МетаданныеДокумента = Метаданные.НайтиПоТипу(ДокументыПоТипу.Ключ);
		Если (МетаданныеПлатежногоДокумента = Неопределено
			Или МетаданныеДокумента.ПолноеИмя() <> МетаданныеПлатежногоДокумента.ПолноеИмя()) Тогда
			СтруктураПараметров.Вставить("МассивДокументов", ДокументыПоТипу.Значение);
			МенеджерДокумента = ОбщегоНазначенияБЗК.МенеджерОбъектаПоТипу(ДокументыПоТипу.Ключ);
			МенеджерДокумента.ВыгрузитьФайлыДляОбменаСБанком(СтруктураПараметров)
		Иначе
			Для Каждого ПлатежныйДокумент Из ДокументыПоТипу.Значение Цикл
				СтруктураПараметров.Вставить("МассивДокументов", ОбменСБанкамиПоЗарплатнымПроектам.ВедомостиПлатежногоДокументаПеречисленияЗарплаты(ПлатежныйДокумент));
				СтруктураПараметров.Вставить("ПлатежныйДокумент", ПлатежныйДокумент);
				ОбменСБанкамиПоЗарплатнымПроектам.ВыгрузитьФайлыДляОбменаСБанкомПоВедомости(СтруктураПараметров);
			КонецЦикла	
		КонецЕсли;
		
	КонецЦикла;
		
	ПоместитьВоВременноеХранилище(СтруктураПараметров.МассивОписанийФайлов, АдресХранилища);
	
КонецПроцедуры

// см. ОбменСБанкамиПоЗарплатнымПроектам.ПолучитьСтруктуруКлючевыхРеквизитовОбъекта
Процедура ПолучитьСтруктуруКлючевыхРеквизитовОбъекта(ИмяОбъекта, СтруктураКлючевыхРеквизитов) Экспорт
	
	Если ИмяОбъекта = "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников" Тогда
		// шапка
		СтрокаРеквизитовОбъекта = ("Дата, Номер, Организация, ЗарплатныйПроект, НомерРеестра, ПометкаУдаления");
		СтруктураКлючевыхРеквизитов.Вставить("Шапка", СтрокаРеквизитовОбъекта);
		
		// ТЧ
		СтрокаРеквизитовОбъекта = "";
		Для Каждого РеквизитДокумента Из Метаданные.Документы.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.ТабличныеЧасти.Сотрудники.Реквизиты Цикл
			СтрокаРеквизитовОбъекта = СтрокаРеквизитовОбъекта + РеквизитДокумента.Имя + ", ";
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаРеквизитовОбъекта, 2);
		СтруктураКлючевыхРеквизитов.Вставить("Сотрудники", СтрокаРеквизитовОбъекта);
		
	ИначеЕсли ИмяОбъекта = "Документ.ВедомостьНаВыплатуЗарплатыВБанк" Тогда
		// шапка
		СтрокаРеквизитовОбъекта = ("Дата, Номер, Организация, ЗарплатныйПроект, НомерРеестра, ПометкаУдаления");
		СтруктураКлючевыхРеквизитов.Вставить("Шапка", СтрокаРеквизитовОбъекта);
		
		// ТЧ
		СтрокаРеквизитовОбъекта = ("Сотрудник, ФизическоеЛицо, КВыплате, КомпенсацияЗаЗадержкуЗарплаты, НомерЛицевогоСчета");
		СтруктураКлючевыхРеквизитов.Вставить("Зарплата", СтрокаРеквизитовОбъекта);
		
	ИначеЕсли ИмяОбъекта = "Документ.ПлатежноеПоручение" Тогда
		// шапка
		СтрокаРеквизитовОбъекта = ("Дата, Номер, Организация, НомерРеестра, ПометкаУдаления");
		СтруктураКлючевыхРеквизитов.Вставить("Шапка", СтрокаРеквизитовОбъекта);
		
		// ТЧ
		СтрокаРеквизитовОбъекта = ("Ведомость");
		СтруктураКлючевыхРеквизитов.Вставить("Ведомости", СтрокаРеквизитовОбъекта);
		
	ИначеЕсли ИмяОбъекта = "Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников" Тогда
		// шапка
		СтрокаРеквизитовОбъекта = ("Дата, Номер, Организация, ЗарплатныйПроект, НомерРеестра, ПометкаУдаления");
		СтруктураКлючевыхРеквизитов.Вставить("Шапка", СтрокаРеквизитовОбъекта);
		
		// ТЧ
		СтрокаРеквизитовОбъекта = ("Сотрудник, ФизическоеЛицо, ДатаЗакрытия, ЛицевойСчет");
		СтруктураКлючевыхРеквизитов.Вставить("Сотрудники", СтрокаРеквизитовОбъекта);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковОписаниеФиксацииРеквизитов() Экспорт
	
	Описания = Новый Массив;

	Описание = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	
	Описание.ИмяГруппы = "Сотрудник";
	
	Описание.ИмяРеквизита = "ТабельныйНомер";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ДатаПриема";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "Должность";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	
	Описание.ИмяГруппы = "ФизическоеЛицо";
	
	Описание.ИмяРеквизита = "ЯвляетсяРезидентом";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "Гражданство";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "СтраховойНомерПФР";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	
	Описание.ИмяРеквизита = "Пол";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ДатаРождения";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ТелефонДомашний";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ТелефонДомашнийПредставление";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ТелефонРабочий";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ТелефонРабочийПредставление";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	
	Описание.ИмяРеквизита = "МестоРождения";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "МестоРожденияПредставление";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "АдресМестаРаботы";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "АдресМестаРаботыПредставление";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "АдресДляИнформирования";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "АдресДляИнформированияПредставление";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "АдресПоПрописке";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "АдресПоПропискеПредставление";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "АдресМестаПроживания";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "АдресМестаПроживанияПредставление";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	
	Описание.ИмяГруппы = "ФизическоеЛицоДокумент";
	Описание.ФиксацияГруппы = Истина;
	
	Описание.ИмяРеквизита = "ДокументВид";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ДокументСерия";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ДокументНомер";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ДокументДатаВыдачи";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ДокументСрокДействия";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ДокументКемВыдан";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ДокументКодПодразделения";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	Описание.ИмяРеквизита = "ДокументПредставление";
	Описания.Добавить(Новый ФиксированнаяСтруктура(Описание));
	
	ОписаниеФиксацииРеквизитов = Новый Соответствие;
	Префикс = "Сотрудники"; // Не локализуется
	Для Каждого Описание Из Описания Цикл
		ОписаниеФиксацииРеквизитов.Вставить(Префикс + Описание.ИмяРеквизита, Описание); 
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(ОписаниеФиксацииРеквизитов)
	
КонецФункции	

#КонецОбласти
