
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПродолжениеЗаписи Тогда
		Отказ				= Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюПродолжить", ЭтаФорма, Новый Структура), 
			НСтр("ru='Установить способ доступным по умолчанию для всех объектов?'"), 
				РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	КонецЕсли;
	
	ПродолжениеЗаписи	= Ложь;
			
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПродолжить(Результат, ПараметрыОповещения) Экспорт

	УстанавливатьДляВсех = (Результат = КодВозвратаДиалога.Да);
	
	ПродолжениеЗаписи	= Истина;
    Записать();
	
	Если ЗакрыватьФорму Тогда
		ЗакрыватьФорму = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДоступенДляВсех", УстанавливатьДляВсех);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	ЗакрыватьФорму = Истина;
    Записать();
	
КонецПроцедуры
