
///////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаданиеНаПеревозку		= Параметры.ЗаданиеНаПеревозку;
	КлючДоставка			= Параметры.КлючДоставка;
	КлючНомерХодки			= Параметры.КлючНомерХодки;
	КлючПриемкаВозврат		= Параметры.КлючПриемкаВозврат;
	КлючПартнер				= Параметры.КлючПартнер;
	КлючДоговор				= Параметры.КлючДоговор;
	КлючОбъектСтроительства	= Параметры.КлючОбъектСтроительства;
	КлючАдресДоставки		= Параметры.КлючАдресДоставки;
	КлючКонтактноеЛицо		= Параметры.КлючКонтактноеЛицо;
	КлючПодразделение		= Параметры.КлючПодразделение;
	НовыйСуществующий		= Параметры.НовыйСуществующий;

	ТочкаМаршрута			= Параметры.ТочкаМаршрута;

	Транспортировка			= Параметры.Транспортировка;
	СтоимостьАренды			= Параметры.СтоимостьАренды;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.АктПриекиВозврата.Видимость = (НовыйСуществующий = 1);
КонецПроцедуры

///////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура НовыйСуществующийПриИзменении(Элемент)
	Элементы.АктПриекиВозврата.Видимость = (НовыйСуществующий = 1);
КонецПроцедуры

///////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ДобавиттьВАкт(Команда)
	
	Отказ = Ложь;
	
	Если НовыйСуществующий = 1 И Не ЗначениеЗаполнено(АктПриекиВозврата) Тогда
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = НСтр("ru='Не выбран Акт!'");
		тСообщение.Сообщить();
		Отказз = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьВАктНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВАктНаСервере()
	
	Если НовыйСуществующий = 0 Тогда
		тОбъект = Документы.пкАктПриемкиВозврата.СоздатьДокумент();
		тОбъект.Дата = ЗаданиеНаПеревозку.ДатаОтгрузки;
		тОбъект.УстановитьНовыйНомер();
		тОбъект.Автор				= ПараметрыСеанса.ТекущийПользователь;
		тОбъект.Ответственный		= ПараметрыСеанса.ТекущийПользователь;
	Иначе
		тОбъект = АктПриекиВозврата.ПолучитьОбъект();
	КонецЕсли;
	
	//Добавим задание в Акт
	НоваяСтрока = тОбъект.ЗаданияНаПеревозку.Добавить();
	НоваяСтрока.ЗаданиеНаПеревозку		= ЗаданиеНаПеревозку;
	НоваяСтрока.ЗаявкаНаАрендуТехники	= ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники;
		
	//3. Обновляем/Заполняем Ключи в Акт
	тОбъект.Доставка			= КлючДоставка;
	тОбъект.ПриемкаВозврат 		= КлючПриемкаВозврат;
	тОбъект.НомерХодки			= КлючНомерХодки;
	тОбъект.Партнер				= КлючПартнер;
	тОбъект.Договор				= КлючДоговор;
	тОбъект.ОбъектСтроительства	= КлючОбъектСтроительства;
	тОбъект.АдресДоставки		= КлючАдресДоставки;
	тОбъект.КонтактноеЛицо		= КлючКонтактноеЛицо;
	тОбъект.Подразделение		= КлючПодразделение;
	
	тОбъект.ТочкаМаршрута		= ТочкаМаршрута;
	тОбъект.Комментарий			= ЗаданиеНаПеревозку.Комментарий;
	
	Для Каждого текСтрокаАкта Из тОбъект.ЗаданияНаПеревозку Цикл
		Если текСтрокаАкта.ЗаданиеНаПеревозку = ЗаданиеНаПеревозку Тогда
			текСтрокаАкта.Транспортировка	= Транспортировка;
			текСтрокаАкта.СтоимостьАренды	= СтоимостьАренды;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		тОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
	Исключение
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = НСтр("ru='Ошибка формирования документа: '") + тОбъект.Ссылка + " " + ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

