
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	ТабДанных   = Новый ТаблицаЗначений;
	ТекстОшибки = "";
	
	Если Константы.уатИспользоватьСКАУТ.Получить() Тогда 
		Если уатЗащищенныеФункцииСервер_проф.ПолучитьОписаниеТССКАУТЧерезВебСервис(ТабДанных, ТекстОшибки) Тогда 
			ТекстОшибки = "Неудалось получить данные от системы GPS ""СКАУТ""." + Символы.ПС + ТекстОшибки;
			ВызватьИсключение ТекстОшибки;
			
		Иначе 
			ВнешниеНаборыДанных = Новый Структура;
			ВнешниеНаборыДанных.Вставить("ТабДанныхСКАУТ", ТабДанных);
			СхемаКомпоновкиДанных = ЭтотОбъект.СхемаКомпоновкиДанных;
			Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
			
			КомпоновщикМакета         = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки           = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
			ПроцессорВывода           = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			ДокументРезультат.АвтоМасштаб = Истина;
		КонецЕсли;
		
	Иначе 
		ДокументРезультат = Новый ТабличныйДокумент;
		ТекстОшибки = "Использование системы GPS ""СКАУТ"" отключено.";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры
