#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область Команды

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Возврат; //В дальнейшем будет добавлен код команд
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон(НСтр("ru = 'Амортизация НМА %1 за %2'"), Данные.Номер, Формат(Данные.Дата, "ДФ='ММММ гггг'"));
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет расчет амортизации в заданном месяце и записывает его с помощью проведения документа "Амортизация НМА".
//  
// Параметры:
//  ПараметрыРасчета - Структура - Содержит параметры расчета (см. НовыеПараметрыРасчетаАмортизации()).
// 
// Возвращаемое значение:
//  ДокументСсылка.АмортизацияНМА2_4, Неопределено - Ссылка на созданный документ, если расчет успешно выполнен.
//
Процедура РассчитатьАмортизацию(ИсходныеПараметрыРасчета, АдресХранилища) Экспорт
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("ЗакрытиеМесяца.НачислениеАмортизацииНМА");
	
	ПараметрыРасчета = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ИсходныеПараметрыРасчета);
	ВнеоборотныеАктивыСлужебный.ДополнитьПараметрамиУчетаВнеоборотныхАктивов(ПараметрыРасчета);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ИсходныеПараметрыРасчета.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// Основной расчет амортизации выполняется с помощью запроса
	ТекстЗапроса = ТекстЗапросаДляРасчетаАмортизации(ПараметрыРасчета);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПакетыАмортизации", ПараметрыРасчета.ПакетыАмортизации);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ПараметрыРасчета.Период));
	Запрос.УстановитьПараметр("КонецМесяца",  КонецМесяца(ПараметрыРасчета.Период));
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ПараметрыРасчета.Период));
	Запрос.УстановитьПараметр("НачалоПредыдущегоМесяца", НачалоМесяца(НачалоМесяца(ПараметрыРасчета.Период)-1));
	Запрос.УстановитьПараметр("НачалоСледующегоМесяца", НачалоМесяца(КонецМесяца(ПараметрыРасчета.Период)+1));
	Запрос.УстановитьПараметр("КонецПредыдущегоМесяца", КонецМесяца(НачалоМесяца(ПараметрыРасчета.Период)-1));
	Запрос.УстановитьПараметр("КонецПредыдущегоМесяцаГраница", Новый Граница(КонецМесяца(НачалоМесяца(ПараметрыРасчета.Период)-1), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоПозапрошлогоМесяца", НачалоМесяца(ДобавитьМесяц(ПараметрыРасчета.Период, -2)));
	Запрос.УстановитьПараметр("КонецПозапрошлогоМесяца", КонецМесяца(ДобавитьМесяц(ПараметрыРасчета.Период, -2)));
	Запрос.УстановитьПараметр("ДатаПереходаКЛинейномуМетоду", ПараметрыРасчета.ДатаПереходаКЛинейномуМетоду);
	Запрос.УстановитьПараметр("ТипПринятиеКУчету", Тип("ДокументСсылка.ПринятиеКУчетуНМА2_4"));
	Запрос.УстановитьПараметр("ПорядокУчетаВНАВУпрУчете", ПараметрыРасчета.ПорядокУчетаВНАВУпрУчете);
	
	Если ПараметрыРасчета.ПорядокУчетаВНАВУпрУчете = Перечисления.ПорядокУчетаВНАВУпрУчете.ПоСтандартамМУ Тогда
		Запрос.УстановитьПараметр("ПериодПараметровУУ", НачалоМесяца(ПараметрыРасчета.Период));
	Иначе
		Запрос.УстановитьПараметр("ПериодПараметровУУ", КонецМесяца(ПараметрыРасчета.Период));
	КонецЕсли;
	
	КоличествоОбработанныхДанных = 0;
	
	Попытка
	
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		// Расчет доначисления амортизации за прошлый месяц
		АмортизацияИзменений = РассчитатьАмортизациюИзменений(РезультатЗапроса, ПараметрыРасчета);
		
		Запрос.Текст = ТекстЗапросаДляРасчетаАмортизацииСУчетомДоначисления(ПараметрыРасчета);
		Запрос.УстановитьПараметр("АмортизацияИзменений_УУ", АмортизацияИзменений);
		РезультатЗапроса = Запрос.Выполнить();
		
		АмортизацияИзменений = РассчитатьАмортизациюИзменений(РезультатЗапроса, ПараметрыРасчета);
		
		Запрос.Текст = ТекстЗапросаЗавершитьРасчетАмортизации(ПараметрыРасчета);
		Запрос.УстановитьПараметр("АмортизацияИзменений_УУ", АмортизацияИзменений);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		КоличествоОбработанныхДанных = Выборка.КоличествоДанных;
		
		// Таблицы для отладки:
		// ВТ_СписокОбъектовУчета
		// ВТ_СписокНМАСПараметрами_БУ
		// ВТ_СписокНМАСПараметрами_УУ
		// ВТ_СписокНМАСИзмененнымиПараметрами_УУ
		// ВТ_РасчетАмортизации_БУ
		// ВТ_РасчетАмортизации_УУ
		// ВТ_НачисленнаяАмортизация.
		
		ЗарегистрироватьОшибкиРасчетаАмортизации(ПараметрыРасчета, МенеджерВременныхТаблиц);
		
		Если ПараметрыРасчета.ВернутьПараметрыРасчета Тогда
			ВернутьПараметрыРасчета(ИсходныеПараметрыРасчета, МенеджерВременныхТаблиц);
		КонецЕсли;
		
		ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц,, "ВТ_НачисленнаяАмортизация,НомераПакетовСФилиалами");
		
		Если ПараметрыРасчета.ЗаписатьДанные Тогда
			ЗаписатьРасчетАмортизации(ПараметрыРасчета, МенеджерВременныхТаблиц);
		КонецЕсли;
		
	Исключение
		
		ПараметрыРасчета.ЕстьОшибки = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
			ПараметрыРасчета.ЭтапРасчета, 
			ПараметрыРасчета.Период, 
			ПараметрыРасчета.ПакетыАмортизации.ВыгрузитьКолонку("Организация"),
			ТекстОшибки);
	
	КонецПопытки; 
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, КоличествоОбработанныхДанных / 100);
	
	Если ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		ПоместитьВоВременноеХранилище(ПараметрыРасчета.ЕстьОшибки, АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры

Функция НомерПакетаПоУмолчанию(Организация) Экспорт

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат 0;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПакетыАмортизацииНМА.НомерПакета) КАК НомерПакета,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПакетыАмортизацииНМА.НомерПакета), 0) КАК КоличествоНомеров
	|ИЗ
	|	РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизацииНМА
	|ГДЕ
	|	ПакетыАмортизацииНМА.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ПакетыАмортизацииНМА.Организация";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НомерПакета = 0;
	Если Выборка.Следующий() Тогда
		Если Выборка.КоличествоНомеров = 1 Тогда
			НомерПакета = Выборка.НомерПакета;
		КонецЕсли; 
	КонецЕсли;

	Возврат НомерПакета;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	Возврат ИсточникиДанных;
	
КонецФункции

Функция АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра) Экспорт

	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	ПолноеИмяДокумента = "Документ.АмортизацияНМА2_4";
	
	ВЗапросеЕстьИсточник = Истина;
	
	ЗначенияПараметров = ЗначенияПараметровПроведения();
	ПереопределениеРасчетаПараметров = Новый Структура;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, ИмяРегистра);
		СинонимТаблицыДокумента = "ДанныеДокумента";
		ВЗапросеЕстьИсточник = Ложь;
		
	Иначе
		ТекстИсключения = НСтр("ru = 'В документе %ПолноеИмяДокумента% не реализована адаптация текста запроса формирования движений по регистру %ИмяРегистра%.'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ПолноеИмяДокумента%", ПолноеИмяДокумента);
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИмяРегистра%", ИмяРегистра);
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросПроведенияПоНезависимомуРегистру(
										ТекстЗапроса,
										ПолноеИмяДокумента,
										СинонимТаблицыДокумента,
										ВЗапросеЕстьИсточник,
										ПереопределениеРасчетаПараметров);
	Иначе	
		
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросМеханизмаПроведения(
										ТекстЗапроса,
										ПолноеИмяДокумента,
										СинонимТаблицыДокумента,
										ПереопределениеРасчетаПараметров);
	КонецЕсли; 

	Результат = ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса();
	Результат.ЗначенияПараметров = ЗначенияПараметров;
	Результат.ТекстЗапроса = ТекстЗапроса;
	
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаАмортизацияНМА(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСтоимостьНМА(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры);
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаПартииПрочихРасходов_Амортизация(Запрос, ТекстыЗапроса, Регистры);
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете_Амортизация(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка           КАК Ссылка,
	|	ДанныеДокумента.Дата             КАК Период,
	|	ДанныеДокумента.Номер            КАК Номер,
	|	ДанныеДокумента.Проведен         КАК Проведен,
	|	ДанныеДокумента.ПометкаУдаления  КАК ПометкаУдаления,
	|	ДанныеДокумента.Комментарий      КАК Комментарий,
	|	ДанныеДокумента.Ответственный    КАК Ответственный,
	|	ДанныеДокумента.Организация      КАК Организация,
	|	ДанныеДокумента.НомерПакета      КАК НомерПакета
	|ИЗ
	|	Документ.АмортизацияНМА2_4 КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	Для Каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	
	ЗначенияПараметровПроведения = ЗначенияПараметровПроведения(Реквизиты);
	Для каждого КлючИЗначение Из ЗначенияПараметровПроведения Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла; 
	
	УниверсальныеМеханизмыПартийИСебестоимости.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);
	
КонецПроцедуры

Функция ЗначенияПараметровПроведения(Реквизиты = Неопределено)

	ЗначенияПараметровПроведения = Новый Структура;
	ЗначенияПараметровПроведения.Вставить("ИдентификаторМетаданных", ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.АмортизацияНМА2_4"));
	ЗначенияПараметровПроведения.Вставить("ХозяйственнаяОперация",  Перечисления.ХозяйственныеОперации.АмортизацияНМА);
	ЗначенияПараметровПроведения.Вставить("НазваниеДокумента", НСтр("ru='Амортизация НМА'"));
	
	Если Реквизиты <> Неопределено Тогда
		ЗначенияПараметровПроведения.Вставить("НомерНаПечать", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	КонецЕсли; 
	
	Возврат ЗначенияПараметровПроведения;
	
КонецФункции

Функция ТекстЗапросаТаблицаАмортизацияНМА(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "АмортизацияНМА";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)          КАК ВидДвижения,
	|	&Ссылка                                         КАК Регистратор,
	|	НачисленнаяАмортизация.ХозяйственнаяОперация    КАК ХозяйственнаяОперация,
	|	НачисленнаяАмортизация.ПериодРасчета            КАК Период,
	|	НачисленнаяАмортизация.Организация              КАК Организация,
	|	НачисленнаяАмортизация.Подразделение            КАК Подразделение,
	|	НачисленнаяАмортизация.НематериальныйАктив      КАК НематериальныйАктив,
	|	НачисленнаяАмортизация.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета   КАК ГруппаФинансовогоУчета,
	|
	|	НачисленнаяАмортизация.СуммаУУ    КАК Амортизация,
	|	НачисленнаяАмортизация.СуммаБУ    КАК АмортизацияРегл,
	|	НачисленнаяАмортизация.СуммаНУ    КАК АмортизацияНУ,
	|	НачисленнаяАмортизация.СуммаПР    КАК АмортизацияПР,
	|	НачисленнаяАмортизация.СуммаВР    КАК АмортизацияВР,
	|	НачисленнаяАмортизация.СуммаЦФ    КАК АмортизацияЦФ,
	|	НачисленнаяАмортизация.СуммаНУЦФ  КАК АмортизацияНУЦФ,
	|	НачисленнаяАмортизация.СуммаПРЦФ  КАК АмортизацияПРЦФ,
	|	НачисленнаяАмортизация.СуммаВРЦФ  КАК АмортизацияВРЦФ,
	|
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов КАК КорОрганизация,
	|	НачисленнаяАмортизация.КорПодразделение              КАК КорПодразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.СтатьяРасходов                КАК КорСтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов             КАК КорАналитикаРасходов
	|ИЗ
	|	ВТ_НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|ГДЕ
	|	НачисленнаяАмортизация.Организация = &Организация
	|	И НачисленнаяАмортизация.НомерПакета = &НомерПакета
	|	И НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаСтоимостьНМА(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "СтоимостьНМА";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)          КАК ВидДвижения,
	|	&Ссылка                                         КАК Регистратор,
	|	НачисленнаяАмортизация.ХозяйственнаяОперация    КАК ХозяйственнаяОперация,
	|	НачисленнаяАмортизация.ПериодРасчета            КАК Период,
	|	НачисленнаяАмортизация.Организация              КАК Организация,
	|	НачисленнаяАмортизация.Подразделение            КАК Подразделение,
	|	НачисленнаяАмортизация.НематериальныйАктив      КАК НематериальныйАктив,
	|	НачисленнаяАмортизация.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета   КАК ГруппаФинансовогоУчета,
	|
	|	НачисленнаяАмортизация.СуммаУУ    КАК Стоимость,
	|	НачисленнаяАмортизация.СуммаБУ    КАК СтоимостьРегл,
	|	НачисленнаяАмортизация.СуммаНУ    КАК СтоимостьНУ,
	|	НачисленнаяАмортизация.СуммаПР    КАК СтоимостьПР,
	|	НачисленнаяАмортизация.СуммаВР    КАК СтоимостьВР,
	|	НачисленнаяАмортизация.СуммаЦФ    КАК СтоимостьЦФ,
	|	НачисленнаяАмортизация.СуммаНУЦФ  КАК СтоимостьНУЦФ,
	|	НачисленнаяАмортизация.СуммаПРЦФ  КАК СтоимостьПРЦФ,
	|	НачисленнаяАмортизация.СуммаВРЦФ  КАК СтоимостьВРЦФ,
	|
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов КАК КорОрганизация,
	|	НачисленнаяАмортизация.Подразделение                 КАК КорПодразделение,
	|	НачисленнаяАмортизация.НаправлениеДеятельности       КАК КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.СтатьяРасходов                КАК КорСтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов             КАК КорАналитикаРасходов
	|ИЗ
	|	ВТ_НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|ГДЕ
	|	НачисленнаяАмортизация.Организация = &Организация
	|	И НачисленнаяАмортизация.НомерПакета = &НомерПакета
	|	И НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПрочиеРасходы";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаПрочиеРасходы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РеестрДокументов";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Ссылка                                 КАК Ссылка,
	|	&Период                                 КАК ДатаДокументаИБ,
	|	&Номер                                  КАК НомерДокументаИБ,
	|	&ИдентификаторМетаданных                КАК ТипСсылки,
	|	&Организация                            КАК Организация,
	|	&ХозяйственнаяОперация                  КАК ХозяйственнаяОперация,
	|	&Ответственный                          КАК Ответственный,
	|	&Комментарий                            КАК Комментарий,
	|	&Проведен                               КАК Проведен,
	|	&ПометкаУдаления                        КАК ПометкаУдаления,
	|	ЛОЖЬ                                    КАК ДополнительнаяЗапись,
	|	&Период                                 КАК ДатаПервичногоДокумента,
	|	&НомерНаПечать                          КАК НомерПервичногоДокумента,
	|	&Период  КАК ДатаОтраженияВУчете";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтПрочиеРасходы(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтПрочиеРасходы";
	
	Если Не ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтИсходныеПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаВтПрочиеРасходы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтИсходныеПрочиеРасходы";
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстОписаниеВтИсходныеПрочиеРасходы();
	ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаОтражениеНачисленнойАмортизацииВПрочихРасходах();
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПроведениеПоРеглУчету

Функция ТекстОтраженияВРеглУчете() Экспорт
	
	СписокЗапросов = Новый Массив;

	#Область Амортизация_Дт_СчетУчетаЗатрат__Кт_СчетНакопленияАмортизации
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.КорПодразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСтатьяРасходов КАК СубконтоДт1,
	|	Строки.КорАналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизацияНУ КАК СуммаНУДт,
	|	Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО ОбъектыСтроительства.Ссылка = Строки.КорАналитикаРасходов
	|ГДЕ
	|	СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL
	|	И Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ИСТИНА
	|	И Строки.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Амортизация <> 0
	|		ИЛИ Строки.АмортизацияРегл <> 0
	|		ИЛИ Строки.АмортизацияНУ <> 0
	|		ИЛИ Строки.АмортизацияПР <> 0
	|		ИЛИ Строки.АмортизацияВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписаниеРасходовНаНИОКР_Дт_СчетУчетаЗатрат__Кт_СчетНакопленияАмортизации
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СтоимостьВНА)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.КорПодразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСтатьяРасходов КАК СубконтоДт1,
	|	Строки.КорАналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Списание расходов на НИОКР"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО ОбъектыСтроительства.Ссылка = Строки.КорАналитикаРасходов
	|ГДЕ
	|	СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL
	|	И Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ИСТИНА
	|	И Строки.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Стоимость <> 0
	|		ИЛИ Строки.СтоимостьРегл <> 0
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область Амортизация_ЦФ_Дт_СчетУчетаЗатрат__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСтатьяРасходов КАК СубконтоДт1,
	|	Строки.КорАналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизацияНУЦФ КАК СуммаНУДт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРДт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА_ЦФ) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУЦФ КАК СуммаНУКт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРКт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО ОбъектыСтроительства.Ссылка = Строки.КорАналитикаРасходов
	|ГДЕ
	|	СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL
	|	И Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ИСТИНА
	|	И Строки.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.АмортизацияЦФ <> 0
	|		ИЛИ Строки.АмортизацияНУЦФ <> 0
	|		ИЛИ Строки.АмортизацияПРЦФ <> 0
	|		ИЛИ Строки.АмортизацияВРЦФ <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписаниеРасходовНаНИОКР_ЦФ_Дт_СчетУчетаЗатрат__Кт_СчетНакопленияАмортизации_ЦФ
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации_ЦФ)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСтатьяРасходов КАК СубконтоДт1,
	|	Строки.КорАналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУЦФ КАК СуммаНУДт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРДт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА_ЦФ) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУЦФ КАК СуммаНУКт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРКт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО ОбъектыСтроительства.Ссылка = Строки.КорАналитикаРасходов
	|ГДЕ
	|	СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL
	|	И Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ИСТИНА
	|	И Строки.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.СтоимостьЦФ <> 0
	|		ИЛИ Строки.СтоимостьНУЦФ <> 0
	|		ИЛИ Строки.СтоимостьПРЦФ <> 0
	|		ИЛИ Строки.СтоимостьВРЦФ <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти

	#Область АмортизацияБезНУ_Дт_СчетУчетаЗатрат__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.КорПодразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСтатьяРасходов КАК СубконтоДт1,
	|	Строки.КорАналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	Строки.АмортизацияНУ + Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО ОбъектыСтроительства.Ссылка = Строки.КорАналитикаРасходов
	|ГДЕ
	|	СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL
	|	И Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ЛОЖЬ
	|	И Строки.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Амортизация <> 0
	|		ИЛИ Строки.АмортизацияРегл <> 0
	|		ИЛИ Строки.АмортизацияНУ <> 0
	|		ИЛИ Строки.АмортизацияПР <> 0
	|		ИЛИ Строки.АмортизацияВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область АмортизацияБезНУ_ЦФ_Дт_СчетУчетаЗатрат__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.КорПодразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСтатьяРасходов КАК СубконтоДт1,
	|	Строки.КорАналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	Строки.АмортизацияНУЦФ + Строки.АмортизацияПРЦФ КАК СуммаПРДт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУЦФ КАК СуммаНУКт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРКт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО ОбъектыСтроительства.Ссылка = Строки.КорАналитикаРасходов
	|ГДЕ
	|	СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL
	|	И Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ЛОЖЬ
	|	И Строки.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Амортизация <> 0
	|		ИЛИ Строки.АмортизацияЦФ <> 0
	|		ИЛИ Строки.АмортизацияНУЦФ <> 0
	|		ИЛИ Строки.АмортизацияПРЦФ <> 0
	|		ИЛИ Строки.АмортизацияВРЦФ <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область АмортизацияОтправитель_Дт_РасчетыПоТекущимОперациям__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт РасчетыПоТекущимОперациям :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоТекущимОперациям) КАК СчетДт,
	|	Строки.КорОрганизация КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизацияНУ КАК СуммаНУДт,
	|	Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ИСТИНА
	|	И Строки.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Амортизация <> 0
	|		ИЛИ Строки.АмортизацияРегл <> 0
	|		ИЛИ Строки.АмортизацияНУ <> 0
	|		ИЛИ Строки.АмортизацияПР <> 0
	|		ИЛИ Строки.АмортизацияВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписаниеРасходовНаНИОКРОтправитель_Дт_РасчетыПоТекущимОперациям__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт РасчетыПоТекущимОперациям :: Кт СтоимостьВНА)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоТекущимОперациям) КАК СчетДт,
	|	Строки.КорОрганизация КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Списание расходов на НИОКР"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ИСТИНА
	|	И Строки.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Стоимость <> 0
	|		ИЛИ Строки.СтоимостьРегл <> 0
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти

	#Область АмортизацияБезНУОтправитель_Дт_РасчетыПоТекущимОперациям__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоТекущимОперациям) КАК СчетДт,
	|	Строки.КорОрганизация КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	Строки.АмортизацияНУ + Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ЛОЖЬ
	|	И Строки.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Амортизация <> 0
	|		ИЛИ Строки.АмортизацияРегл <> 0
	|		ИЛИ Строки.АмортизацияНУ <> 0
	|		ИЛИ Строки.АмортизацияПР <> 0
	|		ИЛИ Строки.АмортизацияВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписаниеРасходовНаНИОКРБезНУОтправитель_Дт_РасчетыПоТекущимОперациям__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоТекущимОперациям) КАК СчетДт,
	|	Строки.КорОрганизация КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	Строки.СтоимостьНУ + Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Списание расходов на НИОКР"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ЛОЖЬ
	|	И Строки.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Стоимость <> 0
	|		ИЛИ Строки.СтоимостьРегл <> 0
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область АмортизацияПолучатель_Дт_СчетУчетаЗатрат__Кт_РасчетыПоТекущимОперациям
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт РасчетыПоТекущимОперациям)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.КорОрганизация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.КорПодразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСтатьяРасходов КАК СубконтоДт1,
	|	Строки.КорАналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизацияНУ КАК СуммаНУДт,
	|	Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоТекущимОперациям) КАК СчетКт,
	|	Строки.Организация КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО ОбъектыСтроительства.Ссылка = Строки.КорАналитикаРасходов
	|ГДЕ
	|	Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ИСТИНА
	|	И Строки.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL
	|	И (Строки.Амортизация <> 0
	|		ИЛИ Строки.АмортизацияРегл <> 0
	|		ИЛИ Строки.АмортизацияНУ <> 0
	|		ИЛИ Строки.АмортизацияПР <> 0
	|		ИЛИ Строки.АмортизацияВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписаниеРасходовНаНИОКРПолучатель_Дт_СчетУчетаЗатрат__Кт_РасчетыПоТекущимОперациям
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт РасчетыПоТекущимОперациям)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.КорОрганизация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.КорПодразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСтатьяРасходов КАК СубконтоДт1,
	|	Строки.КорАналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоТекущимОперациям) КАК СчетКт,
	|	Строки.Организация КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Списание расходов на НИОКР"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО ОбъектыСтроительства.Ссылка = Строки.КорАналитикаРасходов
	|ГДЕ
	|	Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ИСТИНА
	|	И Строки.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL
	|	И (Строки.Стоимость <> 0
	|		ИЛИ Строки.СтоимостьРегл <> 0
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область АмортизацияБезНУПолучатель_Дт_СчетУчетаЗатрат__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.КорОрганизация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.КорПодразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСтатьяРасходов КАК СубконтоДт1,
	|	Строки.КорАналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	Строки.АмортизацияНУ + Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоТекущимОперациям) КАК СчетКт,
	|	Строки.Организация КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	Строки.АмортизацияНУ + Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО ОбъектыСтроительства.Ссылка = Строки.КорАналитикаРасходов
	|ГДЕ
	|	СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL
	|	И Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ЛОЖЬ
	|	И Строки.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Амортизация <> 0
	|		ИЛИ Строки.АмортизацияРегл <> 0
	|		ИЛИ Строки.АмортизацияНУ <> 0
	|		ИЛИ Строки.АмортизацияПР <> 0
	|		ИЛИ Строки.АмортизацияВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписаниеРасходовНаНИОКРБезНУПолучатель_Дт_СчетУчетаЗатрат__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.КорОрганизация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.КорПодразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСтатьяРасходов КАК СубконтоДт1,
	|	Строки.КорАналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	Строки.СтоимостьНУ + Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоТекущимОперациям) КАК СчетКт,
	|	Строки.Организация КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	Строки.СтоимостьНУ + Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Списание расходов на НИОКР"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО ОбъектыСтроительства.Ссылка = Строки.КорАналитикаРасходов
	|ГДЕ
	|	СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL
	|	И Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ЛОЖЬ
	|	И Строки.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Стоимость <> 0
	|		ИЛИ Строки.СтоимостьРегл <> 0
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область АмортизацияНаПрочиеОперации_Дт_СчетУчетаЗатрат__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.КорПодразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизацияНУ КАК СуммаНУДт,
	|	Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|ГДЕ
	|	Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ИСТИНА
	|	И Строки.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Амортизация <> 0
	|		ИЛИ Строки.АмортизацияЦФ <> 0
	|		ИЛИ Строки.АмортизацияНУЦФ <> 0
	|		ИЛИ Строки.АмортизацияПРЦФ <> 0
	|		ИЛИ Строки.АмортизацияВРЦФ <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область АмортизацияБезНУНаПрочиеОперации_Дт_СчетУчетаЗатрат__Кт_СчетНакопленияАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.КорПодразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	Строки.АмортизацияНУ + Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО Строки.КорСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|ГДЕ
	|	Строки.КорСтатьяРасходов.ПринятиеКНалоговомуУчету = ЛОЖЬ
	|	И Строки.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (Строки.Амортизация <> 0
	|		ИЛИ Строки.АмортизацияЦФ <> 0
	|		ИЛИ Строки.АмортизацияНУЦФ <> 0
	|		ИЛИ Строки.АмортизацияПРЦФ <> 0
	|		ИЛИ Строки.АмортизацияВРЦФ <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область ДоходыОтЦелевогоФинансирования_НМА_Дт_98__Кт_91
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Признание доходов от целевого финансирования (Дт 98 :: Кт 91)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыБудущихПериодовОтЦелевогоФинансированияНМА) КАК СчетДт,
	|	Строки.НематериальныйАктив КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизацияНУЦФ + Строки.АмортизацияПРЦФ + Строки.АмортизацияВРЦФ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ПараметрыЦелевогоФинансированияНМА.СтатьяДоходов КАК АналитикаУчетаКт,
	|	Строки.КорПодразделение КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ПараметрыЦелевогоФинансированияНМА.СтатьяДоходов КАК СубконтоКт1,
	|	ПараметрыЦелевогоФинансированияНМА.АналитикаДоходов КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУЦФ + Строки.АмортизацияПРЦФ + Строки.АмортизацияВРЦФ КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Признание доходов от целевого финансирования"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПараметрыЦелевогоФинансированияНМА КАК ПараметрыЦелевогоФинансированияНМА
	|	ПО Строки.Регистратор = ПараметрыЦелевогоФинансированияНМА.Ссылка
	|		И Строки.НематериальныйАктив = ПараметрыЦелевогоФинансированияНМА.НематериальныйАктив
	|		И Строки.Организация = ПараметрыЦелевогоФинансированияНМА.Организация
	|ГДЕ
	|	(Строки.АмортизацияЦФ <> 0
	|		ИЛИ Строки.АмортизацияНУЦФ <> 0
	|		ИЛИ Строки.АмортизацияПРЦФ <> 0
	|		ИЛИ Строки.АмортизацияВРЦФ <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область ДоходыОтЦелевогоФинансирования_НИОКР_Дт_98__Кт_91
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Признание доходов от целевого финансирования (Дт 98 :: Кт 91)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыБудущихПериодовОтЦелевогоФинансированияНМА) КАК СчетДт,
	|	Строки.НематериальныйАктив КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУЦФ + Строки.СтоимостьПРЦФ + Строки.СтоимостьВРЦФ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ПараметрыЦелевогоФинансированияНМА.СтатьяДоходов КАК АналитикаУчетаКт,
	|	Строки.КорПодразделение КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ПараметрыЦелевогоФинансированияНМА.СтатьяДоходов КАК СубконтоКт1,
	|	ПараметрыЦелевогоФинансированияНМА.АналитикаДоходов КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУЦФ + Строки.СтоимостьПРЦФ + Строки.СтоимостьВРЦФ КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Признание доходов от целевого финансирования"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПараметрыЦелевогоФинансированияНМА КАК ПараметрыЦелевогоФинансированияНМА
	|	ПО Строки.Регистратор = ПараметрыЦелевогоФинансированияНМА.Ссылка
	|		И Строки.НематериальныйАктив = ПараметрыЦелевогоФинансированияНМА.НематериальныйАктив
	|		И Строки.Организация = ПараметрыЦелевогоФинансированияНМА.Организация
	|ГДЕ
	|	(Строки.СтоимостьЦФ <> 0
	|		ИЛИ Строки.СтоимостьНУЦФ <> 0
	|		ИЛИ Строки.СтоимостьПРЦФ <> 0
	|		ИЛИ Строки.СтоимостьВРЦФ <> 0)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	Возврат СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());

КонецФункции

Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт

	СписокЗапросов = Новый Массив;
	
	#Область втПараметрыЦелевогоФинансированияНМА
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДокументыКОтражению.Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	Строки.НематериальныйАктив КАК НематериальныйАктив
	|ПОМЕСТИТЬ втСписокНМА
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|		ПО (Строки.Регистратор = ДокументыКОтражению.Ссылка)
	|ГДЕ
	|	(Строки.АмортизацияЦФ <> 0
	|			ИЛИ Строки.АмортизацияНУЦФ <> 0
	|			ИЛИ Строки.АмортизацияПРЦФ <> 0
	|			ИЛИ Строки.АмортизацияВРЦФ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыКОтражению.Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	Строки.НематериальныйАктив КАК НематериальныйАктив
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|		ПО (Строки.Регистратор = ДокументыКОтражению.Ссылка)
	|ГДЕ
	|	(Строки.СтоимостьЦФ <> 0
	|			ИЛИ Строки.СтоимостьНУЦФ <> 0
	|			ИЛИ Строки.СтоимостьПРЦФ <> 0
	|			ИЛИ Строки.СтоимостьВРЦФ <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыЦелевогоФинансированияНМА.Ссылка КАК Ссылка,
	|	ПараметрыЦелевогоФинансированияНМА.Организация КАК Организация,
	|	ПараметрыЦелевогоФинансированияНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ПараметрыЦелевогоФинансированияНМАПоследнее.СтатьяДоходов,
	|	ПараметрыЦелевогоФинансированияНМАПоследнее.АналитикаДоходов
	|ПОМЕСТИТЬ втПараметрыЦелевогоФинансированияНМА
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.Ссылка КАК Ссылка,
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		МАКСИМУМ(ПараметрыЦелевогоФинансированияНМА.Период) КАК ПоследнийПериод
	|	ИЗ
	|		втСписокНМА КАК СписокНМА
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияНМА КАК ПараметрыЦелевогоФинансированияНМА
	|			ПО СписокНМА.НематериальныйАктив = ПараметрыЦелевогоФинансированияНМА.НематериальныйАктив
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокНМА.Ссылка,
	|		СписокНМА.Организация,
	|		СписокНМА.НематериальныйАктив) КАК ПараметрыЦелевогоФинансированияНМА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияНМА КАК ПараметрыЦелевогоФинансированияНМАПоследнее
	|		ПО ПараметрыЦелевогоФинансированияНМА.НематериальныйАктив = ПараметрыЦелевогоФинансированияНМАПоследнее.НематериальныйАктив
	|			И ПараметрыЦелевогоФинансированияНМА.ПоследнийПериод = ПараметрыЦелевогоФинансированияНМАПоследнее.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Организация,
	|	НематериальныйАктив";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	СписокЗапросов.Добавить(Символы.ПС);
	
	Возврат СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());

КонецФункции
 
#КонецОбласти

#Область РасчетАмортизации

Процедура ЗаписатьРасчетАмортизации(ПараметрыРасчета, МенеджерВременныхТаблиц)

	НачатьТранзакцию();
	
	Попытка
	
		// Нужно заблокировать документы, чтобы не создать дублей
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("Документ.АмортизацияНМА2_4");
		ЭлементБлокировки.УстановитьЗначение("Дата", Новый Диапазон(НачалоМесяца(ПараметрыРасчета.Период),КонецМесяца(ПараметрыРасчета.Период)));
		ЭлементБлокировки.ИсточникДанных = ПараметрыРасчета.ПакетыАмортизации;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НомерПакета", "НомерПакета");
		
		Блокировка.Заблокировать(); 
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НомераПакетовСФилиалами.Организация,
		|	НомераПакетовСФилиалами.НомерПакета,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЕСТЬNULL(РегламентныйДокумент.Проведен, ЛОЖЬ) = ИСТИНА
		|				ТОГДА РегламентныйДокумент.Ссылка
		|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.АмортизацияНМА2_4.ПустаяСсылка)
		|		КОНЕЦ) КАК СсылкаПроведен,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЕСТЬNULL(РегламентныйДокумент.Проведен, НЕОПРЕДЕЛЕНО) = ЛОЖЬ
		|				ТОГДА РегламентныйДокумент.Ссылка
		|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.АмортизацияНМА2_4.ПустаяСсылка)
		|		КОНЕЦ) КАК СсылкаНеПроведен,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЕСТЬNULL(РегламентныйДокумент.ПометкаУдаления, ЛОЖЬ) = ИСТИНА
		|				ТОГДА РегламентныйДокумент.Ссылка
		|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.АмортизацияНМА2_4.ПустаяСсылка)
		|		КОНЕЦ) КАК СсылкаУдален
		|ИЗ
		|	НомераПакетовСФилиалами КАК НомераПакетовСФилиалами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АмортизацияНМА2_4 КАК РегламентныйДокумент
		|		ПО (РегламентныйДокумент.Организация = НомераПакетовСФилиалами.Организация)
		|			И (РегламентныйДокумент.НомерПакета = НомераПакетовСФилиалами.НомерПакета)
		|			И (РегламентныйДокумент.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца)
		|ГДЕ
		|	НомераПакетовСФилиалами.Организация В(&СписокОрганизаций)
		|
		|СГРУППИРОВАТЬ ПО
		|	НомераПакетовСФилиалами.Организация,
		|	НомераПакетовСФилиалами.НомерПакета";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ПараметрыРасчета.Период));
		Запрос.УстановитьПараметр("КонецМесяца",  КонецМесяца(ПараметрыРасчета.Период));
		Запрос.УстановитьПараметр("СписокОрганизаций", ПараметрыРасчета.СписокОрганизаций);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.НомерПакета = ПараметрыРасчета.НомерПакета Тогда
				
				// Расчет выполняется из формы документа.
				Если ЗначениеЗаполнено(ПараметрыРасчета.Ссылка) Тогда
					ДокументОбъект = ПараметрыРасчета.Ссылка.ПолучитьОбъект();
				Иначе 
					ДокументОбъект = ВнеоборотныеАктивыСлужебный.ПолучитьРегламентныйДокумент(
						Выборка.СсылкаПроведен, Неопределено, Неопределено, Документы.АмортизацияНМА2_4);
				КонецЕсли;
				
				ДокументОбъект.НомерПакета   = Выборка.НомерПакета;
				ДокументОбъект.Организация   = Выборка.Организация;
				ДокументОбъект.Комментарий   = ПараметрыРасчета.Комментарий;
				ДокументОбъект.Ответственный = ПараметрыРасчета.Ответственный;
				
			Иначе	
				
				ДокументОбъект = ВнеоборотныеАктивыСлужебный.ПолучитьРегламентныйДокумент(
					Выборка.СсылкаПроведен, Выборка.СсылкаНеПроведен, Выборка.СсылкаУдален, Документы.АмортизацияНМА2_4);
					
				ДокументОбъект.НомерПакета   = Выборка.НомерПакета;
				ДокументОбъект.Организация   = Выборка.Организация;
				ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
				
			КонецЕсли; 
				
			ДокументОбъект.Дата = КонецМесяца(ПараметрыРасчета.Период);
			
			ДокументОбъект.ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			ВнеоборотныеАктивыСлужебный.УничтожитьВременныеТаблицыПослеЗаписиРасчетаАмортизации(МенеджерВременныхТаблиц);
			
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки; 
	
КонецПроцедуры

Функция РассчитатьАмортизациюИзменений(РезультатЗапроса, ПараметрыРасчета)

	АмортизацияИзменений = РезультатЗапроса.Выгрузить();
	АмортизацияИзменений.Сортировать("НематериальныйАктив,Период");
	
	ТекущееНМА = Неопределено;
	НачисленнаяАмортизация = 0;
	РесурсВыработанныйЗаПрошлыйПериод = 0;
	РесурсНазначенный = 0;
	Для каждого ДанныеСтроки Из АмортизацияИзменений Цикл
		
		ЕстьОшибки = Ложь;
		
		ТекстСообщения = НСтр("ru = 'Для объекта учета ""%1"" (код %2) не определена остаточная стоимость. Необходимо проверить первичные документы.'");
		ПроверитьПараметрРасчета(ДанныеСтроки.ОстаточнаяСтоимость, ТекстСообщения, ДанныеСтроки, ПараметрыРасчета, ЕстьОшибки);
		
		ТекстСообщения = НСтр("ru = 'Для объекта учета ""%1"" (код %2) не определен срок использования. Необходимо проверить первичные документы.'");
		ПроверитьПараметрРасчета(ДанныеСтроки.РесурсНазначенный, ТекстСообщения, ДанныеСтроки, ПараметрыРасчета, ЕстьОшибки);
		
		ТекстСообщения = НСтр("ru = 'Для объекта учета ""%1"" (код %2) не определено количество прошедших месяцев.
                               |Необходимо проверить первичные документы.'");
		ПроверитьПараметрРасчета(ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод, ТекстСообщения, ДанныеСтроки, ПараметрыРасчета, ЕстьОшибки);
		
		ТекстСообщения = НСтр("ru = 'Для объекта учета ""%1"" (код %2) не определена ликвидационная стоимость. Необходимо проверить первичные документы.'");
		ПроверитьПараметрРасчета(ДанныеСтроки.ЛиквидационнаяСтоимость, ТекстСообщения, ДанныеСтроки, ПараметрыРасчета, ЕстьОшибки);
		
		ТекстСообщения = НСтр("ru = 'Для объекта учета ""%1"" (код %2) не определен метод начисления амортизации. Необходимо проверить первичные документы.'");
		ПроверитьПараметрРасчета(ДанныеСтроки.МетодНачисленияАмортизации, ТекстСообщения, ДанныеСтроки, ПараметрыРасчета, ЕстьОшибки);
		
		Если ЕстьОшибки Тогда
			Продолжить;
		КонецЕсли;
		
		Если РесурсНазначенный <> ДанныеСтроки.РесурсНазначенный Тогда
			РесурсВыработанныйЗаПрошлыйПериод = 0;
			РесурсНазначенный = ДанныеСтроки.РесурсНазначенный;
		КонецЕсли;
		
		Если ДанныеСтроки.НематериальныйАктив <> ТекущееНМА Тогда
			НачисленнаяАмортизация = 0;
			РесурсВыработанныйЗаПрошлыйПериод = 0;
			ТекущееНМА = ДанныеСтроки.НематериальныйАктив;
		КонецЕсли; 
		
		Если ДанныеСтроки.ЭтоИзменения Тогда

			ДанныеСтроки.ОстаточнаяСтоимость = Макс(ДанныеСтроки.ОстаточнаяСтоимость - НачисленнаяАмортизация, 0);
			ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод = ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод + РесурсВыработанныйЗаПрошлыйПериод;
			
			Если НЕ ДанныеСтроки.НачислятьАмортизацию 
				ИЛИ (ДанныеСтроки.ОстаточнаяСтоимость - ДанныеСтроки.ЛиквидационнаяСтоимость) <= 0 Тогда
				
				ДанныеСтроки.СуммаУУ = 0;
				
			ИначеЕсли (ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод + ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод) >= ДанныеСтроки.РесурсНазначенный Тогда
				
				ДанныеСтроки.СуммаУУ = ДанныеСтроки.ОстаточнаяСтоимость;
				
			ИначеЕсли ДанныеСтроки.МетодНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.Линейный
				ИЛИ ДанныеСтроки.МетодНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции
				ИЛИ ДанныеСтроки.МетодНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка
					И (ДанныеСтроки.РесурсНазначенный
						- ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод
						- ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод) <= 12 Тогда
				
				ДанныеСтроки.СуммаУУ = (ДанныеСтроки.ОстаточнаяСтоимость)
										* (ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод)
										/ (ДанныеСтроки.РесурсНазначенный - ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод);
				
			ИначеЕсли ДанныеСтроки.МетодНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка Тогда
				
				ДанныеСтроки.СуммаУУ = (ДанныеСтроки.ОстаточнаяСтоимость)
										* ДанныеСтроки.КоэффициентУскорения
										* ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод
										/ (ДанныеСтроки.РесурсНазначенный - ДанныеСтроки.КоэффициентУскорения 
												*(ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод - ДанныеСтроки.ОтработанныхМесяцевПолныхЛет));
			КонецЕсли; 
			
			ДанныеСтроки.СуммаУУ = Окр(ДанныеСтроки.СуммаУУ, 2);
			
		КонецЕсли;
		
		Если (ДанныеСтроки.ОстаточнаяСтоимость - ДанныеСтроки.СуммаУУ) < ДанныеСтроки.ЛиквидационнаяСтоимость Тогда
			ДанныеСтроки.СуммаУУ = Макс(ДанныеСтроки.ОстаточнаяСтоимость - ДанныеСтроки.ЛиквидационнаяСтоимость, 0);
		КонецЕсли; 
		
		НачисленнаяАмортизация = НачисленнаяАмортизация + ДанныеСтроки.СуммаУУ;
		РесурсВыработанныйЗаПрошлыйПериод = РесурсВыработанныйЗаПрошлыйПериод + ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод;
		
	КонецЦикла; 
	
	Возврат АмортизацияИзменений;

КонецФункции

Процедура ВернутьПараметрыРасчета(ИсходныеПараметрыРасчета, МенеджерВременныхТаблиц)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца                                                      КАК Дата,
	|	ПараметрыАмортизации.Организация                                  КАК Организация,
	|	ПараметрыАмортизации.НематериальныйАктив                          КАК ВнеоборотныйАктив,
	
	// БУ
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюБУ 
	|			ТОГДА ПараметрыАмортизации.МетодНачисленияАмортизацииБУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК МетодНачисленияБУ,
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюБУ 
	|			ТОГДА ПараметрыАмортизации.СрокПолезногоИспользованияБУ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СрокИспользованияБУ,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизации.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка) 
	|			ТОГДА ПараметрыАмортизации.СтоимостьРегл
	|		ИНАЧЕ ПараметрыАмортизации.ПервоначальнаяСтоимостьБУ                    
	|	КОНЕЦ                                                             КАК СтоимостьБУ,
	|	ПараметрыАмортизации.ОбъемВыработки                               КАК ВыработкаЗаМесяцБУ,
	|	ПараметрыАмортизации.ОбъемНаработки                               КАК ОбъемПродукцииБУ,
	|	ПараметрыАмортизации.КоэффициентБУ                                КАК КоэффициентАмортизацииБУ,
	|	ПараметрыАмортизации.СрокПолезногоИспользованияБУ
	|		- ПараметрыАмортизации.ФактическийСрокИспользования           КАК ОставшийсяСрокИспользования,
	|	ПараметрыАмортизации.ФактическийСрокИспользования                 КАК ФактическийСрокИспользования,
	
	// НУ
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.МетодНачисленияАмортизацииНУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК МетодНачисленияНУ,
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.СрокПолезногоИспользованияНУ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СрокИспользованияНУ,
	|	ВЫБОР
	|		КОГДА НЕ ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА 0
	|		КОГДА ПараметрыАмортизации.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный) 
	|			ТОГДА ПараметрыАмортизации.СтоимостьНУНачальныйОстаток - ПараметрыАмортизации.АмортизацияНУНачальныйОстаток
	|		ИНАЧЕ ПараметрыАмортизации.СтоимостьДляВычисленияАмортизацииНУ - ПараметрыАмортизации.АмортизацияПриПереходеКЛинейномуМетоду                    
	|	КОНЕЦ                                                             КАК СтоимостьНУ,
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.СпециальныйКоэффициентНУ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентНУ,
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.НормаАмортизации
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НормаАмортизацииНУ
	|ИЗ
	|	ВТ_СписокНМАСПараметрами_БУ КАК ПараметрыАмортизации
	|ГДЕ
	|	ПараметрыАмортизации.НачислятьАмортизациюБУ
	|		ИЛИ ПараметрыАмортизации.НачислятьАмортизациюНУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&КонецМесяца                                                      КАК Дата,
	|	ПараметрыАмортизации.Организация                                  КАК Организация,
	|	ПараметрыАмортизации.НематериальныйАктив                          КАК ВнеоборотныйАктив,
	
	// УУ
	|	ПараметрыАмортизации.МетодНачисленияАмортизации                   КАК МетодНачисленияУУ,
	|	ПараметрыАмортизации.ОстаточнаяСтоимость                          КАК СтоимостьУУ,
	|	ПараметрыАмортизации.ЛиквидационнаяСтоимость                      КАК ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизации.РесурсНазначенный                            КАК СрокИспользованияУУ,
	|	ПараметрыАмортизации.РесурсВыработанныйЗаТекущийПериод            КАК РесурсВыработанныйЗаТекущийПериод,
	|	ПараметрыАмортизации.РесурсВыработанныйЗаПрошлыйПериод            КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	ПараметрыАмортизации.ОтработанныхМесяцевПолныхЛет                 КАК ОтработанныхМесяцевПолныхЛет,
	|	ПараметрыАмортизации.КоэффициентУскорения                         КАК КоэффициентУскоренияУУ
	|ИЗ
	|	ВТ_СписокНМАСПараметрами_УУ КАК ПараметрыАмортизации
	|ГДЕ
	|	ПараметрыАмортизации.НачислятьАмортизациюУУ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ИсходныеПараметрыРасчета.Период));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПараметрыАмортизации_Регл = Результат[0].Выгрузить();
	ПараметрыАмортизации_Упр = Результат[1].Выгрузить();

	СписокПараметровАмортизации = ПолучитьИзВременногоХранилища(ИсходныеПараметрыРасчета.АдресПараметровРасчета);
	
	Если СписокПараметровАмортизации = Неопределено Тогда
		СписокПараметровАмортизации = Новый Структура;
		СписокПараметровАмортизации.Вставить("ПараметрыАмортизации_Регл", ПараметрыАмортизации_Регл);
		СписокПараметровАмортизации.Вставить("ПараметрыАмортизации_Упр", ПараметрыАмортизации_Упр);
	Иначе
		ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(СписокПараметровАмортизации.ПараметрыАмортизации_Регл, ПараметрыАмортизации_Регл);
		ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(СписокПараметровАмортизации.ПараметрыАмортизации_Упр, ПараметрыАмортизации_Упр);
	КонецЕсли; 
	
	ПоместитьВоВременноеХранилище(СписокПараметровАмортизации, ИсходныеПараметрыРасчета.АдресПараметровРасчета);
	
КонецПроцедуры

Процедура ПроверитьПараметрРасчета(ПараметрРасчета, ШаблонСообщения, Выборка, ПараметрыРасчета, ЕстьОшибки)

	Если ПараметрРасчета <> NULL Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Истина;
	
	ТекстОшибки = СтрШаблон(ШаблонСообщения, Выборка.НематериальныйАктив, Выборка.НематериальныйАктивКод);
	
	ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
		ПараметрыРасчета.ЭтапРасчета, 
		ПараметрыРасчета.Период,
		Выборка.Организация,
		ТекстОшибки,,
		Выборка.НематериальныйАктив,
		ПараметрыРасчета.ЕстьОшибки);
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибкиРасчетаАмортизации(ПараметрыРасчета, МенеджерВременныхТаблиц) Экспорт

	Если ПараметрыРасчета.ИспользоватьРеглУчет Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПроверкаПараметровРасчета.Организация КАК Организация,
		|	ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
		|	ВЫРАЗИТЬ(ПроверкаПараметровРасчета.ОбъектУчета КАК Справочник.НематериальныеАктивы).Наименование КАК ОбъектУчетаПредставление,
		|	ВЫРАЗИТЬ(ПроверкаПараметровРасчета.ОбъектУчета КАК Справочник.НематериальныеАктивы).Код КАК Код,
		|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанаАмортизационнаяГруппа) КАК НеУказанаАмортизационнаяГруппа,
		|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанОбъемНаработки) КАК НеУказанОбъемНаработки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПроверкаПараметровРасчета.Организация КАК Организация,
		|		ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
		|		ЛОЖЬ КАК НеУказанаАмортизационнаяГруппа,
		|		ПроверкаПараметровРасчета.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки
		|	ИЗ
		|		ВТ_ПроверкаПараметровРасчета_УУ КАК ПроверкаПараметровРасчета
		|	ГДЕ
		|		ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПроверкаПараметровРасчета.Организация,
		|		ПроверкаПараметровРасчета.ОбъектУчета,
		|		ПроверкаПараметровРасчета.НеУказанаАмортизационнаяГруппа,
		|		ПроверкаПараметровРасчета.НеУказанОбъемНаработки
		|	ИЗ
		|		ВТ_ПроверкаПараметровРасчета_БУ КАК ПроверкаПараметровРасчета
		|	ГДЕ
		|		ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)) КАК ПроверкаПараметровРасчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроверкаПараметровРасчета.ОбъектУчета,
		|	ПроверкаПараметровРасчета.Организация";
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПроверкаПараметровРасчета.Организация КАК Организация,
		|	ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
		|	ВЫРАЗИТЬ(ПроверкаПараметровРасчета.ОбъектУчета КАК Справочник.НематериальныеАктивы).Наименование КАК ОбъектУчетаПредставление,
		|	ВЫРАЗИТЬ(ПроверкаПараметровРасчета.ОбъектУчета КАК Справочник.НематериальныеАктивы).Код КАК Код,
		|	ЛОЖЬ НеУказанаАмортизационнаяГруппа,
		|	ПроверкаПараметровРасчета.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки
		|ИЗ
		|	ВТ_ПроверкаПараметровРасчета_УУ КАК ПроверкаПараметровРасчета
		|ГДЕ
		|	ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)
		|УПОРЯДОЧИТЬ ПО
		|	ПроверкаПараметровРасчета.ОбъектУчета";
		
	КонецЕсли; 
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокОрганизаций", ПараметрыРасчета.СписокОрганизаций);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ШаблонАмортизационнаяГруппа  = НСтр("ru = 'Для объекта учета ""%1"" (код %2) не указана амортизационная группа.'");
	ШаблонОбъемНаработки         = НСтр("ru = 'Для объекта учета ""%1"" (код %2) не указан предполагаемый объем наработки (продукции, работ).'");
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НеУказанаАмортизационнаяГруппа Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонАмортизационнаяГруппа, Выборка.ОбъектУчетаПредставление, Выборка.Код);
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
		
		Если Выборка.НеУказанОбъемНаработки Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонОбъемНаработки, Выборка.ОбъектУчетаПредставление, Выборка.Код);
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
	
	КонецЦикла;
	
КонецПроцедуры

#Область ТекстыЗапросовДляРасчетаАмортизации

Функция ТекстЗапросаДляРасчетаАмортизации(ПараметрыРасчета)

	СписокЗапросов = Новый Массив;
	
	// Тексты запросов, в которых подготавливаются параметры для расчета
	ТекстЗапросаПакетыАмортизации(СписокЗапросов);
	ТекстЗапросаСписокВсехНМА(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаСписокОбъектовУчета(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаПараметрыРасчетаАмортизации(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаПроверкаПараметровРасчета(СписокЗапросов, ПараметрыРасчета);
	
	// Тексты запроса, в которых вычисляется амортизация
	ТекстЗапросаРасчетАмортизации_БУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаРасчетАмортизации_УУ_Предварительный_Доначисление(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаВыборкаРасчетаАмортизацииИзменений_Доначисление(СписокЗапросов, ПараметрыРасчета);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаДляРасчетаАмортизацииСУчетомДоначисления(ПараметрыРасчета)

	СписокЗапросов = Новый Массив;
	
	// Тексты запроса, в которых вычисляется амортизация
	ТекстЗапросаРасчетАмортизации_УУ_Доначисление(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаРасчетАмортизации_УУ_ДоначислениеСгруппированная(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаРасчетАмортизации_УУ_Предварительный(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаВыборкаРасчетаАмортизацииИзменений(СписокЗапросов, ПараметрыРасчета);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаЗавершитьРасчетАмортизации(ПараметрыРасчета)

	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаРасчетАмортизации_УУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаНачисленнаяАмортизация(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаКоличествоОбработанныхДанных(СписокЗапросов, ПараметрыРасчета);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ТекстЗапросаПакетыАмортизации(СписокЗапросов)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПакетыАмортизации.Организация КАК Организация,
	|	ПакетыАмортизации.НомерПакета КАК НомерПакета
	|ПОМЕСТИТЬ НомераПакетов
	|ИЗ
	|	&ПакетыАмортизации КАК ПакетыАмортизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераПакетов.Организация КАК Организация,
	|	НомераПакетов.НомерПакета КАК НомерПакета
	|ПОМЕСТИТЬ НомераПакетовСФилиалами
	|ИЗ
	|	НомераПакетов КАК НомераПакетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Филиалы.Ссылка,
	|	НомераПакетов.НомерПакета
	|ИЗ
	|	НомераПакетов КАК НомераПакетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Филиалы
	|		ПО (Филиалы.ГоловнаяОрганизация = НомераПакетов.Организация)
	|			И (НЕ Филиалы.ПометкаУдаления)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НомерПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПакетыАмортизации.Организация КАК Организация,
	|	ПакетыАмортизации.НематериальныйАктив КАК ОбъектУчета
	|ПОМЕСТИТЬ ПакетыАмортизации
	|ИЗ
	|	НомераПакетовСФилиалами КАК НомераПакетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизации
	|		ПО (ПакетыАмортизации.Организация = НомераПакетов.Организация)
	|			И (ПакетыАмортизации.НомерПакета = НомераПакетов.НомерПакета)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета,
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаСписокОбъектовУчета(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНМА.НачалоМесяца                        КАК НачалоМесяца,
	|	СписокНМА.КонецМесяца                         КАК КонецМесяца,
	|	СписокНМА.Организация                         КАК Организация,
	|	СписокНМА.НематериальныйАктив                 КАК НематериальныйАктив,
	|	СписокНМА.СпособОтраженияРасходовУУ           КАК СпособОтраженияРасходов,
	|	ЕСТЬNULL(ПакетыАмортизацииНМА.НомерПакета, 0) КАК НомерПакета
	|ПОМЕСТИТЬ ВТ_СписокОбъектовУчета
	|ИЗ
	|	ВТ_СписокОбъектовУчета_УУ КАК СписокНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизацииНМА
	|		ПО ПакетыАмортизацииНМА.Организация = СписокНМА.Организация
	|			И ПакетыАмортизацииНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив";
	
	Если ПараметрыРасчета.ИспользоватьРеглУчет Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&НачалоМесяца                                 КАК НачалоМесяца,
		|	&КонецМесяца                                  КАК КонецМесяца,
		|	СписокНМА.Организация                         КАК Организация,
		|	СписокНМА.НематериальныйАктив                 КАК НематериальныйАктив,
		|	СписокНМА.СпособОтраженияРасходовБУ           КАК СпособОтраженияРасходов,
		|	ЕСТЬNULL(ПакетыАмортизацииНМА.НомерПакета, 0) КАК НомерПакета
		|ИЗ
		|	ВТ_СписокОбъектовУчета_БУ КАК СписокНМА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизацииНМА
		|		ПО ПакетыАмортизацииНМА.Организация = СписокНМА.Организация
		|			И ПакетыАмортизацииНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры
 
// Формирует тексты запросов, которые создают таблицы объектов учета, по которым требуется расчет амортизации.
//
// Параметры:
//  СписокЗапросов	 - Массив	 - Список запросов, в который нужно добавить текст запроса.
//  ПараметрыРасчета - Структура - Содержит параметры расчета амортизации.
//  ПрефиксТаблицы	 - Строка	 - Используется для добавления префикса к созданным таблицам.
//
Процедура ТекстЗапросаСписокВсехНМА(СписокЗапросов, ПараметрыРасчета, ПрефиксТаблицы = "") Экспорт
	
	#Область ВТ_СписокОбъектовУчета_БУ
	
	Если ПараметрыРасчета.ИспользоватьРеглУчет Тогда
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&НачалоМесяца                       КАК НачалоМесяца,
		|	ПорядокУчетаНМА.Организация         КАК Организация,
		|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
		|	ПорядокУчетаНМА.НематериальныйАктив.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
		|
		|	ПорядокУчетаНМА.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
		|	ПорядокУчетаНМА.НачислятьАмортизациюНУ КАК НачислятьАмортизациюНУ,
		|
		|	ПорядокУчетаНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходовБУ,
		|
		|	ПорядокУчетаНМА.СтатьяРасходов    КАК СтатьяРасходовБУ,
		|	ПорядокУчетаНМА.АналитикаРасходов КАК АналитикаРасходовБУ,
		|
		|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизациюБУ,
		|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходовБУ
		|ПОМЕСТИТЬ ВТ_СписокОбъектовУчета_БУ
		|ИЗ
		|	РегистрСведений.ПорядокУчетаНМАБУ.СрезПоследних(
		|			&КонецПредыдущегоМесяца,
		|			(Организация, НематериальныйАктив) В
		|				(ВЫБРАТЬ
		|					ПакетыАмортизации.Организация,
		|					ПакетыАмортизации.ОбъектУчета
		|				ИЗ
		|					ПакетыАмортизации КАК ПакетыАмортизации)) КАК ПорядокУчетаНМА
		|ГДЕ
		|	(ПорядокУчетаНМА.НачислятьАмортизациюБУ
		|			ИЛИ ПорядокУчетаНМА.НачислятьАмортизациюНУ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НематериальныйАктив,
		|	Организация";
		
		Если ЗначениеЗаполнено(ПрефиксТаблицы) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТ_СписокОбъектовУчета_БУ", "ВТ_СписокОбъектовУчета_БУ" + ПрефиксТаблицы);
		КонецЕсли; 
		
		СписокЗапросов.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ВТ_СписокОбъектовУчета_Доначисление_УУ
	Если ПараметрыРасчета.ПорядокУчетаВНАВУпрУчете = Перечисления.ПорядокУчетаВНАВУпрУчете.ПоСтандартамМУ Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СтоимостьНМА.Организация         КАК Организация,
		|	СтоимостьНМА.НематериальныйАктив КАК НематериальныйАктив
		|ПОМЕСТИТЬ ВТ_СписокОбъектовУчета_Доначисление_УУ
		|ИЗ
		|	РегистрНакопления.СтоимостьНМА КАК СтоимостьНМА
		|ГДЕ
		|	СтоимостьНМА.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
		|	И СтоимостьНМА.Активность
		|	И СтоимостьНМА.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И СтоимостьНМА.ХозяйственнаяОперация В (
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуНМА))
		|	И (СтоимостьНМА.Организация, СтоимостьНМА.НематериальныйАктив) В
		|				(ВЫБРАТЬ
		|					ПакетыАмортизации.Организация,
		|					ПакетыАмортизации.ОбъектУчета
		|				ИЗ
		|					ПакетыАмортизации КАК ПакетыАмортизации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьНМА.Организация,
		|	СтоимостьНМА.НематериальныйАктив
		|
		|ИМЕЮЩИЕ
		|	СУММА(СтоимостьНМА.Стоимость - СтоимостьНМА.ПредварительнаяСтоимость) > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НематериальныйАктив,
		|	Организация";
		
		Если ЗначениеЗаполнено(ПрефиксТаблицы) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТ_СписокОбъектовУчета_Доначисление_УУ", "ВТ_СписокОбъектовУчета_Доначисление_УУ" + ПрефиксТаблицы);
		КонецЕсли; 
		
		СписокЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;	
	#КонецОбласти
	
	#Область ВТ_СписокОбъектовУчета_УУ
	
	Если ПараметрыРасчета.ПорядокУчетаВНАВУпрУчете = Перечисления.ПорядокУчетаВНАВУпрУчете.ПоСтандартамМУ Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&КонецМесяца                        КАК ПериодНачисления,
		|	&НачалоМесяца                       КАК НачалоМесяца,
		|	&КонецМесяца                        КАК КонецМесяца,
		|	ЛОЖЬ                                КАК ЭтоДоначисление,
		|	ПорядокУчетаНМА.Организация         КАК Организация,
		|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
		|
		|	ПорядокУчетаНМА.НачислятьАмортизациюУУ КАК НачислятьАмортизациюУУ,
		|
		|	ПорядокУчетаНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходовУУ,
		|
		|	ПорядокУчетаНМА.СтатьяРасходов    КАК СтатьяРасходовУУ,
		|	ПорядокУчетаНМА.АналитикаРасходов КАК АналитикаРасходовУУ,
		|
		|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизациюУУ,
		|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходовУУ
		|
		|ПОМЕСТИТЬ ВТ_СписокОбъектовУчета_УУ
		|ИЗ
		|	РегистрСведений.ПорядокУчетаНМАУУ.СрезПоследних(
		|			&КонецПредыдущегоМесяца,
		|			(Организация, НематериальныйАктив) В
		|				(ВЫБРАТЬ
		|					ПакетыАмортизации.Организация,
		|					ПакетыАмортизации.ОбъектУчета
		|				ИЗ
		|					ПакетыАмортизации КАК ПакетыАмортизации)) КАК ПорядокУчетаНМА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&КонецМесяца                        КАК ПериодНачисления,
		|	&НачалоПредыдущегоМесяца            КАК НачалоМесяца,
		|	&КонецПредыдущегоМесяца             КАК КонецМесяца,
		|	ИСТИНА                              КАК ЭтоДоначисление,
		|	ПорядокУчетаНМА.Организация         КАК Организация,
		|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
		|
		|	ПорядокУчетаНМА.НачислятьАмортизациюУУ КАК НачислятьАмортизациюУУ,
		|
		|	ПорядокУчетаНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходовУУ,
		|
		|	ПорядокУчетаНМА.СтатьяРасходов    КАК СтатьяРасходовУУ,
		|	ПорядокУчетаНМА.АналитикаРасходов КАК АналитикаРасходовУУ,
		|
		|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизациюУУ,
		|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходовУУ
		|ИЗ
		|	РегистрСведений.ПорядокУчетаНМАУУ.СрезПоследних(
		|			&КонецПозапрошлогоМесяца,
		|			(Организация, НематериальныйАктив) В
		|				(ВЫБРАТЬ
		|					СписокНМА.Организация,
		|					СписокНМА.НематериальныйАктив
		|				ИЗ
		|					ВТ_СписокОбъектовУчета_Доначисление_УУ КАК СписокНМА)) КАК ПорядокУчетаНМА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&КонецМесяца                        КАК ПериодНачисления,
		|	&НачалоМесяца                       КАК НачалоМесяца,
		|	&КонецМесяца                        КАК КонецМесяца,
		|	ЛОЖЬ                                КАК ЭтоДоначисление,
		|	ПорядокУчетаНМА.Организация         КАК Организация,
		|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
		|
		|	ПорядокУчетаНМА.НачислятьАмортизациюУУ КАК НачислятьАмортизациюУУ,
		|
		|	ПорядокУчетаНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходовУУ,
		|
		|	ПорядокУчетаНМА.СтатьяРасходов    КАК СтатьяРасходовУУ,
		|	ПорядокУчетаНМА.АналитикаРасходов КАК АналитикаРасходовУУ,
		|
		|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизациюУУ,
		|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходовУУ
		|ИЗ
		|	РегистрСведений.ПорядокУчетаНМАУУ КАК ПорядокУчетаНМА
		|ГДЕ
		|	ПорядокУчетаНМА.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И ПорядокУчетаНМА.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
		|	И (ПорядокУчетаНМА.Организация, ПорядокУчетаНМА.НематериальныйАктив) В
		|				(ВЫБРАТЬ
		|					ПакетыАмортизации.Организация,
		|					ПакетыАмортизации.ОбъектУчета
		|				ИЗ
		|					ПакетыАмортизации КАК ПакетыАмортизации)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&КонецМесяца                        КАК ПериодНачисления,
		|	&НачалоПредыдущегоМесяца            КАК НачалоМесяца,
		|	&КонецПредыдущегоМесяца             КАК КонецМесяца,
		|	ИСТИНА                              КАК ЭтоДоначисление,
		|	ПорядокУчетаНМА.Организация         КАК Организация,
		|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
		|
		|	ПорядокУчетаНМА.НачислятьАмортизациюУУ КАК НачислятьАмортизациюУУ,
		|
		|	ПорядокУчетаНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходовУУ,
		|
		|	ПорядокУчетаНМА.СтатьяРасходов    КАК СтатьяРасходовУУ,
		|	ПорядокУчетаНМА.АналитикаРасходов КАК АналитикаРасходовУУ,
		|
		|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизациюУУ,
		|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходовУУ
		|ИЗ
		|	РегистрСведений.ПорядокУчетаНМАУУ КАК ПорядокУчетаНМА
		|ГДЕ
		|	ПорядокУчетаНМА.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
		|	И ПорядокУчетаНМА.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
		|	И (Организация, НематериальныйАктив) В
		|				(ВЫБРАТЬ
		|					СписокНМА.Организация,
		|					СписокНМА.НематериальныйАктив
		|				ИЗ
		|					ВТ_СписокОбъектовУчета_Доначисление_УУ КАК СписокНМА)";
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&КонецМесяца                        КАК ПериодНачисления,
		|	&НачалоМесяца                       КАК НачалоМесяца,
		|	&КонецМесяца                        КАК КонецМесяца,
		|	ЛОЖЬ                                КАК ЭтоДоначисление,
		|	ПорядокУчетаНМА.Организация         КАК Организация,
		|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
		|
		|	ПорядокУчетаНМА.НачислятьАмортизациюУУ КАК НачислятьАмортизациюУУ,
		|
		|	ПорядокУчетаНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходовУУ,
		|
		|	ПорядокУчетаНМА.СтатьяРасходов    КАК СтатьяРасходовУУ,
		|	ПорядокУчетаНМА.АналитикаРасходов КАК АналитикаРасходовУУ,
		|
		|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизациюУУ,
		|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходовУУ
		|	
		|ПОМЕСТИТЬ ВТ_СписокОбъектовУчета_УУ
		|ИЗ
		|	РегистрСведений.ПорядокУчетаНМАУУ.СрезПоследних(
		|			&КонецПредыдущегоМесяца,
		|			(Организация, НематериальныйАктив) В
		|				(ВЫБРАТЬ
		|					ПакетыАмортизации.Организация,
		|					ПакетыАмортизации.ОбъектУчета
		|				ИЗ
		|					ПакетыАмортизации КАК ПакетыАмортизации)) КАК ПорядокУчетаНМА";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив, 
	|	Организация";
	
	Если ЗначениеЗаполнено(ПрефиксТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТ_СписокОбъектовУчета_УУ", "ВТ_СписокОбъектовУчета_УУ" + ПрефиксТаблицы);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТ_СписокОбъектовУчета_Доначисление_УУ", "ВТ_СписокОбъектовУчета_Доначисление_УУ" + ПрефиксТаблицы);
	КонецЕсли; 
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ТекстЗапросаПараметрыРасчетаАмортизации(СписокЗапросов, ПараметрыРасчета)

	ОбъектУчета = "НематериальныйАктив";
	ДобавитьТекстДляДоначисления = ПараметрыРасчета.ПорядокУчетаВНАВУпрУчете = Перечисления.ПорядокУчетаВНАВУпрУчете.ПоСтандартамМУ;
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"МестоУчетаНМА", "", ДобавитьТекстДляДоначисления, ОбъектУчета, СписокЗапросов);
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"ПервоначальныеСведенияНМА", "", ДобавитьТекстДляДоначисления, ОбъектУчета, СписокЗапросов);
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"ПорядокУчетаНМА", "", ДобавитьТекстДляДоначисления, ОбъектУчета, СписокЗапросов);
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"ПараметрыАмортизацииНМАУУ", "", ДобавитьТекстДляДоначисления, ОбъектУчета, СписокЗапросов);
	
	Если ПараметрыРасчета.ИспользоватьРеглУчет Тогда
		
		ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
			"ПараметрыАмортизацииНМАБУ", "", Ложь, ОбъектУчета, СписокЗапросов);
		
		ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
			"НачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет", "СпециальныйКоэффициентНУ", Ложь, ОбъектУчета, СписокЗапросов);
		
	КонецЕсли;
	
	#Область СтоимостьНМАНаНачалоМесяца
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&НачалоМесяца                             КАК НачалоМесяца,
	|	СтоимостьНМА.НематериальныйАктив          КАК НематериальныйАктив,
	|	СтоимостьНМА.СтоимостьОстаток             КАК Стоимость,
	|	СтоимостьНМА.СтоимостьРеглОстаток         КАК СтоимостьРегл,
	|	СтоимостьНМА.СтоимостьНУОстаток           КАК СтоимостьНУ,
	|	СтоимостьНМА.СтоимостьПРОстаток           КАК СтоимостьПР,
	|	СтоимостьНМА.СтоимостьВРОстаток           КАК СтоимостьВР,
	|	СтоимостьНМА.СтоимостьЦФОстаток           КАК СтоимостьЦФ,
	|	СтоимостьНМА.СтоимостьНУЦФОстаток         КАК СтоимостьНУЦФ,
	|	СтоимостьНМА.СтоимостьПРЦФОстаток         КАК СтоимостьПРЦФ,
	|	СтоимостьНМА.СтоимостьВРЦФОстаток         КАК СтоимостьВРЦФ
	|ПОМЕСТИТЬ ВТ_СтоимостьНМА_НаНачалоМесяца
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА.Остатки(
	|			&КонецПредыдущегоМесяцаГраница,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					СписокНМА.Организация,
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					ВТ_СписокОбъектовУчета КАК СписокНМА)) КАК СтоимостьНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтоимостьНМА.НематериальныйАктив";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СтоимостьНаНачалоГода
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.Организация,
	|	СписокНМА.НематериальныйАктив
	|ПОМЕСТИТЬ втСписокНМАУменьшаемогоОстатка
	|ИЗ
	|	ВТ_ПервоначальныеСведенияНМА КАК СписокНМА
	|ГДЕ
	|	СписокНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НематериальныйАктив";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	Если ПараметрыРасчета.ДатаНачалаУчета <= НачалоГода(ПараметрыРасчета.Период) Тогда
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&НачалоМесяца                             КАК НачалоМесяца,
		|	СтоимостьНМА.НематериальныйАктив          КАК НематериальныйАктив,
		|	СтоимостьНМА.СтоимостьРеглОстаток         КАК СтоимостьРегл
		|ПОМЕСТИТЬ ВТ_СтоимостьНМА_НаНачалоГода
		|ИЗ
		|	РегистрНакопления.СтоимостьНМА.Остатки(
		|			&НачалоГода,
		|			НематериальныйАктив В
		|				(ВЫБРАТЬ СписокНМА.НематериальныйАктив ИЗ втСписокНМАУменьшаемогоОстатка КАК СписокНМА)) КАК СтоимостьНМА
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтоимостьНМА.НематериальныйАктив";
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СчетаУчета.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ СчетаНачалоГода
		|ИЗ
		|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
		|			&НачалоГода,
		|			НематериальныйАктив В
		|					(ВЫБРАТЬ
		|						СписокНМА.НематериальныйАктив
		|					ИЗ
		|						втСписокНМАУменьшаемогоОстатка КАК СписокНМА)) КАК СчетаУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПараметрыЦелевогоФинансированияНМА.СчетУчета КАК СчетУчета
		|ИЗ
		|	РегистрСведений.ПараметрыЦелевогоФинансированияНМА.СрезПоследних(
		|			&НачалоГода,
		|			НематериальныйАктив В
		|				(ВЫБРАТЬ
		|					СписокНМА.НематериальныйАктив
		|				ИЗ
		|					втСписокНМАУменьшаемогоОстатка КАК СписокНМА)) КАК ПараметрыЦелевогоФинансированияНМА
		|ГДЕ
		|	ПараметрыЦелевогоФинансированияНМА.ПрименениеЦелевогоФинансирования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НачалоМесяца                            КАК НачалоМесяца,
		|	СтоимостьОС.Субконто1                    КАК НематериальныйАктив,
		|	СтоимостьОС.СуммаОстатокДт               КАК СтоимостьРегл
		|ПОМЕСТИТЬ ВТ_СтоимостьНМА_НаНачалоГода
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&НачалоГода,
		|			Счет В
		|				(ВЫБРАТЬ
		|					СчетаНачалоГода.СчетУчета
		|				ИЗ
		|					СчетаНачалоГода КАК СчетаНачалоГода),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы),
		|			Субконто1 В
		|					(ВЫБРАТЬ
		|						СписокНМА.НематериальныйАктив
		|					ИЗ
		|						втСписокНМАУменьшаемогоОстатка КАК СписокНМА)) КАК СтоимостьОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НематериальныйАктив";
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	#КонецОбласти

	#Область ПредварительнаяСтоимостьНМА
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&НачалоМесяца                                 КАК НачалоМесяца,
	|	СтоимостьНМА.НематериальныйАктив              КАК НематериальныйАктив,
	|	СУММА(СтоимостьНМА.ПредварительнаяСтоимость)  КАК Стоимость
	|ПОМЕСТИТЬ ВТ_ПредварительнаяСтоимостьНМА
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА КАК СтоимостьНМА
	|ГДЕ
	|	СтоимостьНМА.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И СтоимостьНМА.ПредварительнаяСтоимость <> 0
	|	И СтоимостьНМА.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуНМА))
	|	И СтоимостьНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				ВТ_СписокОбъектовУчета КАК СписокНМА)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьНМА.НематериальныйАктив";
	
	Если ПараметрыРасчета.ПорядокУчетаВНАВУпрУчете = Перечисления.ПорядокУчетаВНАВУпрУчете.ПоСтандартамМУ Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&НачалоПредыдущегоМесяца              КАК НачалоМесяца,
		|	СтоимостьНМА.НематериальныйАктив      КАК НематериальныйАктив,
		|	СУММА(СтоимостьНМА.Стоимость 
		|		   - СтоимостьНМА.ПредварительнаяСтоимость)  КАК Стоимость
		|ИЗ
		|	РегистрНакопления.СтоимостьНМА КАК СтоимостьНМА
		|ГДЕ
		|	СтоимостьНМА.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
		|	И СтоимостьНМА.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуНМА))
		|	И СтоимостьНМА.НематериальныйАктив В
		|			(ВЫБРАТЬ
		|				СписокНМА.НематериальныйАктив
		|			ИЗ
		|				ВТ_СписокОбъектовУчета_Доначисление_УУ КАК СписокНМА)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьНМА.НематериальныйАктив
		|
		|ИМЕЮЩИЕ СУММА(СтоимостьНМА.Стоимость - СтоимостьНМА.ПредварительнаяСтоимость) > 0";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтоимостьНМА.НематериальныйАктив";
		
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область АмортизацияНМАНаНачалоМесяца
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&НачалоМесяца                           КАК НачалоМесяца,
	|	АмортизацияНМА.Организация              КАК Организация,
	|	АмортизацияНМА.НематериальныйАктив      КАК НематериальныйАктив,
	|	-АмортизацияНМА.АмортизацияОстаток      КАК Амортизация,
	|	-АмортизацияНМА.АмортизацияРеглОстаток  КАК АмортизацияРегл,
	|	-АмортизацияНМА.АмортизацияНУОстаток    КАК АмортизацияНУ,
	|	-АмортизацияНМА.АмортизацияПРОстаток    КАК АмортизацияПР,
	|	-АмортизацияНМА.АмортизацияВРОстаток    КАК АмортизацияВР,
	|	-АмортизацияНМА.АмортизацияЦФОстаток    КАК АмортизацияЦФ,
	|	-АмортизацияНМА.АмортизацияНУЦФОстаток  КАК АмортизацияНУЦФ,
	|	-АмортизацияНМА.АмортизацияПРЦФОстаток  КАК АмортизацияПРЦФ,
	|	-АмортизацияНМА.АмортизацияВРЦФОстаток  КАК АмортизацияВРЦФ
	|ПОМЕСТИТЬ ВТ_АмортизацияНМА_НаНачалоМесяца
	|ИЗ
	|	РегистрНакопления.АмортизацияНМА.Остатки(
	|			&КонецПредыдущегоМесяцаГраница,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					СписокНМА.Организация,
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					ВТ_СписокОбъектовУчета КАК СписокНМА)) КАК АмортизацияНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АмортизацияНМА.НематериальныйАктив,
	|	АмортизацияНМА.Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область АмортизацияНМАПриПереходеКЛинейномуМетоду
	
	Если ПараметрыРасчета.ИспользоватьРеглУчет Тогда
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	АмортизацияНМА.Организация           КАК Организация,
		|	АмортизацияНМА.НематериальныйАктив   КАК НематериальныйАктив,
		|	АмортизацияНМА.АмортизацияНУОстаток  КАК АмортизацияНУ
		|ПОМЕСТИТЬ ВТ_АмортизацияНМАПриПереходеКЛинейномуМетоду
		|ИЗ
		|	РегистрНакопления.АмортизацияНМА.Остатки(
		|			&ДатаПереходаКЛинейномуМетоду,
		|			(Организация, НематериальныйАктив) В
		|				(ВЫБРАТЬ
		|					СписокНМА.Организация,
		|					СписокНМА.НематериальныйАктив
		|				ИЗ
		|					ВТ_СписокОбъектовУчета_БУ КАК СписокНМА)) КАК АмортизацияНМА
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НематериальныйАктив,
		|	Организация";
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	#КонецОбласти
			
	#Область ВыработкаНМА
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ) = МЕСЯЦ(&НачалоМесяца) - 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПринятоКУчетуВПрошломМесяце
	|ПОМЕСТИТЬ ВТ_СписокНМА_Выработка
	|ИЗ
	|	ВТ_СписокОбъектовУчета КАК СписокНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
	|		ПО (ПервоначальныеСведенияНМА.Организация = СписокНМА.Организация)
	|			И (ПервоначальныеСведенияНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокУчетаНМА КАК ПорядокУчетаНМА
	|		ПО (ПорядокУчетаНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизацииНМАУУ КАК ПараметрыАмортизацииНМАУУ
	|		ПО (ПараметрыАмортизацииНМАУУ.Организация = СписокНМА.Организация)
	|			И (ПараметрыАмортизацииНМАУУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАУУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|ГДЕ
	|	ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|		ИЛИ ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции) 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыработкаНМА.НематериальныйАктив  КАК НематериальныйАктив,
	|	ВыработкаНМА.КоличествоОборот     КАК ОбъемВыработки
	|ПОМЕСТИТЬ ВТ_ВыработкаНМА
	|ИЗ
	|	РегистрНакопления.ВыработкаНМА.Обороты(
	|			&НачалоМесяца,
	|			&КонецМесяца,,
	|			НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					ВТ_СписокНМА_Выработка КАК СписокНМА)) КАК ВыработкаНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив";
	
	Если НЕ ОбщегоНазначенияКлиентСервер.РежимОтладки() Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СписокНМА_Выработка";
	КонецЕсли;
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область Изменения_УУ
	
	Если ПараметрыРасчета.ПорядокУчетаВНАВУпрУчете = Перечисления.ПорядокУчетаВНАВУпрУчете.ПоСтандартамМУ Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&НачалоМесяца КАК НачалоМесяца,
		|	НАЧАЛОПЕРИОДА(ПараметрыАмортизацииНМАУУ.Период, ДЕНЬ) КАК Период,
		|	ПараметрыАмортизацииНМАУУ.НематериальныйАктив,
		|	ПараметрыАмортизацииНМАУУ.Организация,
		|	ПараметрыАмортизацииНМАУУ.СрокИспользования КАК СрокИспользования,
		|	ПараметрыАмортизацииНМАУУ.КоэффициентУскорения КАК КоэффициентУскорения,
		|	ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации,
		|	ПараметрыАмортизацииНМАУУ.ЛиквидационнаяСтоимость
		|ПОМЕСТИТЬ ПараметрыАмортизацииНМАУУИзменения
		|ИЗ
		|	РегистрСведений.ПараметрыАмортизацииНМАУУ КАК ПараметрыАмортизацииНМАУУ
		|ГДЕ
		|	ПараметрыАмортизацииНМАУУ.Активность
		|	И ПараметрыАмортизацииНМАУУ.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И НЕ ПараметрыАмортизацииНМАУУ.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
		|	И НЕ ПараметрыАмортизацииНМАУУ.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
		|	И ПараметрыАмортизацииНМАУУ.НематериальныйАктив В
		|			(ВЫБРАТЬ
		|				СписокНМА.ОбъектУчета
		|			ИЗ
		|				ПакетыАмортизации КАК СписокНМА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
		|	НАЧАЛОПЕРИОДА(ПараметрыАмортизацииНМАУУ.Период, ДЕНЬ) КАК Период,
		|	ПараметрыАмортизацииНМАУУ.НематериальныйАктив,
		|	ПараметрыАмортизацииНМАУУ.Организация,
		|	ПараметрыАмортизацииНМАУУ.СрокИспользования КАК СрокИспользования,
		|	ПараметрыАмортизацииНМАУУ.КоэффициентУскорения КАК КоэффициентУскорения,
		|	ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации,
		|	ПараметрыАмортизацииНМАУУ.ЛиквидационнаяСтоимость
		|ИЗ
		|	РегистрСведений.ПараметрыАмортизацииНМАУУ КАК ПараметрыАмортизацииНМАУУ
		|ГДЕ
		|	ПараметрыАмортизацииНМАУУ.Активность
		|	И ПараметрыАмортизацииНМАУУ.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
		|	И НЕ ПараметрыАмортизацииНМАУУ.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
		|	И НЕ ПараметрыАмортизацииНМАУУ.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
		|	И ПараметрыАмортизацииНМАУУ.НематериальныйАктив В
		|			(ВЫБРАТЬ
		|				СписокНМА.НематериальныйАктив
		|			ИЗ
		|				ВТ_СписокОбъектовУчета_Доначисление_УУ КАК СписокНМА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&НачалоМесяца КАК НачалоМесяца,
		|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМА.Период, ДЕНЬ) КАК Период,
		|	ПорядокУчетаНМА.НематериальныйАктив,
		|	ПорядокУчетаНМА.Организация,
		|	ПорядокУчетаНМА.ГруппаФинансовогоУчета,
		|	ПорядокУчетаНМА.НаправлениеДеятельности,
		|	ПорядокУчетаНМА.ОбъемНаработки
		|ПОМЕСТИТЬ ПорядокУчетаНМАИзменения
		|ИЗ
		|	РегистрСведений.ПорядокУчетаНМА КАК ПорядокУчетаНМА
		|ГДЕ
		|	ПорядокУчетаНМА.Активность
		|	И ПорядокУчетаНМА.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И НЕ ПорядокУчетаНМА.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
		|	И НЕ ПорядокУчетаНМА.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
		|	И ПорядокУчетаНМА.НематериальныйАктив В
		|			(ВЫБРАТЬ
		|				СписокНМА.ОбъектУчета
		|			ИЗ
		|				ПакетыАмортизации КАК СписокНМА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
		|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМА.Период, ДЕНЬ) КАК Период,
		|	ПорядокУчетаНМА.НематериальныйАктив,
		|	ПорядокУчетаНМА.Организация,
		|	ПорядокУчетаНМА.ГруппаФинансовогоУчета,
		|	ПорядокУчетаНМА.НаправлениеДеятельности,
		|	ПорядокУчетаНМА.ОбъемНаработки
		|ИЗ
		|	РегистрСведений.ПорядокУчетаНМА КАК ПорядокУчетаНМА
		|ГДЕ
		|	ПорядокУчетаНМА.Активность
		|	И ПорядокУчетаНМА.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
		|	И НЕ ПорядокУчетаНМА.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
		|	И НЕ ПорядокУчетаНМА.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
		|	И ПорядокУчетаНМА.НематериальныйАктив В
		|			(ВЫБРАТЬ
		|				СписокНМА.НематериальныйАктив
		|			ИЗ
		|				ВТ_СписокОбъектовУчета_Доначисление_УУ КАК СписокНМА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&НачалоМесяца КАК НачалоМесяца,
		|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМАУУ.Период, ДЕНЬ) КАК Период,
		|	ПорядокУчетаНМАУУ.НематериальныйАктив,
		|	ПорядокУчетаНМАУУ.Организация,
		|	ПорядокУчетаНМАУУ.Состояние,
		|	ПорядокУчетаНМАУУ.НачислятьАмортизациюУУ,
		|	ПорядокУчетаНМАУУ.СпособОтраженияРасходов,
		|	ПорядокУчетаНМАУУ.СтатьяРасходов,
		|	ПорядокУчетаНМАУУ.АналитикаРасходов,
		|	ПорядокУчетаНМАУУ.ПередаватьРасходыВДругуюОрганизацию,
		|	ПорядокУчетаНМАУУ.ОрганизацияПолучательРасходов
		|ПОМЕСТИТЬ ПорядокУчетаНМАУУИзменения
		|ИЗ
		|	РегистрСведений.ПорядокУчетаНМАУУ КАК ПорядокУчетаНМАУУ
		|ГДЕ
		|	ПорядокУчетаНМАУУ.Активность
		|	И ПорядокУчетаНМАУУ.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И НЕ ПорядокУчетаНМАУУ.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
		|	И НЕ ПорядокУчетаНМАУУ.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
		|	И НЕ ПорядокУчетаНМАУУ.Регистратор ССЫЛКА Документ.АмортизацияНМА2_4
		|	И (ПорядокУчетаНМАУУ.Организация, ПорядокУчетаНМАУУ.НематериальныйАктив) В
		|			(ВЫБРАТЬ
		|				СписокНМА.Организация,
		|				СписокНМА.ОбъектУчета
		|			ИЗ
		|				ПакетыАмортизации КАК СписокНМА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
		|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМАУУ.Период, ДЕНЬ) КАК Период,
		|	ПорядокУчетаНМАУУ.НематериальныйАктив,
		|	ПорядокУчетаНМАУУ.Организация,
		|	ПорядокУчетаНМАУУ.Состояние,
		|	ПорядокУчетаНМАУУ.НачислятьАмортизациюУУ,
		|	ПорядокУчетаНМАУУ.СпособОтраженияРасходов,
		|	ПорядокУчетаНМАУУ.СтатьяРасходов,
		|	ПорядокУчетаНМАУУ.АналитикаРасходов,
		|	ПорядокУчетаНМАУУ.ПередаватьРасходыВДругуюОрганизацию,
		|	ПорядокУчетаНМАУУ.ОрганизацияПолучательРасходов
		|ИЗ
		|	РегистрСведений.ПорядокУчетаНМАУУ КАК ПорядокУчетаНМАУУ
		|ГДЕ
		|	ПорядокУчетаНМАУУ.Активность
		|	И ПорядокУчетаНМАУУ.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
		|	И НЕ ПорядокУчетаНМАУУ.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
		|	И НЕ ПорядокУчетаНМАУУ.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
		|	И НЕ ПорядокУчетаНМАУУ.Регистратор ССЫЛКА Документ.АмортизацияНМА2_4
		|	И (ПорядокУчетаНМАУУ.Организация, ПорядокУчетаНМАУУ.НематериальныйАктив) В
		|			(ВЫБРАТЬ
		|				СписокНМА.Организация,
		|				СписокНМА.НематериальныйАктив
		|			ИЗ
		|				ВТ_СписокОбъектовУчета_Доначисление_УУ КАК СписокНМА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&НачалоМесяца КАК НачалоМесяца,
		|	НАЧАЛОПЕРИОДА(МестоУчетаНМА.Период, ДЕНЬ) КАК Период,
		|	МестоУчетаНМА.НематериальныйАктив,
		|	МестоУчетаНМА.Организация,
		|	МестоУчетаНМА.Подразделение
		|ПОМЕСТИТЬ МестоУчетаНМАИзменения
		|ИЗ
		|	РегистрСведений.МестоУчетаНМА КАК МестоУчетаНМА
		|ГДЕ
		|	МестоУчетаНМА.Активность
		|	И МестоУчетаНМА.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И НЕ МестоУчетаНМА.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
		|	И НЕ МестоУчетаНМА.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
		|	И МестоУчетаНМА.НематериальныйАктив В
		|			(ВЫБРАТЬ
		|				СписокНМА.ОбъектУчета
		|			ИЗ
		|				ПакетыАмортизации КАК СписокНМА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
		|	НАЧАЛОПЕРИОДА(МестоУчетаНМА.Период, ДЕНЬ) КАК Период,
		|	МестоУчетаНМА.НематериальныйАктив,
		|	МестоУчетаНМА.Организация,
		|	МестоУчетаНМА.Подразделение
		|ИЗ
		|	РегистрСведений.МестоУчетаНМА КАК МестоУчетаНМА
		|ГДЕ
		|	МестоУчетаНМА.Активность
		|	И МестоУчетаНМА.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
		|	И НЕ МестоУчетаНМА.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
		|	И НЕ МестоУчетаНМА.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
		|	И МестоУчетаНМА.НематериальныйАктив В
		|			(ВЫБРАТЬ
		|				СписокНМА.НематериальныйАктив
		|			ИЗ
		|				ВТ_СписокОбъектовУчета_Доначисление_УУ КАК СписокНМА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
		|	ТаблицаИзменений.Период КАК Период,
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ТаблицаИзменений.Период, МЕСЯЦ, 1), МЕСЯЦ) КАК НачалоСледующегоМесяца,
		|	ТаблицаИзменений.НематериальныйАктив КАК НематериальныйАктив,
		|	ТаблицаИзменений.Организация КАК Организация,
		|	МАКСИМУМ(ПараметрыАмортизацииНМАУУПоследнее.Период) КАК ПараметрыАмортизацииНМАУУПоследнееПериод,
		|	МАКСИМУМ(ПорядокУчетаНМАИзмененияПоследнее.Период) КАК ПорядокУчетаНМАИзмененияПоследнееПериод,
		|	МАКСИМУМ(ПорядокУчетаНМАУУИзмененияПоследнее.Период) КАК ПорядокУчетаНМАУУИзмененияПоследнееПериод,
		|	МАКСИМУМ(МестоУчетаНМАИзмененияПоследнее.Период) КАК МестоУчетаНМАИзмененияПоследнееПериод
		|ПОМЕСТИТЬ ТаблицаИзменений
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
		|		ТаблицаИзменений.Период КАК Период,
		|		ТаблицаИзменений.НематериальныйАктив КАК НематериальныйАктив,
		|		ТаблицаИзменений.Организация КАК Организация
		|	ИЗ
		|		ПараметрыАмортизацииНМАУУИзменения КАК ТаблицаИзменений
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
		|		ТаблицаИзменений.Период,
		|		ТаблицаИзменений.НематериальныйАктив,
		|		ТаблицаИзменений.Организация
		|	ИЗ
		|		ПорядокУчетаНМАИзменения КАК ТаблицаИзменений
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
		|		ТаблицаИзменений.Период,
		|		ТаблицаИзменений.НематериальныйАктив,
		|		ТаблицаИзменений.Организация
		|	ИЗ
		|		ПорядокУчетаНМАУУИзменения КАК ТаблицаИзменений
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
		|		ТаблицаИзменений.Период,
		|		ТаблицаИзменений.НематериальныйАктив,
		|		ТаблицаИзменений.Организация
		|	ИЗ
		|		МестоУчетаНМАИзменения КАК ТаблицаИзменений
		|
		|	) КАК ТаблицаИзменений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАУУИзменения КАК ПараметрыАмортизацииНМАУУПоследнее
		|		ПО (ПараметрыАмортизацииНМАУУПоследнее.Организация = ТаблицаИзменений.Организация)
		|			И (ПараметрыАмортизацииНМАУУПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
		|			И (ПараметрыАмортизацииНМАУУПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
		|			И (ПараметрыАмортизацииНМАУУПоследнее.Период <= ТаблицаИзменений.Период)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАИзменения КАК ПорядокУчетаНМАИзмененияПоследнее
		|		ПО (ПорядокУчетаНМАИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
		|			И (ПорядокУчетаНМАИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
		|			И (ПорядокУчетаНМАИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
		|			И (ПорядокУчетаНМАИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАУУИзменения КАК ПорядокУчетаНМАУУИзмененияПоследнее
		|		ПО (ПорядокУчетаНМАУУИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
		|			И (ПорядокУчетаНМАУУИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
		|			И (ПорядокУчетаНМАУУИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
		|			И (ПорядокУчетаНМАУУИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМАИзменения КАК МестоУчетаНМАИзмененияПоследнее
		|		ПО (МестоУчетаНМАИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
		|			И (МестоУчетаНМАИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
		|			И (МестоУчетаНМАИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
		|			И (МестоУчетаНМАИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИзменений.НачалоМесяца,
		|	ТаблицаИзменений.Период,
		|	ТаблицаИзменений.НематериальныйАктив,
		|	ТаблицаИзменений.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
		|	КОНЕЦПЕРИОДА(ТаблицаИзменений.НачалоМесяца, МЕСЯЦ) КАК КонецМесяца,
		|	КОНЕЦПЕРИОДА(ТаблицаИзменений.Период, ДЕНЬ) КАК ДатаИзменений,
		|	ВЫБОР 
		|		КОГДА ТаблицаИзменений.НачалоМесяца = &НачалоПредыдущегоМесяца
		|			ТОГДА МИНИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ТаблицаИзмененийВЭтомМесяце.Период, ДЕНЬ, -1), &КонецМесяца)) 
		|		ИНАЧЕ МИНИМУМ(ЕСТЬNULL(ТаблицаИзмененийСледующее.Период, &КонецМесяца)) 
		|	КОНЕЦ КАК Период,
		|	РАЗНОСТЬДАТ(ТаблицаИзменений.Период, МИНИМУМ(ЕСТЬNULL(ТаблицаИзмененийСледующее.Период, ТаблицаИзменений.НачалоСледующегоМесяца)), ДЕНЬ) КАК СрокДействия,
		|	ТаблицаИзменений.НематериальныйАктив КАК НематериальныйАктив,
		|	ТаблицаИзменений.Организация КАК Организация,
		|	ПараметрыАмортизацииНМАУУПоследнее.СрокИспользования,
		|	ПараметрыАмортизацииНМАУУПоследнее.КоэффициентУскорения,
		|	ПараметрыАмортизацииНМАУУПоследнее.МетодНачисленияАмортизации,
		|	ПараметрыАмортизацииНМАУУПоследнее.ЛиквидационнаяСтоимость,
		|	ПорядокУчетаНМАИзмененияПоследнее.ГруппаФинансовогоУчета,
		|	ПорядокУчетаНМАИзмененияПоследнее.НаправлениеДеятельности,
		|	ПорядокУчетаНМАИзмененияПоследнее.ОбъемНаработки,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.Состояние,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.НачислятьАмортизациюУУ,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.СпособОтраженияРасходов,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.СтатьяРасходов,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.АналитикаРасходов,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.ПередаватьРасходыВДругуюОрганизацию,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.ОрганизацияПолучательРасходов,
		|	МестоУчетаНМАИзмененияПоследнее.Подразделение
		|ПОМЕСТИТЬ ВТ_Изменения_УУ
		|ИЗ
		|	ТаблицаИзменений КАК ТаблицаИзменений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзменений КАК ТаблицаИзмененийСледующее
		|		ПО (ТаблицаИзмененийСледующее.Организация = ТаблицаИзменений.Организация)
		|			И (ТаблицаИзмененийСледующее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
		|			И (ТаблицаИзмененийСледующее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
		|			И (ТаблицаИзмененийСледующее.Период > ТаблицаИзменений.Период)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзменений КАК ТаблицаИзмененийВЭтомМесяце
		|		ПО (ТаблицаИзмененийВЭтомМесяце.Организация = ТаблицаИзменений.Организация)
		|			И (ТаблицаИзмененийВЭтомМесяце.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
		|			И (ТаблицаИзмененийВЭтомМесяце.НачалоМесяца = &НачалоМесяца)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАУУИзменения КАК ПараметрыАмортизацииНМАУУПоследнее
		|		ПО (ПараметрыАмортизацииНМАУУПоследнее.Организация = ТаблицаИзменений.Организация)
		|			И (ПараметрыАмортизацииНМАУУПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
		|			И (ПараметрыАмортизацииНМАУУПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
		|			И (ПараметрыАмортизацииНМАУУПоследнее.Период = ТаблицаИзменений.ПараметрыАмортизацииНМАУУПоследнееПериод)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАИзменения КАК ПорядокУчетаНМАИзмененияПоследнее
		|		ПО (ПорядокУчетаНМАИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
		|			И (ПорядокУчетаНМАИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
		|			И (ПорядокУчетаНМАИзмененияПоследнее.Период = ТаблицаИзменений.ПорядокУчетаНМАИзмененияПоследнееПериод)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАУУИзменения КАК ПорядокУчетаНМАУУИзмененияПоследнее
		|		ПО (ПорядокУчетаНМАУУИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
		|			И (ПорядокУчетаНМАУУИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
		|			И (ПорядокУчетаНМАУУИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
		|			И (ПорядокУчетаНМАУУИзмененияПоследнее.Период = ТаблицаИзменений.ПорядокУчетаНМАУУИзмененияПоследнееПериод)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМАИзменения КАК МестоУчетаНМАИзмененияПоследнее
		|		ПО (МестоУчетаНМАИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
		|			И (МестоУчетаНМАИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
		|			И (МестоУчетаНМАИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
		|			И (МестоУчетаНМАИзмененияПоследнее.Период = ТаблицаИзменений.МестоУчетаНМАИзмененияПоследнееПериод)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИзменений.НачалоМесяца,
		|	ТаблицаИзменений.Период,
		|	ТаблицаИзменений.НематериальныйАктив,
		|	ТаблицаИзменений.Организация,
		|	ТаблицаИзменений.ПараметрыАмортизацииНМАУУПоследнееПериод,
		|	ТаблицаИзменений.ПорядокУчетаНМАУУИзмененияПоследнееПериод,
		|	ТаблицаИзменений.МестоУчетаНМАИзмененияПоследнееПериод,
		|	ПараметрыАмортизацииНМАУУПоследнее.СрокИспользования,
		|	ПараметрыАмортизацииНМАУУПоследнее.КоэффициентУскорения,
		|	ПараметрыАмортизацииНМАУУПоследнее.МетодНачисленияАмортизации,
		|	ПараметрыАмортизацииНМАУУПоследнее.ЛиквидационнаяСтоимость,
		|	ПорядокУчетаНМАИзмененияПоследнее.ГруппаФинансовогоУчета,
		|	ПорядокУчетаНМАИзмененияПоследнее.НаправлениеДеятельности,
		|	ПорядокУчетаНМАИзмененияПоследнее.ОбъемНаработки,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.Состояние,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.НачислятьАмортизациюУУ,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.СпособОтраженияРасходов,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.СтатьяРасходов,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.АналитикаРасходов,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.ПередаватьРасходыВДругуюОрганизацию,
		|	ПорядокУчетаНМАУУИзмененияПоследнее.ОрганизацияПолучательРасходов,
		|	МестоУчетаНМАИзмененияПоследнее.Подразделение
		|
		|;
		|УНИЧТОЖИТЬ ПараметрыАмортизацииНМАУУИзменения
		|;
		|УНИЧТОЖИТЬ ПорядокУчетаНМАИзменения
		|;
		|УНИЧТОЖИТЬ ПорядокУчетаНМАУУИзменения
		|;
		|УНИЧТОЖИТЬ МестоУчетаНМАИзменения
		|;
		|УНИЧТОЖИТЬ ТаблицаИзменений
		|";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК НачалоМесяца,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК КонецМесяца,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаИзменений,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
		|	0    КАК СрокДействия,
		|	NULL КАК НематериальныйАктив,
		|	NULL КАК Организация,
		|	0    КАК Стоимость,
		|	0    КАК СрокИспользования,
		|	0    КАК КоэффициентУскорения,
		|	0    КАК ОбъемНаработки,
		|	NULL КАК МетодНачисленияАмортизации,
		|	NULL КАК ЛиквидационнаяСтоимость,
		|	NULL КАК ГруппаФинансовогоУчета,
		|	NULL КАК НаправлениеДеятельности,
		|	NULL КАК Состояние,
		|	ЛОЖЬ КАК НачислятьАмортизациюУУ,
		|	NULL КАК СпособОтраженияРасходов,
		|	NULL КАК СтатьяРасходов,
		|	NULL КАК АналитикаРасходов,
		|	NULL КАК ПередаватьРасходыВДругуюОрганизацию,
		|	NULL КАК ОрганизацияПолучательРасходов,
		|	NULL КАК Подразделение
		|ПОМЕСТИТЬ ВТ_Изменения_УУ
		|
		|ГДЕ
		|	ЛОЖЬ";
	
	КонецЕсли; 

	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область ПериодИзменения_УУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Изменения_УУ.НачалоМесяца           КАК НачалоМесяца,
	|	Изменения_УУ.НематериальныйАктив    КАК НематериальныйАктив,
	|	Изменения_УУ.Организация            КАК Организация,
	|	МИНИМУМ(Изменения_УУ.ДатаИзменений) КАК Период
	|ПОМЕСТИТЬ ВТ_ПериодИзменения_УУ
	|ИЗ
	|	ВТ_Изменения_УУ КАК Изменения_УУ
	|
	|СГРУППИРОВАТЬ ПО
	|	Изменения_УУ.НачалоМесяца,
	|	Изменения_УУ.НематериальныйАктив,
	|	Изменения_УУ.Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокНМАСПараметрами_БУ
	
	Если ПараметрыРасчета.ИспользоватьРеглУчет Тогда
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписокНМА.НематериальныйАктив,
		|	СписокНМА.НематериальныйАктив.ВидОбъектаУчета КАК ВидОбъектаУчета,
		|	СписокНМА.Организация,
		|
		|	ПорядокУчетаНМА.ГруппаФинансовогоУчета,
		|	ПорядокУчетаНМА.НаправлениеДеятельности,
		|	ПорядокУчетаНМА.ОбъемНаработки,
		|
		|	СписокНМА.НачислятьАмортизациюБУ,
		|	СписокНМА.НачислятьАмортизациюНУ,
		|
		|	СписокНМА.СтатьяРасходовБУ,
		|	СписокНМА.АналитикаРасходовБУ,
		|	СписокНМА.СпособОтраженияРасходовБУ,
		|	СписокНМА.ПередаватьРасходыВДругуюОрганизациюБУ,
		|	СписокНМА.ОрганизацияПолучательРасходовБУ,
		|
		|	&ФактическийСрокИспользования КАК ФактическийСрокИспользования,
		|
		|	ЕСТЬNULL(СпециальныйКоэффициентНУ.СпециальныйКоэффициент, 1) КАК СпециальныйКоэффициентНУ,
		|
		|	СписокНМА.АмортизационнаяГруппа,
		|	&НормаАмортизации КАК НормаАмортизации,
		|
		|	ВЫБОР
		|		КОГДА ГОД(&ДатаПереходаКЛинейномуМетоду) = 2009
		|			ТОГДА ЕСТЬNULL(ПервоначальныеСведенияНМА.ФактическийСрокИспользованияДо2009, 0)
		|		ИНАЧЕ (ГОД(&ДатаПереходаКЛинейномуМетоду) 
		|					- ГОД(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ)) * 12 
		|				+ (МЕСЯЦ(&ДатаПереходаКЛинейномуМетоду) - МЕСЯЦ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ)) - 1
		|	КОНЕЦ КАК ФактическийСрокПриПереходеКЛинейномуМетоду,
		|
		|	ВЫБОР
		|		КОГДА ГОД(&ДатаПереходаКЛинейномуМетоду) = 2009
		|			ТОГДА ЕСТЬNULL(ПервоначальныеСведенияНМА.АмортизацияДо2009, 0)
		|		ИНАЧЕ ЕСТЬNULL(АмортизацияНМАПриПереходеКЛинейномуМетоду.АмортизацияНУ, 0)
		|	КОНЕЦ КАК АмортизацияПриПереходеКЛинейномуМетоду,
		|
		|	ЕСТЬNULL(СтоимостьНМА.Стоимость, 0)     КАК Стоимость,
		|	ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) КАК СтоимостьРегл,
		|	ЕСТЬNULL(СтоимостьНМА.СтоимостьНУ, 0)   КАК СтоимостьНУ,
		|	ЕСТЬNULL(СтоимостьНМА.СтоимостьПР, 0)   КАК СтоимостьПР,
		|	ЕСТЬNULL(СтоимостьНМА.СтоимостьВР, 0)   КАК СтоимостьВР,
		|	ЕСТЬNULL(СтоимостьНМА.СтоимостьЦФ, 0)   КАК СтоимостьЦФ,
		|	ЕСТЬNULL(СтоимостьНМА.СтоимостьНУЦФ, 0) КАК СтоимостьНУЦФ,
		|	ЕСТЬNULL(СтоимостьНМА.СтоимостьПРЦФ, 0) КАК СтоимостьПРЦФ,
		|	ЕСТЬNULL(СтоимостьНМА.СтоимостьВРЦФ, 0) КАК СтоимостьВРЦФ,
		|	ЕСТЬNULL(СтоимостьНМАНаНачалоГода.СтоимостьРегл, 0) КАК СтоимостьНаНачалоГода,
		|	ЕСТЬNULL(СтоимостьНМА.СтоимостьНУ, 0)
		|		+ ЕСТЬNULL(СтоимостьНМА.СтоимостьНУЦФ, 0) КАК СтоимостьНУНачальныйОстаток,
		|
		|	ЕСТЬNULL(АмортизацияНМА.Амортизация, 0) КАК Амортизация,
		|	ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0) КАК АмортизацияРегл,
		|	ЕСТЬNULL(АмортизацияНМА.АмортизацияНУ, 0) КАК АмортизацияНУ,
		|	ЕСТЬNULL(АмортизацияНМА.АмортизацияПР, 0) КАК АмортизацияПР,
		|	ЕСТЬNULL(АмортизацияНМА.АмортизацияВР, 0) КАК АмортизацияВР,
		|	ЕСТЬNULL(АмортизацияНМА.АмортизацияЦФ, 0) КАК АмортизацияЦФ,
		|	ЕСТЬNULL(АмортизацияНМА.АмортизацияНУЦФ, 0) КАК АмортизацияНУЦФ,
		|	ЕСТЬNULL(АмортизацияНМА.АмортизацияПРЦФ, 0) КАК АмортизацияПРЦФ,
		|	ЕСТЬNULL(АмортизацияНМА.АмортизацияВРЦФ, 0) КАК АмортизацияВРЦФ,
		|	ЕСТЬNULL(АмортизацияНМА.АмортизацияНУ, 0)
		|		+ ЕСТЬNULL(АмортизацияНМА.АмортизацияНУЦФ, 0) КАК АмортизацияНУНачальныйОстаток,
		|
		|	МестоУчетаНМА.Подразделение,
		|
		|	ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) КАК ОбъемВыработки,
		|
		|	ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ,
		|	ВЫБОР
		|		КОГДА СписокНМА.НематериальныйАктив.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СписокНМА.НематериальныйАктив.АмортизационнаяГруппа В (
		|								ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), 
		|								ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), 
		|								ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа), 
		|								ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа))
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
		|				ИНАЧЕ ЕСТЬNULL(РегУчетнаяПолитика.УчетнаяПолитика.МетодНачисленияАмортизацииНУ, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный))
		|			КОНЕЦ
		|	КОНЕЦ КАК МетодНачисленияАмортизацииНУ,
		|	ПервоначальныеСведенияНМА.СтоимостьДо2002,
		|	ПервоначальныеСведенияНМА.АмортизацияДо2002,
		|	ПервоначальныеСведенияНМА.АмортизацияДо2009,
		|	ПервоначальныеСведенияНМА.ФактическийСрокИспользованияДо2009,
		|	ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьБУ,
		|	ВЫБОР 
		|		КОГДА СписокНМА.НематериальныйАктив.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
		|			ТОГДА ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьНУ 
		|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьНУ, 0)
		|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизацииНУ,
		|
		|	ПараметрыАмортизацииНМАБУ.СрокПолезногоИспользованияБУ,
		|	ПараметрыАмортизацииНМАБУ.СрокПолезногоИспользованияНУ,
		|	ПараметрыАмортизацииНМАБУ.КоэффициентБУ,
		|
		|	ВЫБОР 
		|		КОГДА ЕСТЬNULL(СтоимостьНМА.СтоимостьЦФ, 0) = 0
		|				И ЕСТЬNULL(СтоимостьНМА.СтоимостьНУЦФ, 0) = 0
		|				И ЕСТЬNULL(СтоимостьНМА.СтоимостьПРЦФ, 0) = 0
		|				И ЕСТЬNULL(СтоимостьНМА.СтоимостьВРЦФ, 0) = 0
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) = 0
		|			ТОГДА 1
		|		КОГДА (ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьНМА.СтоимостьЦФ, 0)) <> 0
		|			ТОГДА ЕСТЬNULL(СтоимостьНМА.СтоимостьЦФ, 0) / (ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьНМА.СтоимостьЦФ, 0)) 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоэффициентЦФБУ,
		|	ВЫБОР 
		|		КОГДА ЕСТЬNULL(СтоимостьНМА.СтоимостьЦФ, 0) = 0
		|				И ЕСТЬNULL(СтоимостьНМА.СтоимостьНУЦФ, 0) = 0
		|				И ЕСТЬNULL(СтоимостьНМА.СтоимостьПРЦФ, 0) = 0
		|				И ЕСТЬNULL(СтоимостьНМА.СтоимостьВРЦФ, 0) = 0
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(СтоимостьНМА.СтоимостьНУ, 0) = 0
		|			ТОГДА 1
		|		КОГДА (ЕСТЬNULL(СтоимостьНМА.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьНМА.СтоимостьНУЦФ, 0)) <> 0
		|			ТОГДА ЕСТЬNULL(СтоимостьНМА.СтоимостьНУЦФ, 0) / (ЕСТЬNULL(СтоимостьНМА.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьНМА.СтоимостьНУЦФ, 0)) 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоэффициентЦФНУ,
		|	ВЫБОР 
		|		КОГДА ЕСТЬNULL(СтоимостьНМА.СтоимостьЦФ, 0) = 0
		|				И ЕСТЬNULL(СтоимостьНМА.СтоимостьНУЦФ, 0) = 0
		|				И ЕСТЬNULL(СтоимостьНМА.СтоимостьПРЦФ, 0) = 0
		|				И ЕСТЬNULL(СтоимостьНМА.СтоимостьВРЦФ, 0) = 0
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(СтоимостьНМА.СтоимостьПР, 0) = 0
		|			ТОГДА 1
		|		КОГДА (ЕСТЬNULL(СтоимостьНМА.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьНМА.СтоимостьПРЦФ, 0)) <> 0
		|			ТОГДА ЕСТЬNULL(СтоимостьНМА.СтоимостьПРЦФ, 0) / (ЕСТЬNULL(СтоимостьНМА.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьНМА.СтоимостьПРЦФ, 0)) 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоэффициентЦФПР
		|
		|ПОМЕСТИТЬ ВТ_СписокНМАСПараметрами_БУ
		|ИЗ
		|	ВТ_СписокОбъектовУчета_БУ КАК СписокНМА
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокУчетаНМА КАК ПорядокУчетаНМА
		|		ПО (ПорядокУчетаНМА.Организация = СписокНМА.Организация)
		|			И (ПорядокУчетаНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
		|			И (ПорядокУчетаНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьНМА_НаНачалоМесяца КАК СтоимостьНМА
		|		ПО (СтоимостьНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
		|			И (СтоимостьНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьНМА_НаНачалоГода КАК СтоимостьНМАНаНачалоГода
		|		ПО (СтоимостьНМАНаНачалоГода.НематериальныйАктив = СписокНМА.НематериальныйАктив)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияНМА_НаНачалоМесяца КАК АмортизацияНМА
		|		ПО (АмортизацияНМА.Организация = СписокНМА.Организация)
		|			И (АмортизацияНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
		|			И (АмортизацияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияНМАПриПереходеКЛинейномуМетоду КАК АмортизацияНМАПриПереходеКЛинейномуМетоду
		|		ПО (АмортизацияНМАПриПереходеКЛинейномуМетоду.Организация = СписокНМА.Организация)
		|			И (АмортизацияНМАПриПереходеКЛинейномуМетоду.НематериальныйАктив = СписокНМА.НематериальныйАктив)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МестоУчетаНМА КАК МестоУчетаНМА
		|		ПО (МестоУчетаНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
		|			И (МестоУчетаНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
		|		ПО (ПервоначальныеСведенияНМА.Организация = СписокНМА.Организация)
		|			И (ПервоначальныеСведенияНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
		|			И (ПервоначальныеСведенияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизацииНМАБУ КАК ПараметрыАмортизацииНМАБУ
		|		ПО (ПараметрыАмортизацииНМАБУ.Организация = СписокНМА.Организация)
		|			И (ПараметрыАмортизацииНМАБУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпециальныйКоэффициентНУ КАК СпециальныйКоэффициентНУ
		|		ПО (СпециальныйКоэффициентНУ.Организация = СписокНМА.Организация)
		|			И (СпециальныйКоэффициентНУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыработкаНМА КАК ВыработкаНМА
		|		ПО (ВыработкаНМА.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&КонецМесяца) КАК РегУчетнаяПолитика
		|		ПО РегУчетнаяПолитика.Организация = СписокНМА.Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СписокНМА.НематериальныйАктив,
		|	СписокНМА.Организация";

		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса, 
			"&ФактическийСрокИспользования", 
			ВнеоборотныеАктивыСлужебный.ТекстПоляФактическийСрокИспользования("ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ"));
		
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса, 
			"&НормаАмортизации", 
			ВнеоборотныеАктивыСлужебный.ТекстПоляНормаАмортизации("СписокНМА.АмортизационнаяГруппа"));
			
		СписокЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СписокНМАСПараметрами_УУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР 
	|		КОГДА ПериодИзмененияВТекущемМесяце.Период ЕСТЬ NULL
	|			ТОГДА СписокНМА.ПериодНачисления
	|		КОГДА НАЧАЛОПЕРИОДА(ПериодИзмененияВТекущемМесяце.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПериодИзмененияВТекущемМесяце.Период, МЕСЯЦ)
	|			ТОГДА ПериодИзмененияВТекущемМесяце.Период
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПериодИзмененияВТекущемМесяце.Период, ДЕНЬ, -1)
	|	КОНЕЦ КАК Период,
	|	СписокНМА.ЭтоДоначисление,
	|	СписокНМА.НематериальныйАктив,
	|	СписокНМА.НематериальныйАктив.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Организация,
	|
	|	ПорядокУчетаНМА.ГруппаФинансовогоУчета,
	|	ПорядокУчетаНМА.НаправлениеДеятельности,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ПорядокУчетаНМА.ОбъемНаработки, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииНМАУУ.СрокИспользования, 0)
	|	КОНЕЦ КАК РесурсНазначенный,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫБОР 
	|					КОГДА НЕ ПериодИзменения_УУ.Период ЕСТЬ NULL
	|						ТОГДА ВЫБОР 
	|								КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|									ТОГДА (РАЗНОСТЬДАТ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|									ИНАЧЕ (РАЗНОСТЬДАТ(СписокНМА.НачалоМесяца, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|							КОНЕЦ / ДЕНЬ(СписокНМА.КонецМесяца)
	|					ИНАЧЕ 1
	|				КОНЕЦ * ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0)
	
	// Если расчет выполняется в месяце принятия к учету то ДеньПринятия/ВсегоДнейВМесяце.
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|			ТОГДА (РАЗНОСТЬДАТ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|					/ ДЕНЬ(СписокНМА.КонецМесяца)
	
	// В остальных случаях КоличествоДнейДоПервогоИзмененияПараметров/ВсегоДнейВМесяце
	|		ИНАЧЕ (РАЗНОСТЬДАТ(СписокНМА.НачалоМесяца, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|					/ ДЕНЬ(СписокНМА.КонецМесяца)
	|	КОНЕЦ КАК РесурсВыработанныйЗаТекущийПериод,
	|	  
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0)
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|				ИЛИ ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА КОНЕЦПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(СписокНМА.НачалоМесяца, МЕСЯЦ, -1), МЕСЯЦ)
	|			ТОГДА (РАЗНОСТЬДАТ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, КОНЕЦПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ), ДЕНЬ) + 1) / ДЕНЬ(КОНЕЦПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ))
	
	// 		Расшифровка формулы: [кол-во отработаннных дней в мес принятия] / [всего дней в мес принятия] + [кол-во месяцев после принятия до начала месяца].
	|		ИНАЧЕ
	|			(РАЗНОСТЬДАТ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, КОНЕЦПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ), ДЕНЬ) + 1) / ДЕНЬ(КОНЕЦПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ))
	|			+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ, 1), МЕСЯЦ), СписокНМА.КонецМесяца, МЕСЯЦ)
	|	КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериод,
	|
	|	ВЫБОР
	|		КОГДА ГОД(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ) <> ГОД(СписокНМА.НачалоМесяца) ТОГДА
	|			13 - МЕСЯЦ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ)
	|				+ 12 * (ГОД(СписокНМА.НачалоМесяца) - Год(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
	|
	|	СписокНМА.НачислятьАмортизациюУУ,
	|	СписокНМА.СтатьяРасходовУУ,
	|	СписокНМА.АналитикаРасходовУУ,
	|	СписокНМА.СпособОтраженияРасходовУУ,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизациюУУ,
	|	СписокНМА.ОрганизацияПолучательРасходовУУ,
	|
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.Стоимость, 0)
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.Стоимость, 0) - ЕСТЬNULL(АмортизацияНМА.Амортизация, 0)
	|	КОНЕЦ КАК ОстаточнаяСтоимость,
	|
	|	ЕСТЬNULL(СтоимостьНМА.Стоимость, 0) КАК Стоимость,
	|	ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьУУ КАК ПервоначальнаяСтоимость,
	|	&ФактическийСрокИспользования КАК ФактическийСрокИспользования,
	|
	|	ЕСТЬNULL(ПараметрыАмортизацииНМАУУ.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	|
	|	0 КАК СтоимостьНаНачалоГода,
	|
	|	ЕСТЬNULL(АмортизацияНМА.Амортизация, 0) КАК Амортизация,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА МестоУчетаНМАНаНачалоМесяца.Подразделение
	|		ИНАЧЕ МестоУчетаНМА.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|
	|	ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) КАК ОбъемВыработки,
	|
	|	ПараметрыАмортизацииНМАУУ.СрокИспользования КАК СрокИспользования,
	|	ПараметрыАмортизацииНМАУУ.КоэффициентУскорения КАК КоэффициентУскорения,
	|	ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_СписокНМАСПараметрами_УУ
	|ИЗ
	|	ВТ_СписокОбъектовУчета_УУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодИзменения_УУ КАК ПериодИзменения_УУ
	|		ПО (ПериодИзменения_УУ.Организация = СписокНМА.Организация)
	|			И (ПериодИзменения_УУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПериодИзменения_УУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодИзменения_УУ КАК ПериодИзмененияВТекущемМесяце
	|		ПО (ПериодИзмененияВТекущемМесяце.Организация = СписокНМА.Организация)
	|			И (ПериодИзмененияВТекущемМесяце.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПериодИзмененияВТекущемМесяце.НачалоМесяца = &НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокУчетаНМА КАК ПорядокУчетаНМА
	|		ПО (ПорядокУчетаНМА.Организация = СписокНМА.Организация)
	|			И (ПорядокУчетаНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьНМА_НаНачалоМесяца КАК СтоимостьНМА
	|		ПО (СтоимостьНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (СтоимостьНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредварительнаяСтоимостьНМА КАК ПредварительнаяСтоимостьНМА
	|		ПО (ПредварительнаяСтоимостьНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПредварительнаяСтоимостьНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияНМА_НаНачалоМесяца КАК АмортизацияНМА
	|		ПО (АмортизацияНМА.Организация = СписокНМА.Организация)
	|			И (АмортизацияНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (АмортизацияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МестоУчетаНМА КАК МестоУчетаНМА
	|		ПО (МестоУчетаНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (МестоУчетаНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МестоУчетаНМА КАК МестоУчетаНМАНаНачалоМесяца
	|		ПО (МестоУчетаНМАНаНачалоМесяца.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (МестоУчетаНМАНаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
	|		ПО (ПервоначальныеСведенияНМА.Организация = СписокНМА.Организация)
	|			И (ПервоначальныеСведенияНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизацииНМАУУ КАК ПараметрыАмортизацииНМАУУ
	|		ПО (ПараметрыАмортизацииНМАУУ.Организация = СписокНМА.Организация)
	|			И (ПараметрыАмортизацииНМАУУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАУУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыработкаНМА КАК ВыработкаНМА
	|		ПО (ВыработкаНМА.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)";	
	
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса, 
			"&ФактическийСрокИспользования", 
			ВнеоборотныеАктивыСлужебный.ТекстПоляФактическийСрокИспользования("ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокНМАСИзмененнымиПараметрами_УУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Изменения_УУ.Период,
	|	Изменения_УУ.НематериальныйАктив КАК НематериальныйАктив,
	|	(Изменения_УУ.НачалоМесяца = &НачалоПредыдущегоМесяца) КАК ЭтоДоначисление,
	|	ВЫРАЗИТЬ(Изменения_УУ.НематериальныйАктив КАК Справочник.НематериальныеАктивы).ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	Изменения_УУ.Организация,
	|
	|	ЕСТЬNULL(Изменения_УУ.ГруппаФинансовогоУчета,  ПорядокУчетаНМА.ГруппаФинансовогоУчета)  КАК ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(Изменения_УУ.НаправлениеДеятельности, ПорядокУчетаНМА.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Изменения_УУ.МетодНачисленияАмортизации, ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(Изменения_УУ.ОбъемНаработки, ПорядокУчетаНМА.ОбъемНаработки)
	|		ИНАЧЕ ЕСТЬNULL(Изменения_УУ.СрокИспользования, ПараметрыАмортизацииНМАУУ.СрокИспользования)
	|	КОНЕЦ КАК РесурсНазначенный,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Изменения_УУ.МетодНачисленияАмортизации, ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0)
	|		ИНАЧЕ 1
	|	КОНЕЦ * Изменения_УУ.СрокДействия / ДЕНЬ(Изменения_УУ.КонецМесяца) КАК РесурсВыработанныйЗаТекущийПериод,
	|	  
	|	ВЫБОР 
	|		КОГДА ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(Изменения_УУ.МетодНачисленияАмортизации, ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0)
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = Изменения_УУ.НачалоМесяца
	|			ТОГДА 0
	// 		Расшифровка формулы: [Кол-во отработаннных дней в мес. принятия] / [всего дней в мес.принятия] + [кол-во мес. после принятия до начала месяца расчета].
	|		ИНАЧЕ
	|			(РАЗНОСТЬДАТ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, КОНЕЦПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ), ДЕНЬ) + 1) / ДЕНЬ(КОНЕЦПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ))
	|			+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ, 1), МЕСЯЦ), Изменения_УУ.КонецМесяца, МЕСЯЦ)
	|	КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериод,
	|
	|	ВЫБОР
	|		КОГДА ГОД(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ) <> ГОД(Изменения_УУ.НачалоМесяца) ТОГДА
	|			13 - МЕСЯЦ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ)
	|				+ 12 * (ГОД(Изменения_УУ.НачалоМесяца) - Год(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
	|
	|	ЕСТЬNULL(Изменения_УУ.НачислятьАмортизациюУУ, ЕСТЬNULL(СписокНМА.НачислятьАмортизациюУУ, ЛОЖЬ)) КАК НачислятьАмортизациюУУ,
	|	ЕСТЬNULL(Изменения_УУ.СтатьяРасходов, СписокНМА.СтатьяРасходовУУ) КАК СтатьяРасходовУУ,
	|	ЕСТЬNULL(Изменения_УУ.АналитикаРасходов, СписокНМА.АналитикаРасходовУУ) КАК АналитикаРасходовУУ,
	|	ЕСТЬNULL(Изменения_УУ.СпособОтраженияРасходов, СписокНМА.СпособОтраженияРасходовУУ) КАК СпособОтраженияРасходовУУ,
	|	ЕСТЬNULL(Изменения_УУ.ПередаватьРасходыВДругуюОрганизацию, ЕСТЬNULL(СписокНМА.ПередаватьРасходыВДругуюОрганизациюУУ, ЛОЖЬ)) КАК ПередаватьРасходыВДругуюОрганизациюУУ,
	|	ЕСТЬNULL(Изменения_УУ.ОрганизацияПолучательРасходов, СписокНМА.ОрганизацияПолучательРасходовУУ) КАК ОрганизацияПолучательРасходовУУ,
	|
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = Изменения_УУ.НачалоМесяца
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.Стоимость, 0)
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.Стоимость, 0) - ЕСТЬNULL(АмортизацияНМА.Амортизация, 0)
	|	КОНЕЦ - ВЫБОР 
	|				КОГДА НЕ Изменения_УУ.ЛиквидационнаяСтоимость ЕСТЬ NULL
	|					ТОГДА Изменения_УУ.ЛиквидационнаяСтоимость
	|				КОГДА НЕ ПараметрыАмортизацииНМАУУ.ЛиквидационнаяСтоимость ЕСТЬ NULL
	|					ТОГДА ПараметрыАмортизацииНМАУУ.ЛиквидационнаяСтоимость
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОстаточнаяСтоимость,	
	|
	|	0 КАК СтоимостьНаНачалоГода,
	|
	|	ЕСТЬNULL(АмортизацияНМА.Амортизация, 0) КАК Амортизация,
	|
	|	ВЫБОР
	|		КОГДА Изменения_УУ.НачалоМесяца = &НачалоПредыдущегоМесяца
	|			ТОГДА МестоУчетаНМАНаНачалоМесяца.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(Изменения_УУ.Подразделение, МестоУчетаНМА.Подразделение) 
	|	КОНЕЦ КАК Подразделение,
	|
	|	ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) КАК ОбъемВыработки,
	|
	|	ЕСТЬNULL(Изменения_УУ.СрокИспользования, ПараметрыАмортизацииНМАУУ.СрокИспользования) КАК СрокИспользования,
	|	ЕСТЬNULL(Изменения_УУ.КоэффициентУскорения, ПараметрыАмортизацииНМАУУ.КоэффициентУскорения) КАК КоэффициентУскорения,
	|	ЕСТЬNULL(Изменения_УУ.ЛиквидационнаяСтоимость, ПараметрыАмортизацииНМАУУ.ЛиквидационнаяСтоимость) КАК ЛиквидационнаяСтоимость,
	|	ЕСТЬNULL(Изменения_УУ.МетодНачисленияАмортизации, ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации) КАК МетодНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_СписокНМАСИзмененнымиПараметрами_УУ
	|ИЗ
	|	ВТ_Изменения_УУ КАК Изменения_УУ
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокОбъектовУчета_УУ КАК СписокНМА
	|		ПО (СписокНМА.Организация = Изменения_УУ.Организация)
	|			И (СписокНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (СписокНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокУчетаНМА КАК ПорядокУчетаНМА
	|		ПО (ПорядокУчетаНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (ПорядокУчетаНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьНМА_НаНачалоМесяца КАК СтоимостьНМА
	|		ПО (СтоимостьНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (СтоимостьНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредварительнаяСтоимостьНМА КАК ПредварительнаяСтоимостьНМА
	|		ПО (ПредварительнаяСтоимостьНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (ПредварительнаяСтоимостьНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияНМА_НаНачалоМесяца КАК АмортизацияНМА
	|		ПО (АмортизацияНМА.Организация = Изменения_УУ.Организация)
	|			И (АмортизацияНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (АмортизацияНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МестоУчетаНМА КАК МестоУчетаНМА
	|		ПО (МестоУчетаНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (МестоУчетаНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МестоУчетаНМА КАК МестоУчетаНМАНаНачалоМесяца
	|		ПО (МестоУчетаНМАНаНачалоМесяца.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (МестоУчетаНМАНаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
	|		ПО (ПервоначальныеСведенияНМА.Организация = Изменения_УУ.Организация)
	|			И (ПервоначальныеСведенияНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизацииНМАУУ КАК ПараметрыАмортизацииНМАУУ
	|		ПО (ПараметрыАмортизацииНМАУУ.Организация = Изменения_УУ.Организация)
	|			И (ПараметрыАмортизацииНМАУУ.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАУУ.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыработкаНМА КАК ВыработкаНМА
	|		ПО (ВыработкаНМА.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтоДоначисление,
	|	НематериальныйАктив";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СпособыОтраженияРасходов
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокВсехНМА.СпособОтраженияРасходов КАК Ссылка
	|ПОМЕСТИТЬ втСпособыОтраженияРасходов
	|ИЗ
	|	ВТ_СписокОбъектовУчета КАК СписокВсехНМА
	|ГДЕ
	|	СписокВсехНМА.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокВсехНМА.СпособОтраженияРасходов
	|ИЗ
	|	ВТ_Изменения_УУ КАК СписокВсехНМА
	|ГДЕ
	|	СписокВсехНМА.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАмортизация.Ссылка                               КАК СпособОтраженияРасходов,
	|	ТаблицаАмортизация.Подразделение                        КАК Подразделение,
	|	ТаблицаАмортизация.НаправлениеДеятельности              КАК НаправлениеДеятельности,
	|	ТаблицаАмортизация.СтатьяРасходов                       КАК СтатьяРасходов,
	|	ТаблицаАмортизация.АналитикаРасходов                    КАК АналитикаРасходов,
	|	ТаблицаАмортизация.ПередаватьРасходыВДругуюОрганизацию  КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ТаблицаАмортизация.ОрганизацияПолучательРасходов        КАК ОрганизацияПолучательРасходов,
	|	ТаблицаАмортизация.Коэффициент                          КАК База,
	|	ТаблицаАмортизация.СуммаКоэффициентовПредыдущихСтрок    КАК БазаНакопленная,
	|	ТаблицаАмортизация.Ссылка.СуммаКоэффициентовАмортизации КАК СуммаБазы
	|ПОМЕСТИТЬ ВТ_СпособыОтраженияРасходов
	|ИЗ
	|	Документ.ИзменениеПараметровНМА2_4.АмортизационныеРасходы КАК ТаблицаАмортизация
	|ГДЕ
	|	ТаблицаАмортизация.Ссылка В (ВЫБРАТЬ СпособыОтраженияРасходов.Ссылка ИЗ втСпособыОтраженияРасходов КАК СпособыОтраженияРасходов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособОтраженияРасходов";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ТекстЗапросаПроверкаПараметровРасчета(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.НематериальныйАктив КАК ОбъектУчета,
	|
	// НеУказанОбъемНаработки
	|	 СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|		И СписокНМА.РесурсНазначенный = 0 КАК НеУказанОбъемНаработки
	|
	|ПОМЕСТИТЬ ВТ_ПроверкаПараметровРасчета_УУ
	|ИЗ
	|	ВТ_СписокНМАСПараметрами_УУ КАК СписокНМА
	|ГДЕ
	|	СписокНМА.НачислятьАмортизациюУУ И СписокНМА.ОстаточнаяСтоимость > 0
	|	И СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|		И СписокНМА.РесурсНазначенный = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	Если ПараметрыРасчета.ИспользоватьРеглУчет Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СписокНМА.Организация КАК Организация,
		|	СписокНМА.НематериальныйАктив КАК ОбъектУчета,
		|
		// НеУказанаАмортизационнаяГруппа
		|	СписокНМА.НачислятьАмортизациюНУ
		|		И СписокНМА.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)
		|		И СписокНМА.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка) КАК НеУказанаАмортизационнаяГруппа,
		|
		// НеУказанОбъемНаработки
		|	СписокНМА.НачислятьАмортизациюБУ
		|		И СписокНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
		|		И СписокНМА.ОбъемНаработки = 0 КАК НеУказанОбъемНаработки
		|
		|ПОМЕСТИТЬ ВТ_ПроверкаПараметровРасчета_БУ
		|ИЗ
		|	ВТ_СписокНМАСПараметрами_БУ КАК СписокНМА
		|ГДЕ
		|	СписокНМА.НачислятьАмортизациюНУ
		|		И СписокНМА.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)
		|		И СписокНМА.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)
		|
		|	ИЛИ СписокНМА.НачислятьАмортизациюБУ
		|		И СписокНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
		|		И СписокНМА.ОбъемНаработки = 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектУчета";
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизации_БУ(СписокЗапросов, ПараметрыРасчета)

	Если НЕ ПараметрыРасчета.ИспользоватьРеглУчет Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца КАК ПериодРасчета,
	|	Амортизация.Организация,
	|	Амортизация.Подразделение КАК Подразделение,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияРасходов.Подразделение, Амортизация.Подразделение) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА Амортизация.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияРасходов.Подразделение, Амортизация.Подразделение) 
	|	КОНЕЦ КАК КорПодразделение,
	|	Амортизация.НематериальныйАктив,
	|	Амортизация.ВидОбъектаУчета,
	|	Амортизация.ГруппаФинансовогоУчета,
	|	Амортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.НаправлениеДеятельности, Амортизация.НаправлениеДеятельности) КАК КорНаправлениеДеятельности,
	|
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СтатьяРасходов, Амортизация.СтатьяРасходов)          КАК СтатьяРасходов,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.АналитикаРасходов, Амортизация.АналитикаРасходов)    КАК АналитикаРасходов,
	|
	|	ВЫБОР 
	|		КОГДА Амортизация.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка) ТОГДА
	|			&СуммаБУ
	|		ИНАЧЕ Амортизация.СуммаБУ
	|	КОНЕЦ КАК СуммаБУ,
	|
	|	ВЫБОР 
	|		КОГДА Амортизация.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка) ТОГДА
	|			&СуммаНУ_регл
	|		ИНАЧЕ Амортизация.СуммаНУ
	|	КОНЕЦ КАК СуммаНУ,
	|
	|	ВЫБОР 
	|		КОГДА Амортизация.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка) ТОГДА
	|			&СуммаПР_регл
	|		ИНАЧЕ Амортизация.СуммаПР
	|	КОНЕЦ КАК СуммаПР,
	|
	|	ВЫБОР 
	|		КОГДА Амортизация.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка) ТОГДА
	|			&СуммаВР_регл
	|		ИНАЧЕ Амортизация.СуммаВР
	|	КОНЕЦ КАК СуммаВР,
	|
	|	ВЫБОР 
	|		КОГДА Амортизация.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка) ТОГДА
	|			&СуммаЦФ
	|		ИНАЧЕ Амортизация.СуммаЦФ
	|	КОНЕЦ КАК СуммаЦФ,
	|
	|	ВЫБОР 
	|		КОГДА Амортизация.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка) ТОГДА
	|			&СуммаНУЦФ_регл
	|		ИНАЧЕ Амортизация.СуммаНУЦФ
	|	КОНЕЦ КАК СуммаНУЦФ,
	|
	|	ВЫБОР 
	|		КОГДА Амортизация.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка) ТОГДА
	|			&СуммаПРЦФ_регл
	|		ИНАЧЕ Амортизация.СуммаПРЦФ
	|	КОНЕЦ КАК СуммаПРЦФ,
	|
	|	ВЫБОР 
	|		КОГДА Амортизация.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка) ТОГДА
	|			&СуммаВРЦФ_регл
	|		ИНАЧЕ Амортизация.СуммаВРЦФ
	|	КОНЕЦ КАК СуммаВРЦФ,
	|
	|	ЕСТЬNULL(СпособыОтраженияРасходов.ПередаватьРасходыВДругуюОрганизацию, Амортизация.ПередаватьРасходыВДругуюОрганизацию) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.ОрганизацияПолучательРасходов, Амортизация.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	|	(Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.СуммаБУ) <=0 
	|		И (Амортизация.ОстаточнаяСтоимостьНУ - Амортизация.СуммаНУ) <=0 
	|		И (Амортизация.ОстаточнаяСтоимостьЦФ - Амортизация.СуммаЦФ) <=0 
	|		И (Амортизация.ОстаточнаяСтоимостьНУЦФ - Амортизация.СуммаНУЦФ) <=0 КАК АмортизацияПолностьюНачислена
	|
	|ПОМЕСТИТЬ ВТ_РасчетАмортизации_БУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.Организация               КАК Организация,
	|		СписокНМА.Подразделение             КАК Подразделение,
	|		СписокНМА.НематериальныйАктив       КАК НематериальныйАктив,
	|		СписокНМА.ГруппаФинансовогоУчета    КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности   КАК НаправлениеДеятельности,
	|		СписокНМА.СтатьяРасходов            КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов         КАК АналитикаРасходов,
	|		СписокНМА.СпособОтраженияРасходов   КАК СпособОтраженияРасходов,
	|		СписокНМА.ВидОбъектаУчета           КАК  ВидОбъектаУчета,
	|
			// СуммаБУ
	|		ВЫБОР 
	|			КОГДА СУММА(СписокНМА.СуммаБУ - ВЫРАЗИТЬ(СписокНМА.СуммаБУ * СписокНМА.КоэффициентЦФБУ КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьРегл
	|				ТОГДА СУММА(СписокНМА.СуммаБУ - ВЫРАЗИТЬ(СписокНМА.СуммаБУ * СписокНМА.КоэффициентЦФБУ КАК ЧИСЛО (15,2)))
	|			ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьРегл
	|		КОНЕЦ КАК СуммаБУ,
	|
			// СуммаНУ
	|		ВЫБОР 
	|			КОГДА СУММА(СписокНМА.СуммаНУ - ВЫРАЗИТЬ(СписокНМА.СуммаНУ * СписокНМА.КоэффициентЦФНУ КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьНУ
	|				ТОГДА СУММА(СписокНМА.СуммаНУ - ВЫРАЗИТЬ(СписокНМА.СуммаНУ * СписокНМА.КоэффициентЦФНУ КАК ЧИСЛО (15,2)))
	|			ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьНУ
	|		КОНЕЦ КАК СуммаНУ,
	|
			// СуммаПР
	|		ВЫБОР 
	|			КОГДА СписокНМА.ОстаточнаяСтоимостьПР = 0
	|				ТОГДА 0
	|			КОГДА СписокНМА.ОстаточнаяСтоимостьПР > 0
	|				ТОГДА 
	|					ВЫБОР КОГДА СУММА(СписокНМА.СуммаПР - ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьПР
	|						ТОГДА СУММА(СписокНМА.СуммаПР - ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2)))
	|						ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьПР
	|					КОНЕЦ 
	|			ИНАЧЕ
	|				ВЫБОР КОГДА СУММА(СписокНМА.СуммаПР - ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2))) > СписокНМА.ОстаточнаяСтоимостьПР
	|						ТОГДА СУММА(СписокНМА.СуммаПР - ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2)))
	|						ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьПР
	|					КОНЕЦ
	|		КОНЕЦ КАК СуммаПР,
	|
			// СуммаВР
	|		ВЫБОР 
	|			КОГДА СУММА(СписокНМА.СуммаБУ - ВЫРАЗИТЬ(СписокНМА.СуммаБУ * СписокНМА.КоэффициентЦФБУ КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьРегл
	|				ТОГДА СУММА(СписокНМА.СуммаБУ - ВЫРАЗИТЬ(СписокНМА.СуммаБУ * СписокНМА.КоэффициентЦФБУ КАК ЧИСЛО (15,2)))
	|			ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьРегл
	|		КОНЕЦ
	|		- ВЫБОР 
	|			КОГДА СУММА(СписокНМА.СуммаНУ - ВЫРАЗИТЬ(СписокНМА.СуммаНУ * СписокНМА.КоэффициентЦФНУ КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьНУ
	|				ТОГДА СУММА(СписокНМА.СуммаНУ - ВЫРАЗИТЬ(СписокНМА.СуммаНУ * СписокНМА.КоэффициентЦФНУ КАК ЧИСЛО (15,2)))
	|			ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьНУ
	|		КОНЕЦ
	|		- ВЫБОР 
	|			КОГДА СписокНМА.ОстаточнаяСтоимостьПР = 0
	|				ТОГДА 0
	|			КОГДА СписокНМА.ОстаточнаяСтоимостьПР > 0
	|				ТОГДА 
	|					ВЫБОР КОГДА СУММА(СписокНМА.СуммаПР - ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьПР
	|						ТОГДА СУММА(СписокНМА.СуммаПР - ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2)))
	|						ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьПР
	|					КОНЕЦ 
	|			ИНАЧЕ
	|				ВЫБОР КОГДА СУММА(СписокНМА.СуммаПР - ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2))) > СписокНМА.ОстаточнаяСтоимостьПР
	|						ТОГДА СУММА(СписокНМА.СуммаПР - ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2)))
	|						ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьПР
	|					КОНЕЦ
	|		КОНЕЦ КАК СуммаВР,
	|
			// СуммаЦФ
	|		ВЫБОР 
	|			КОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаБУ * СписокНМА.КоэффициентЦФБУ КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьЦФ
	|				ТОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаБУ * СписокНМА.КоэффициентЦФБУ КАК ЧИСЛО (15,2)))
	|			ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьЦФ
	|		КОНЕЦ КАК СуммаЦФ,
	|
			// СуммаНУЦФ
	|		ВЫБОР 
	|			КОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаНУ * СписокНМА.КоэффициентЦФНУ КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьНУЦФ
	|				ТОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаНУ * СписокНМА.КоэффициентЦФНУ КАК ЧИСЛО (15,2)))
	|			ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьНУЦФ
	|		КОНЕЦ КАК СуммаНУЦФ,
	|
			// СуммаПРЦФ
	|		ВЫБОР 
	|			КОГДА СписокНМА.ОстаточнаяСтоимостьПРЦФ = 0
	|				ТОГДА 0
	|			КОГДА СписокНМА.ОстаточнаяСтоимостьПРЦФ > 0
	|				ТОГДА
	|					ВЫБОР КОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьПРЦФ
	|						ТОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2)))
	|						ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьПРЦФ
	|					КОНЕЦ
	|			ИНАЧЕ 
	|				ВЫБОР КОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2))) > СписокНМА.ОстаточнаяСтоимостьПРЦФ
	|						ТОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2)))
	|						ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьПРЦФ
	|					КОНЕЦ
	|		КОНЕЦ КАК СуммаПРЦФ,
	|
			// СуммаВРЦФ
	|		ВЫБОР 
	|			КОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаБУ * СписокНМА.КоэффициентЦФБУ КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьЦФ
	|				ТОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаБУ * СписокНМА.КоэффициентЦФБУ КАК ЧИСЛО (15,2)))
	|			ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьЦФ
	|		КОНЕЦ 
	|		- ВЫБОР 
	|			КОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаНУ * СписокНМА.КоэффициентЦФНУ КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьНУЦФ
	|				ТОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаНУ * СписокНМА.КоэффициентЦФНУ КАК ЧИСЛО (15,2)))
	|			ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьНУЦФ
	|		КОНЕЦ
	|		- ВЫБОР 
	|			КОГДА СписокНМА.ОстаточнаяСтоимостьПРЦФ = 0
	|				ТОГДА 0
	|			КОГДА СписокНМА.ОстаточнаяСтоимостьПРЦФ > 0
	|				ТОГДА
	|					ВЫБОР КОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2))) < СписокНМА.ОстаточнаяСтоимостьПРЦФ
	|						ТОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2)))
	|						ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьПРЦФ
	|					КОНЕЦ
	|			ИНАЧЕ 
	|				ВЫБОР КОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2))) > СписокНМА.ОстаточнаяСтоимостьПРЦФ
	|						ТОГДА СУММА(ВЫРАЗИТЬ(СписокНМА.СуммаПР * СписокНМА.КоэффициентЦФПР КАК ЧИСЛО (15,2)))
	|						ИНАЧЕ СписокНМА.ОстаточнаяСтоимостьПРЦФ
	|					КОНЕЦ
	|		КОНЕЦ КАК СуммаВРЦФ,
	|
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.ОстаточнаяСтоимостьРегл  КАК ОстаточнаяСтоимостьРегл,
	|		СписокНМА.ОстаточнаяСтоимостьНУ    КАК ОстаточнаяСтоимостьНУ,
	|		СписокНМА.ОстаточнаяСтоимостьПР    КАК ОстаточнаяСтоимостьПР,
	|		СписокНМА.ОстаточнаяСтоимостьЦФ	   КАК ОстаточнаяСтоимостьЦФ,
	|		СписокНМА.ОстаточнаяСтоимостьНУЦФ  КАК ОстаточнаяСтоимостьНУЦФ,
	|		СписокНМА.ОстаточнаяСтоимостьПРЦФ  КАК ОстаточнаяСтоимостьПРЦФ
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СписокНМА.Организация                КАК Организация,
	|			СписокНМА.Подразделение              КАК Подразделение,
	|			СписокНМА.НематериальныйАктив        КАК НематериальныйАктив,
	|			СписокНМА.ВидОбъектаУчета            КАК ВидОбъектаУчета,
	|			СписокНМА.ГруппаФинансовогоУчета     КАК ГруппаФинансовогоУчета,
	|			СписокНМА.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|
	|			СписокНМА.СтатьяРасходовБУ           КАК СтатьяРасходов,
	|			СписокНМА.АналитикаРасходовБУ        КАК АналитикаРасходов,
	|			СписокНМА.СпособОтраженияРасходовБУ  КАК СпособОтраженияРасходов,
	|
	|			(&СуммаАмортизацииБУ) КАК СуммаБУ,
	|			(&СуммаАмортизацииНУ) КАК СуммаНУ,
	|			ВЫБОР
	|				КОГДА СписокНМА.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|						И (СписокНМА.СтоимостьРегл + СписокНМА.СтоимостьЦФ) <> 0
	|					ТОГДА ВЫРАЗИТЬ((СписокНМА.СтоимостьПР + СписокНМА.СтоимостьПРЦФ) 
	|									* (&СуммаАмортизацииБУ) 
	|									/ (СписокНМА.СтоимостьРегл + СписокНМА.СтоимостьЦФ) КАК ЧИСЛО(31,2))
	|				КОГДА СписокНМА.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив)
	|						И СписокНМА.ПервоначальнаяСтоимостьБУ <> 0
	|					ТОГДА ВЫРАЗИТЬ((СписокНМА.СтоимостьПР + СписокНМА.СтоимостьПРЦФ) 
	|									* (&СуммаАмортизацииБУ) 
	|									/ (СписокНМА.ПервоначальнаяСтоимостьБУ) КАК ЧИСЛО(31,2))
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммаПР,
	|
	|			СписокНМА.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|			СписокНМА.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|			СписокНМА.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|			СписокНМА.ПередаватьРасходыВДругуюОрганизациюБУ  КАК ПередаватьРасходыВДругуюОрганизацию,
	|			СписокНМА.ОрганизацияПолучательРасходовБУ        КАК ОрганизацияПолучательРасходов,
	|
	|			СписокНМА.СтоимостьРегл                                   КАК СтоимостьРегл,
	|			СписокНМА.СтоимостьЦФ                                     КАК СтоимостьЦФ,
	|			(СписокНМА.СтоимостьРегл   - СписокНМА.АмортизацияРегл)   КАК ОстаточнаяСтоимостьРегл,
	|			(СписокНМА.СтоимостьНУ     - СписокНМА.АмортизацияНУ)     КАК ОстаточнаяСтоимостьНУ,
	|			(СписокНМА.СтоимостьПР     - СписокНМА.АмортизацияПР)     КАК ОстаточнаяСтоимостьПР,
	|			(СписокНМА.СтоимостьЦФ     - СписокНМА.АмортизацияЦФ)     КАК ОстаточнаяСтоимостьЦФ,
	|			(СписокНМА.СтоимостьНУЦФ   - СписокНМА.АмортизацияНУЦФ)   КАК ОстаточнаяСтоимостьНУЦФ,
	|			(СписокНМА.СтоимостьПРЦФ   - СписокНМА.АмортизацияПРЦФ)   КАК ОстаточнаяСтоимостьПРЦФ
	|		ИЗ
	|			ВТ_СписокНМАСПараметрами_БУ КАК СписокНМА
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроверкаПараметровРасчета_БУ КАК ПроверкаПараметровРасчета
	|				ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокНМА.НематериальныйАктив
	|		ГДЕ
	|			ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL
	|
	|		) КАК СписокНМА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокНМА.Организация,
	|		СписокНМА.Подразделение,
	|		СписокНМА.НематериальныйАктив,
	|		СписокНМА.ВидОбъектаУчета,
	|		СписокНМА.ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности,
	|		СписокНМА.СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов,
	|		СписокНМА.СпособОтраженияРасходов,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов,
	|		СписокНМА.ОстаточнаяСтоимостьРегл,
	|		СписокНМА.ОстаточнаяСтоимостьНУ,
	|		СписокНМА.ОстаточнаяСтоимостьПР,
	|		СписокНМА.ОстаточнаяСтоимостьЦФ,
	|		СписокНМА.ОстаточнаяСтоимостьНУЦФ,
	|		СписокНМА.ОстаточнаяСтоимостьПРЦФ
	|
	|	) КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО (СпособыОтраженияРасходов.СпособОтраженияРасходов = Амортизация.СпособОтраженияРасходов)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииБУ", ТекстЗапросаСуммаАмортизацииБУ());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииНУ", ТекстЗапросаСуммаАмортизацииНУ());
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаБУ",      ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаБУ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаНУ_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаНУ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаПР_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаПР"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаВР_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаВР"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаЦФ",        ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаЦФ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаНУЦФ_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаНУЦФ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаПРЦФ_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаПРЦФ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаВРЦФ_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаВРЦФ"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизации_УУ_Предварительный_Доначисление(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходовУУ КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходовУУ КАК АналитикаРасходов,
	|	СписокНМА.СпособОтраженияРасходовУУ КАК СпособОтраженияРасходов,
	|	ВЫБОР 
	|		КОГДА (СписокНМА.ОстаточнаяСтоимость - (&СуммаАмортизацииУУ)) > СписокНМА.ЛиквидационнаяСтоимость
	|			ТОГДА &СуммаАмортизацииУУ
	|		КОГДА (СписокНМА.ОстаточнаяСтоимость - СписокНМА.ЛиквидационнаяСтоимость) > 0
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимость - СписокНМА.ЛиквидационнаяСтоимость)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУУ,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизациюУУ КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходовУУ КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|	СписокНМА.ОстаточнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимость,
	|	СписокНМА.КоэффициентУскорения КАК КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизациюУУ КАК НачислятьАмортизацию
	|ПОМЕСТИТЬ ВТ_РасчетАмортизации_УУ_Предварительный_Доначисление
	|ИЗ
	|	ВТ_СписокНМАСПараметрами_УУ КАК СписокНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроверкаПараметровРасчета_УУ КАК ПроверкаПараметровРасчета
	|		ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокНМА.НематериальныйАктив
	|ГДЕ
	|	СписокНМА.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииУУ", ТекстЗапросаСуммаАмортизацииУУ(Ложь));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизации_УУ_ДоначислениеСгруппированная(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СУММА(СписокНМА.СуммаУУ) КАК СуммаУУ
	|ПОМЕСТИТЬ ВТ_РасчетАмортизации_УУ_ДоначислениеСгруппированная
	|ИЗ
	|	ВТ_РасчетАмортизации_УУ_Доначисление КАК СписокНМА
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНМА.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизации_УУ_Предварительный(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходовУУ КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходовУУ КАК АналитикаРасходов,
	|	СписокНМА.СпособОтраженияРасходовУУ КАК СпособОтраженияРасходов,
	|	ВЫБОР 
	|		КОГДА (СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - (&СуммаАмортизацииУУ)) > СписокНМА.ЛиквидационнаяСтоимость
	|			ТОГДА &СуммаАмортизацииУУ
	|		КОГДА (СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - СписокНМА.ЛиквидационнаяСтоимость) > 0
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - СписокНМА.ЛиквидационнаяСтоимость)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУУ,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизациюУУ КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходовУУ КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|	СписокНМА.ОстаточнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимость,
	|	СписокНМА.КоэффициентУскорения КАК КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизациюУУ КАК НачислятьАмортизацию
	|ПОМЕСТИТЬ ВТ_РасчетАмортизации_УУ_Предварительный
	|ИЗ
	|	ВТ_СписокНМАСПараметрами_УУ КАК СписокНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетАмортизации_УУ_ДоначислениеСгруппированная КАК Доначисление
	|		ПО Доначисление.НематериальныйАктив = СписокНМА.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроверкаПараметровРасчета_УУ КАК ПроверкаПараметровРасчета
	|		ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокНМА.НематериальныйАктив
	|ГДЕ
	|	НЕ СписокНМА.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииУУ", ТекстЗапросаСуммаАмортизацииУУ(Истина));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаВыборкаРасчетаАмортизацииИзменений(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&НачалоМесяца КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВЫРАЗИТЬ(СписокНМА.НематериальныйАктив КАК Справочник.НематериальныеАктивы).Код КАК НематериальныйАктивКод,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокНМА.СуммаУУ КАК СуммаУУ,
	|	1 КАК Коэффициент,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации,
	|	СписокНМА.ОстаточнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимость,
	|	СписокНМА.КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию,
	|	ЛОЖЬ КАК ЭтоИзменения
	|ИЗ
	|	ВТ_РасчетАмортизации_УУ_Предварительный КАК СписокНМА
	|ГДЕ
	|	СписокНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				ВТ_СписокНМАСИзмененнымиПараметрами_УУ КАК СписокНМА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокНМА.Период,
	|	СписокНМА.Организация,
	|	СписокНМА.Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив,
	|	ВЫРАЗИТЬ(СписокНМА.НематериальныйАктив КАК Справочник.НематериальныеАктивы).Код,
	|	СписокНМА.ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходовУУ,
	|	СписокНМА.АналитикаРасходовУУ,
	|	СписокНМА.СпособОтраженияРасходовУУ,
	|	0,
	|	1,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизациюУУ,
	|	СписокНМА.ОрганизацияПолучательРасходовУУ,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации,
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(СписокНМА.Период, МЕСЯЦ )= &НачалоМесяца
	|			ТОГДА СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) 
	|		ИНАЧЕ СписокНМА.ОстаточнаяСтоимость 
	|	КОНЕЦ,
	|	СписокНМА.ЛиквидационнаяСтоимость,
	|	СписокНМА.КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизациюУУ,
	|	ИСТИНА
	|ИЗ
	|	ВТ_СписокНМАСИзмененнымиПараметрами_УУ КАК СписокНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетАмортизации_УУ_ДоначислениеСгруппированная КАК Доначисление
	|		ПО Доначисление.НематериальныйАктив = СписокНМА.НематериальныйАктив
	|ГДЕ
	|	НЕ СписокНМА.ЭтоДоначисление";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаВыборкаРасчетаАмортизацииИзменений_Доначисление(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&НачалоМесяца КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВЫРАЗИТЬ(СписокНМА.НематериальныйАктив КАК Справочник.НематериальныеАктивы).Код КАК НематериальныйАктивКод,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокНМА.СуммаУУ КАК СуммаУУ,
	|	1 КАК Коэффициент,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации,
	|	СписокНМА.ОстаточнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимость,
	|	СписокНМА.КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию,
	|	ЛОЖЬ КАК ЭтоИзменения
	|ИЗ
	|	ВТ_РасчетАмортизации_УУ_Предварительный_Доначисление КАК СписокНМА
	|ГДЕ
	|	СписокНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				ВТ_СписокНМАСИзмененнымиПараметрами_УУ КАК СписокНМА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокНМА.Период,
	|	СписокНМА.Организация,
	|	СписокНМА.Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив,
	|	ВЫРАЗИТЬ(СписокНМА.НематериальныйАктив КАК Справочник.НематериальныеАктивы).Код,
	|	СписокНМА.ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходовУУ,
	|	СписокНМА.АналитикаРасходовУУ,
	|	СписокНМА.СпособОтраженияРасходовУУ,
	|	0,
	|	1,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизациюУУ,
	|	СписокНМА.ОрганизацияПолучательРасходовУУ,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации,
	|	СписокНМА.ОстаточнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимость,
	|	СписокНМА.КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизациюУУ,
	|	ИСТИНА
	|ИЗ
	|	ВТ_СписокНМАСИзмененнымиПараметрами_УУ КАК СписокНМА
	|ГДЕ
	|	СписокНМА.ЭтоДоначисление";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизации_УУ_Доначисление(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокНМА.СуммаУУ КАК СуммаУУ,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный
	|ПОМЕСТИТЬ ВТ_АмортизацияИзменений_УУ_Доначисление
	|ИЗ
	|	&АмортизацияИзменений_УУ КАК СписокНМА
	|ГДЕ
	|	СписокНМА.ЭтоИзменения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Амортизация.ПериодРасчета,
	|	Амортизация.Организация,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияРасходов.Подразделение, Амортизация.Подразделение) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА Амортизация.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияРасходов.Подразделение, Амортизация.Подразделение) 
	|	КОНЕЦ КАК Подразделение,
	|	Амортизация.НематериальныйАктив,
	|	Амортизация.ВидОбъектаУчета,
	|	Амортизация.ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.НаправлениеДеятельности, Амортизация.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СтатьяРасходов, Амортизация.СтатьяРасходов) КАК СтатьяРасходов,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.АналитикаРасходов, Амортизация.АналитикаРасходов) КАК АналитикаРасходов,
	|	Амортизация.СпособОтраженияРасходов,
	|	ВЫБОР
	|		КОГДА Амортизация.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка)
	|			ТОГДА &РаспределениеСуммыУУ
	|		ИНАЧЕ Амортизация.СуммаУУ
	|	КОНЕЦ КАК СуммаУУ,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.ПередаватьРасходыВДругуюОрганизацию, Амортизация.ПередаватьРасходыВДругуюОрганизацию) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.ОрганизацияПолучательРасходов, Амортизация.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|	Амортизация.АмортизацияПолностьюНачислена
	|ПОМЕСТИТЬ ВТ_РасчетАмортизации_УУ_Доначисление
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.Период КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|		СписокНМА.СуммаУУ КАК СуммаУУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод + СписокНМА.РесурсВыработанныйЗаТекущийПериод >= СписокНМА.РесурсНазначенный КАК АмортизацияПолностьюНачислена
	|	ИЗ
	|		ВТ_РасчетАмортизации_УУ_Предварительный_Доначисление КАК СписокНМА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписокНМА.Период,
	|		СписокНМА.Организация,
	|		СписокНМА.Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив,
	|		СписокНМА.ВидОбъектаУчета,
	|		СписокНМА.СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов,
	|		СписокНМА.СпособОтраженияРасходов,
	|		СписокНМА.СуммаУУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод + СписокНМА.РесурсВыработанныйЗаТекущийПериод >= СписокНМА.РесурсНазначенный
	|	ИЗ
	|		ВТ_АмортизацияИзменений_УУ_Доначисление КАК СписокНМА) КАК Амортизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО (СпособыОтраженияРасходов.СпособОтраженияРасходов = Амортизация.СпособОтраженияРасходов)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеСуммыУУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаУУ"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизации_УУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокНМА.СуммаУУ КАК СуммаУУ,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный
	|ПОМЕСТИТЬ ВТ_АмортизацияИзменений_УУ
	|ИЗ
	|	&АмортизацияИзменений_УУ КАК СписокНМА
	|ГДЕ
	|	СписокНМА.ЭтоИзменения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Амортизация.ПериодРасчета,
	|	Амортизация.Организация,
	|	Амортизация.Подразделение КАК Подразделение,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияРасходов.Подразделение, Амортизация.Подразделение) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА Амортизация.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияРасходов.Подразделение, Амортизация.Подразделение) 
	|	КОНЕЦ КАК КорПодразделение,
	|	Амортизация.НематериальныйАктив,
	|	Амортизация.ВидОбъектаУчета,
	|	Амортизация.ГруппаФинансовогоУчета,
	|	Амортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.НаправлениеДеятельности, Амортизация.НаправлениеДеятельности) КАК КорНаправлениеДеятельности,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СтатьяРасходов, Амортизация.СтатьяРасходов) КАК СтатьяРасходов,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.АналитикаРасходов, Амортизация.АналитикаРасходов) КАК АналитикаРасходов,
	|	Амортизация.СпособОтраженияРасходов,
	|	ВЫБОР
	|		КОГДА Амортизация.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка)
	|			ТОГДА &РаспределениеСуммыУУ
	|		ИНАЧЕ Амортизация.СуммаУУ
	|	КОНЕЦ КАК СуммаУУ,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.ПередаватьРасходыВДругуюОрганизацию, Амортизация.ПередаватьРасходыВДругуюОрганизацию) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.ОрганизацияПолучательРасходов, Амортизация.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|	Амортизация.АмортизацияПолностьюНачислена
	|ПОМЕСТИТЬ ВТ_РасчетАмортизации_УУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.Период КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|		СписокНМА.СуммаУУ КАК СуммаУУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод + СписокНМА.РесурсВыработанныйЗаТекущийПериод >= СписокНМА.РесурсНазначенный КАК АмортизацияПолностьюНачислена
	|	ИЗ
	|		ВТ_РасчетАмортизации_УУ_Предварительный КАК СписокНМА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписокНМА.ПериодРасчета КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|		СписокНМА.СуммаУУ КАК СуммаУУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.АмортизацияПолностьюНачислена КАК АмортизацияПолностьюНачислена
	|	ИЗ
	|		ВТ_РасчетАмортизации_УУ_Доначисление КАК СписокНМА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписокНМА.Период,
	|		СписокНМА.Организация,
	|		СписокНМА.Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив,
	|		СписокНМА.ВидОбъектаУчета,
	|		СписокНМА.СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов,
	|		СписокНМА.СпособОтраженияРасходов,
	|		СписокНМА.СуммаУУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод + СписокНМА.РесурсВыработанныйЗаТекущийПериод >= СписокНМА.РесурсНазначенный
	|	ИЗ
	|		ВТ_АмортизацияИзменений_УУ КАК СписокНМА) КАК Амортизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО (СпособыОтраженияРасходов.СпособОтраженияРасходов = Амортизация.СпособОтраженияРасходов)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеСуммыУУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаУУ"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаНачисленнаяАмортизация(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета,
	|	НачисленнаяАмортизация.Организация,
	|	ЕСТЬNULL(ПакетыАмортизацииНМА.НомерПакета, 0) КАК НомерПакета,
	|	НачисленнаяАмортизация.Подразделение,
	|	НачисленнаяАмортизация.КорПодразделение,
	|	НачисленнаяАмортизация.НематериальныйАктив,
	|	НачисленнаяАмортизация.ВидОбъектаУчета,
	|	ВЫБОР 
	|		КОГДА НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|				И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыНИОКРВДругуюОрганизацию)
	|		КОГДА НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыНИОКР)
	|		КОГДА НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.АмортизацияНМАвДругуюОрганизацию)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.АмортизацияНМА)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета,
	|	НачисленнаяАмортизация.НаправлениеДеятельности,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.СтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов,
	|	СУММА(НачисленнаяАмортизация.СуммаУУ) КАК СуммаУУ,
	|	СУММА(НачисленнаяАмортизация.СуммаБУ) КАК СуммаБУ,
	|	СУММА(НачисленнаяАмортизация.СуммаНУ) КАК СуммаНУ,
	|	СУММА(НачисленнаяАмортизация.СуммаПР) КАК СуммаПР,
	|	СУММА(НачисленнаяАмортизация.СуммаВР) КАК СуммаВР,
	|	СУММА(НачисленнаяАмортизация.СуммаЦФ) КАК СуммаЦФ,
	|	СУММА(НачисленнаяАмортизация.СуммаНУЦФ) КАК СуммаНУЦФ,
	|	СУММА(НачисленнаяАмортизация.СуммаПРЦФ) КАК СуммаПРЦФ,
	|	СУММА(НачисленнаяАмортизация.СуммаВРЦФ) КАК СуммаВРЦФ,
	|	МАКСИМУМ(НачисленнаяАмортизация.АмортизацияПолностьюНачисленаБУ) КАК АмортизацияПолностьюНачисленаБУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.АмортизацияПолностьюНачисленаУУ) КАК АмортизацияПолностьюНачисленаУУ,
	|	НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов,
	|	ЛОЖЬ КАК НачислятьИзнос
	|ПОМЕСТИТЬ ВТ_НачисленнаяАмортизация
	|ИЗ
	|	(";
	
	Если ПараметрыРасчета.ИспользоватьРеглУчет Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|		РасчетАмортизации.ПериодРасчета КАК ПериодРасчета,
		|		РасчетАмортизации.Организация КАК Организация,
		|		РасчетАмортизации.Подразделение КАК Подразделение,
		|		РасчетАмортизации.КорПодразделение КАК КорПодразделение,
		|		РасчетАмортизации.НематериальныйАктив КАК НематериальныйАктив,
		|		РасчетАмортизации.ВидОбъектаУчета КАК ВидОбъектаУчета,
		|		РасчетАмортизации.ГруппаФинансовогоУчета,
		|		РасчетАмортизации.НаправлениеДеятельности,
		|		РасчетАмортизации.КорНаправлениеДеятельности,
		|		РасчетАмортизации.СтатьяРасходов КАК СтатьяРасходов,
		|		РасчетАмортизации.АналитикаРасходов КАК АналитикаРасходов,
		|		0 КАК СуммаУУ,
		|		РасчетАмортизации.СуммаБУ КАК СуммаБУ,
		|		РасчетАмортизации.СуммаНУ КАК СуммаНУ,
		|		РасчетАмортизации.СуммаПР КАК СуммаПР,
		|		РасчетАмортизации.СуммаВР КАК СуммаВР,
		|		РасчетАмортизации.СуммаЦФ КАК СуммаЦФ,
		|		РасчетАмортизации.СуммаНУЦФ КАК СуммаНУЦФ,
		|		РасчетАмортизации.СуммаПРЦФ КАК СуммаПРЦФ,
		|		РасчетАмортизации.СуммаВРЦФ КАК СуммаВРЦФ,
		|		РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
		|		РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
		|		РасчетАмортизации.АмортизацияПолностьюНачислена КАК АмортизацияПолностьюНачисленаБУ,
		|		ЛОЖЬ КАК АмортизацияПолностьюНачисленаУУ
		|	ИЗ
		|		ВТ_РасчетАмортизации_БУ КАК РасчетАмортизации
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"	ВЫБРАТЬ
	|		РасчетАмортизации.ПериодРасчета КАК ПериодРасчета,
	|		РасчетАмортизации.Организация КАК Организация,
	|		РасчетАмортизации.Подразделение КАК Подразделение,
	|		РасчетАмортизации.КорПодразделение КАК КорПодразделение,
	|		РасчетАмортизации.НематериальныйАктив КАК НематериальныйАктив,
	|		РасчетАмортизации.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		РасчетАмортизации.ГруппаФинансовогоУчета,
	|		РасчетАмортизации.НаправлениеДеятельности,
	|		РасчетАмортизации.КорНаправлениеДеятельности,
	|		РасчетАмортизации.СтатьяРасходов КАК СтатьяРасходов,
	|		РасчетАмортизации.АналитикаРасходов КАК АналитикаРасходов,
	|		РасчетАмортизации.СуммаУУ КАК СуммаУУ,
	|		0 КАК СуммаБУ,
	|		0 КАК СуммаНУ,
	|		0 КАК СуммаПР,
	|		0 КАК СуммаВР,
	|		0 КАК СуммаЦФ,
	|		0 КАК СуммаНУЦФ,
	|		0 КАК СуммаПРЦФ,
	|		0 КАК СуммаВРЦФ,
	|		РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		ЛОЖЬ КАК АмортизацияПолностьюНачисленаБУ,
	|		РасчетАмортизации.АмортизацияПолностьюНачислена КАК АмортизацияПолностьюНачисленаУУ
	|	ИЗ
	|		ВТ_РасчетАмортизации_УУ КАК РасчетАмортизации
	|
	|	) КАК НачисленнаяАмортизация
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизацииНМА
	|		ПО ПакетыАмортизацииНМА.Организация = НачисленнаяАмортизация.Организация
	|			И ПакетыАмортизацииНМА.НематериальныйАктив = НачисленнаяАмортизация.НематериальныйАктив
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленнаяАмортизация.ПериодРасчета,
	|	НачисленнаяАмортизация.Организация,
	|	ЕСТЬNULL(ПакетыАмортизацииНМА.НомерПакета, 0),
	|	НачисленнаяАмортизация.Подразделение,
	|	НачисленнаяАмортизация.КорПодразделение,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета,
	|	НачисленнаяАмортизация.НаправлениеДеятельности,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.НематериальныйАктив,
	|	НачисленнаяАмортизация.ВидОбъектаУчета,
	|	НачисленнаяАмортизация.СтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов,
	|	НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов,
	|	ВЫБОР 
	|		КОГДА НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.АмортизацияНМАвДругуюОрганизацию)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.АмортизацияНМА)
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(НачисленнаяАмортизация.СуммаУУ) <> 0
	|		ИЛИ СУММА(НачисленнаяАмортизация.СуммаБУ) <> 0
	|		ИЛИ СУММА(НачисленнаяАмортизация.СуммаНУ) <> 0
	|		ИЛИ СУММА(НачисленнаяАмортизация.СуммаПР) <> 0
	|		ИЛИ СУММА(НачисленнаяАмортизация.СуммаВР) <> 0
	|		ИЛИ СУММА(НачисленнаяАмортизация.СуммаЦФ) <> 0
	|		ИЛИ СУММА(НачисленнаяАмортизация.СуммаНУЦФ) <> 0
	|		ИЛИ СУММА(НачисленнаяАмортизация.СуммаПРЦФ) <> 0
	|		ИЛИ СУММА(НачисленнаяАмортизация.СуммаВРЦФ) <> 0";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаКоличествоОбработанныхДанных(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса =  
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(НачисленнаяАмортизация.НематериальныйАктив), 0) КАК КоличествоДанных
	|ИЗ
	|	(";
	
	Если ПараметрыРасчета.ИспользоватьРеглУчет Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|		РасчетАмортизации.НематериальныйАктив КАК НематериальныйАктив
		|	ИЗ
		|		ВТ_РасчетАмортизации_БУ КАК РасчетАмортизации
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|		РасчетАмортизации.НематериальныйАктив КАК НематериальныйАктив
	|	ИЗ
	|		ВТ_РасчетАмортизации_УУ КАК РасчетАмортизации
	|
	|	) КАК НачисленнаяАмортизация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Функция ТекстЗапросаСуммаАмортизацииУУ(УчестьДоначисление)
	
	ТекстЗапроса =
	"ВЫБОР 
	|	КОГДА НЕ СписокНМА.НачислятьАмортизациюУУ ИЛИ (СписокНМА.ОстаточнаяСтоимость - &СуммаДоначисления) <= 0 ТОГДА
	|		0
	|	КОГДА &ПорядокУчетаВНАВУпрУчете = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАВУпрУчете.ПоСтандартамМУ)
	|		ТОГДА
	|			ВЫБОР
	|				КОГДА (СписокНМА.РесурсВыработанныйЗаПрошлыйПериод + СписокНМА.РесурсВыработанныйЗаТекущийПериод) >= СписокНМА.РесурсНазначенный ТОГДА
	|					СписокНМА.ОстаточнаяСтоимость - &СуммаДоначисления - СписокНМА.ЛиквидационнаяСтоимость
	|
				// Линейный или УменьшаемогоОстатка
	|				КОГДА СписокНМА.МетодНачисленияАмортизации В (
	|							ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.Линейный),
	|							ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)) 
	|						ИЛИ (СписокНМА.РесурсНазначенный
	|								- СписокНМА.РесурсВыработанныйЗаПрошлыйПериод
	|								- СписокНМА.РесурсВыработанныйЗаТекущийПериод) <= 12 
	|							И СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка) ТОГДА
	|					ВЫБОР 
	|						КОГДА СписокНМА.ЭтоДоначисление
	|							ТОГДА ВЫРАЗИТЬ((СписокНМА.ОстаточнаяСтоимость - &СуммаДоначисления)
	|											* ((СписокНМА.РесурсВыработанныйЗаТекущийПериод)/(СписокНМА.РесурсНазначенный - СписокНМА.РесурсВыработанныйЗаПрошлыйПериод)) КАК ЧИСЛО(31,2)) 
	|						ИНАЧЕ ВЫРАЗИТЬ((СписокНМА.ОстаточнаяСтоимость - &СуммаДоначисления - СписокНМА.ЛиквидационнаяСтоимость) 
	|											* ((СписокНМА.РесурсВыработанныйЗаТекущийПериод)/(СписокНМА.РесурсНазначенный - СписокНМА.РесурсВыработанныйЗаПрошлыйПериод)) КАК ЧИСЛО(31,2))
	|					КОНЕЦ
				// УменьшаемогоОстатка
	|				КОГДА СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка) ТОГДА
	|   
	|					ВЫРАЗИТЬ((СписокНМА.ОстаточнаяСтоимость - &СуммаДоначисления)
	|						* СписокНМА.КоэффициентУскорения
	|						* СписокНМА.РесурсВыработанныйЗаТекущийПериод
	|						/ (СписокНМА.РесурсНазначенный 
	|								- СписокНМА.КоэффициентУскорения *(СписокНМА.РесурсВыработанныйЗаПрошлыйПериод - СписокНМА.ОтработанныхМесяцевПолныхЛет)) КАК ЧИСЛО(31,2))
	|			КОНЕЦ
	|
	|	КОГДА &ПорядокУчетаВНАВУпрУчете = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАВУпрУчете.ПоСтандартамРегл)
	|		ТОГДА
	|			ВЫБОР 
				// Линейный
	|				КОГДА СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.Линейный) ТОГДА
	|					ВЫРАЗИТЬ(СписокНМА.ПервоначальнаяСтоимость / СписокНМА.РесурсНазначенный КАК ЧИСЛО(31,2))
	|   
				// ПропорциональноОбъемуПродукции
	|				КОГДА СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции) ТОГДА
	|					ВЫБОР 
	|						КОГДА СписокНМА.РесурсНазначенный <> 0 ТОГДА
	|							ВЫРАЗИТЬ(СписокНМА.ПервоначальнаяСтоимость * СписокНМА.РесурсВыработанныйЗаТекущийПериод / СписокНМА.РесурсНазначенный КАК ЧИСЛО(31,2))
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|
				// УменьшаемогоОстатка
	|				КОГДА СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка) ТОГДА
	|					ВЫБОР 
	|						КОГДА (СписокНМА.РесурсНазначенный - СписокНМА.ФактическийСрокИспользования + 1) > 0 ТОГДА
	|							ВЫРАЗИТЬ((СписокНМА.Стоимость - СписокНМА.Амортизация)
	|										* СписокНМА.КоэффициентУскорения / (СписокНМА.РесурсНазначенный - СписокНМА.ФактическийСрокИспользования + 1) КАК ЧИСЛО(31,2))
	|						ИНАЧЕ 0
	|				
	|					КОНЕЦ
	|			КОНЕЦ
	|КОНЕЦ";				
	
	Если УчестьДоначисление Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаДоначисления", "ЕСТЬNULL(Доначисление.СуммаУУ, 0)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаДоначисления", "0");
	КонецЕсли; 
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСуммаАмортизацииБУ()
	
	ТекстЗапроса =
	"ВЫБОР 
	|	КОГДА НЕ СписокНМА.НачислятьАмортизациюБУ ТОГДА
	|		0
	// Линейный
	|	КОГДА СписокНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.Линейный) ТОГДА
	|		ВЫРАЗИТЬ(СписокНМА.ПервоначальнаяСтоимостьБУ / СписокНМА.СрокПолезногоИспользованияБУ КАК ЧИСЛО(31,2))
	|   
	// ПропорциональноОбъемуПродукции
	|	КОГДА СписокНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции) ТОГДА
	|		ВЫБОР 
	|			КОГДА СписокНМА.ОбъемНаработки <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СписокНМА.ПервоначальнаяСтоимостьБУ * СписокНМА.ОбъемВыработки / СписокНМА.ОбъемНаработки КАК ЧИСЛО(31,2))
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|
	// УменьшаемогоОстатка
	|	КОГДА СписокНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка) ТОГДА
	|		ВЫБОР 
	|			КОГДА (СписокНМА.СрокПолезногоИспользованияБУ - СписокНМА.ФактическийСрокИспользования + 1) > 0 ТОГДА
	|				ВЫРАЗИТЬ((СписокНМА.СтоимостьРегл + СписокНМА.СтоимостьЦФ - СписокНМА.АмортизацияРегл - СписокНМА.АмортизацияЦФ) 
	|							* СписокНМА.КоэффициентБУ / (СписокНМА.СрокПолезногоИспользованияБУ - СписокНМА.ФактическийСрокИспользования + 1) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ 0
	|				
	|		КОНЕЦ
	|КОНЕЦ";				
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСуммаАмортизацииНУ()

	ТекстЗапроса =
	"ВЫБОР 
	|	КОГДА НЕ СписокНМА.НачислятьАмортизациюНУ ТОГДА
	|		0
	|	КОГДА СписокНМА.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный) ТОГДА
	|		ВЫБОР 
	|			КОГДА (СписокНМА.СрокПолезногоИспользованияНУ - СписокНМА.ФактическийСрокПриПереходеКЛинейномуМетоду) > 0 ТОГДА
	|				ВЫРАЗИТЬ((СписокНМА.СтоимостьДляВычисленияАмортизацииНУ - СписокНМА.АмортизацияПриПереходеКЛинейномуМетоду)
	|					 		/ (СписокНМА.СрокПолезногоИспользованияНУ - СписокНМА.ФактическийСрокПриПереходеКЛинейномуМетоду) 
	|							* СписокНМА.СпециальныйКоэффициентНУ КАК ЧИСЛО(31,2))
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ
	|	КОГДА СписокНМА.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный) ТОГДА
	|		ВЫРАЗИТЬ((СписокНМА.СтоимостьНУНачальныйОстаток - СписокНМА.АмортизацияНУНачальныйОстаток)
	|					* СписокНМА.НормаАмортизации / 100
	|					* СписокНМА.СпециальныйКоэффициентНУ КАК ЧИСЛО(31,2))
	|КОНЕЦ";				
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
