
&НаКлиенте
Процедура Изменить(Команда)
    
    СтрукутраКурса = Новый Структура();
    СтрукутраКурса.Вставить("ДатаКурса",     ДатаКурса);
    СтрукутраКурса.Вставить("КурсДокумента", КурсДокумента);
    
    ОповеститьОВыборе(СтрукутраКурса);
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("ДатаКурса") Тогда
        ДатаКурса = Параметры.ДатаКурса;
    КонецЕсли;
    
    Если Параметры.Свойство("КурсДокумента") Тогда
        КурсДокумента = Параметры.КурсДокумента;
    КонецЕсли;
    
    Если Параметры.Свойство("ВалютаВзаиморасчетов") Тогда
        ВалютаВзаиморасчетов = Параметры.ВалютаВзаиморасчетов;
    КонецЕсли;
        
КонецПроцедуры

&НаСервере
Процедура ДатаКурсаПриИзмененииНаСервере()
    
    СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаВзаиморасчетов, ДатаКурса);
    
    КурсДокумента = СтруктураКурса.Курс;
    
КонецПроцедуры

&НаКлиенте
Процедура ДатаКурсаПриИзменении(Элемент)
    
    ДатаКурсаПриИзмененииНаСервере();
    
КонецПроцедуры
