
Процедура СинхронизируемТоварныеОграничения() Экспорт 
	Запрос=Новый Запрос;
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ТоварныеОграничения.Склад КАК Склад,
	             |	ТоварныеОграничения.Номенклатура КАК Номенклатура,
	             |	ТоварныеОграничения.МинимальноеКоличествоЗапаса КАК МинимальноеКоличествоЗапаса,
	             |	ТоварныеОграничения.МаксимальноеКоличествоЗапаса КАК МаксимальноеКоличествоЗапаса,
	             |	пкТоварныеОграничения.Склад КАК Склад1,
	             |	пкТоварныеОграничения.Номенклатура КАК Номенклатура1,
	             |	пкТоварныеОграничения.МинимальноеКоличествоЗапаса КАК МинимальноеКоличествоЗапаса1,
	             |	пкТоварныеОграничения.МаксимальноеКоличествоЗапаса КАК МаксимальноеКоличествоЗапаса1
	             |ИЗ
	             |	РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
	             |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.пкТоварныеОграничения КАК пкТоварныеОграничения
	             |		ПО ТоварныеОграничения.Склад = пкТоварныеОграничения.Склад
	             |			И ТоварныеОграничения.Номенклатура = пкТоварныеОграничения.Номенклатура
	             |			И (ТоварныеОграничения.Характеристика = &ХарактеристикаПустая)
	             |			И (ТоварныеОграничения.Группировка = &ГруппировкаПустая)
	             |ГДЕ
	             |	(ТоварныеОграничения.Номенклатура ЕСТЬ NULL
	             |			ИЛИ пкТоварныеОграничения.Номенклатура ЕСТЬ NULL
	             |			ИЛИ НЕ ТоварныеОграничения.МинимальноеКоличествоЗапаса = пкТоварныеОграничения.МинимальноеКоличествоЗапаса
	             |			ИЛИ НЕ ТоварныеОграничения.МаксимальноеКоличествоЗапаса = пкТоварныеОграничения.МаксимальноеКоличествоЗапаса)
	             |	И ТоварныеОграничения.Характеристика = &ХарактеристикаПустая
	             |	И ТоварныеОграничения.Группировка = &ГруппировкаПустая";
				 
	Запрос.УстановитьПараметр("ХарактеристикаПустая", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ГруппировкаПустая", Справочники.ГруппировкиТоварныхОграничений.ПустаяСсылка());
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Номенклатура = NULL и ЗначениеЗаполнено(Выборка.Номенклатура1) тогда	
			МенеджерЗаписи=РегистрыСведений.пкТоварныеОграничения.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Номенклатура=Выборка.Номенклатура1;
			МенеджерЗаписи.Склад=Выборка.Склад1;
			МенеджерЗаписи.Прочитать();
		    МенеджерЗаписи.Удалить();
		Иначе	
			МенеджерЗаписи=РегистрыСведений.пкТоварныеОграничения.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Номенклатура=Выборка.Номенклатура;
			МенеджерЗаписи.Склад=Выборка.Склад;
			МенеджерЗаписи.МинимальноеКоличествоЗапаса=Выборка.МинимальноеКоличествоЗапаса;
			МенеджерЗаписи.МаксимальноеКоличествоЗапаса=Выборка.МаксимальноеКоличествоЗапаса;
		    МенеджерЗаписи.Записать();
		КонецЕсли;	
	КонецЦикла; 			 
КонецПроцедуры	
	