&НаСервере
Функция ОбъектОбработки()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

&НаКлиенте
Процедура НайтиИски(Команда)
	НайтиИскиНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиИскиНаСервере()
	ЭтаОбработка=ОбъектОбработки();
	ЭтаОбработка.НайтиИскиДляПроверки();
	Объект.ДанныеОбработки.Очистить();
	Объект.ДанныеОбработки.Загрузить(ЭтаОбработка.ДанныеОбработки.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачиПроверкиКлиент(Команда)
	СоздатьЗадачиПроверкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачиПроверкиНаСервере()
	ЭтаОбработка=ОбъектОбработки();
	ЭтаОбработка.СоздатьЗадачиПроверки();
	Объект.ДанныеОбработки.Очистить();
	Объект.ДанныеОбработки.Загрузить(ЭтаОбработка.ДанныеОбработки.Выгрузить());
КонецПроцедуры


