
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не (Константы.уатИспользоватьOmnicomm.Получить()
			Или Константы.уатИспользоватьАвтотрекер.Получить()
			Или Константы.уатИспользоватьWialon.Получить()
			Или Константы.уатИспользоватьСКАУТ.Получить()
			Или Константы.уатИспользоватьАвтоГРАФ.Получить()) Тогда
		ТекстОшибки = "Ни одной из систем GPS мониторинга не включено.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;
КонецПроцедуры
