#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ НЕ УТ
#Область ПрограммныйИнтерфейс
//++ НЕ УТКА

// Определяет источники уточнения счета, доступные в регистре и их свойства.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиУточненияСчета().
//
// Параметры:
//  СвойстваИсточника - Строка - "ИмяПоля" - имя атрибута регистра накопления, из которого планируется получать источник
//                               уточнения счета.
//
// Возвращаемое значение:
//  Соответствие - Ключ - название источника уточнения счета. 
//                 Значение - структура свойств источника уточнения счета.
//
Функция ИсточникиУточненияСчета(СвойстваИсточника) Экспорт
	
	ИсточникиУточненияСчета = Новый Соответствие;
	
	ИсточникиУточненияСчета.Вставить(Перечисления.ТипыИсточниковУточненияСчета.ГруппаФинансовогоУчетаНоменклатуры,
		Новый Структура(СвойстваИсточника, "ГФУНоменклатуры"));
		
	ИсточникиУточненияСчета.Вставить(Перечисления.ТипыИсточниковУточненияСчета.ГруппаФинансовогоУчетаРасчетов,
		Новый Структура(СвойстваИсточника, "ГФУРасчетов"));
		
	Возврат ИсточникиУточненияСчета;
	
КонецФункции

// Определяет источники подразделений регистра и их свойства.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиПодразделений().
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя источника. 
//                 Значение - структура свойств источника. 
//
Функция ИсточникиПодразделений() Экспорт

	ИсточникиПодразделений = Новый Соответствие;
	
	ИсточникиПодразделений.Вставить(Перечисления.ИсточникиПодразделенийАналитическихРегистров.ХозяйственнаяОперация, "Подразделение");
	ИсточникиПодразделений.Вставить(Перечисления.ИсточникиПодразделенийАналитическихРегистров.АналитикаУчетаНоменклатуры, "СкладПодразделение");
	ИсточникиПодразделений.Вставить(Перечисления.ИсточникиПодразделенийАналитическихРегистров.Заказ, "ЗаказПодразделение");

	Возврат ИсточникиПодразделений;

КонецФункции

// Определяет источники направлений регистра и их свойства.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиНаправлений().
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя источника. 
//                 Значение - структура свойств источника. 
//
Функция ИсточникиНаправлений() Экспорт

	Результат = Новый Соответствие;
	
	ИсточникиНаправлений = Перечисления.ИсточникиНаправленийДеятельностиАналитическихРегистров;
	Результат.Вставить(ИсточникиНаправлений.НаправлениеДеятельностиКонтрагента, "НаправлениеДеятельностиКонтрагента");
	Результат.Вставить(ИсточникиНаправлений.НаправлениеДеятельностиНоменклатуры, "НаправлениеДеятельностиНоменклатуры");

	Возврат Результат;

КонецФункции

// Определяет источники заполнения субконто.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиСубконто().
//
// Возвращаемое значение:
//  Массив - массив атрибутов регистра.
//
Функция ИсточникиСубконто() Экспорт

	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить("Номенклатура");
	МассивСубконто.Добавить("Характеристика");
	МассивСубконто.Добавить("Склад");
	МассивСубконто.Добавить("ТипЗапасов");
	МассивСубконто.Добавить("ВидЗапасов");
	МассивСубконто.Добавить("Партнер");
	МассивСубконто.Добавить("Контрагент");
	МассивСубконто.Добавить("Поставщик");
	МассивСубконто.Добавить("Соглашение");
	МассивСубконто.Добавить("Договор");
	МассивСубконто.Добавить("ЗаказКлиента");
	МассивСубконто.Добавить("ГФУНоменклатуры");
	МассивСубконто.Добавить("ТипНоменклатуры");

	Возврат Новый Структура("СубконтоДт, СубконтоКт", МассивСубконто, МассивСубконто);
	
КонецФункции

// Определяет показатели в валюте регистра.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ПоказателиВВалюте().
//
// Параметры:
//  СвойстваПоказателей - Строка - "ИсточникВалюты" - источник валюты для показателя регистра.
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя показателя.
//                 Значение - структура свойств показателя.
//
Функция ПоказателиВВалюте(СвойстваПоказателей) Экспорт

	ПоказателиВВалюте = Новый Соответствие;
	
	ПоказателиВВалюте.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаВВалютеВзаиморасчетов, Новый Структура(СвойстваПоказателей, "ВалютаВзаиморасчетов"));
	ПоказателиВВалюте.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаВВалютеДокумента, Новый Структура(СвойстваПоказателей, "ВалютаДокумента"));
	
	Возврат ПоказателиВВалюте;

КонецФункции

// Определяет документы отражаемые в международном учете.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ДокументыКОтражениюВМФУ().
//
// Возвращаемое значение:
//  Массив - массив регистраторов регистра отражаемых в международном учете.
//
Функция ДокументыКОтражениюВМеждународномУчете() Экспорт

	ДокументыКОтражению = Новый Массив;
	ДокументыКОтражению.Добавить("АктВыполненныхРабот");
	ДокументыКОтражению.Добавить("ВозвратТоваровМеждуОрганизациями");
	ДокументыКОтражению.Добавить("ВозвратТоваровОтКлиента");
	ДокументыКОтражению.Добавить("КорректировкаРеализации");
	ДокументыКОтражению.Добавить("ОтчетДавальцу");
	ДокументыКОтражению.Добавить("ОтчетКомиссионера");
	ДокументыКОтражению.Добавить("ОтчетКомитенту");
	ДокументыКОтражению.Добавить("ОтчетОРозничныхПродажах");
	ДокументыКОтражению.Добавить("ОтчетПоКомиссииМеждуОрганизациями");
	ДокументыКОтражению.Добавить("ПередачаТоваровМеждуОрганизациями");
	ДокументыКОтражению.Добавить("РеализацияТоваровУслуг");
	
	Возврат ДокументыКОтражению;

КонецФункции
//-- НЕ УТКА

// Определяет показатели регистра.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.Показатели().
//
// Параметры:
//  Свойства - Структура - содержащая ключи СвойстваПоказателей, СвойстваРесурсов.
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя показателя.
//                 Значение - структура свойств показателя.
//
Функция Показатели(Свойства) Экспорт

	Показатели = Новый Соответствие;
	
	СвойстваПоказателей = Свойства.СвойстваПоказателей;
	СвойстваРесурсов = Свойства.СвойстваРесурсов;
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаВыручки", "ВалютаУпр"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаВыручкиСНДСРегл", "ВалютаРегл"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаВВалютеВзаиморасчетов", "ВалютаВзаиморасчетов"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаВВалютеДокумента", "ВалютаДокумента"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.Сумма, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаВыручкиБезНДС", "ВалютаУпр"));
    МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаВыручкиРегл", "ВалютаРегл"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаБезНДСВВалютеВзаиморасчетов", "ВалютаВзаиморасчетов"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаБезНДСВВалютеДокумента", "ВалютаДокумента"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаБезНДС, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаНДС", "ВалютаУпр"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаНДСРегл", "ВалютаРегл"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаНДСВВалютеВзаиморасчетов", "ВалютаВзаиморасчетов"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаНДСВВалютеДокумента", "ВалютаДокумента"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаНДС, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СебестоимостьУпр", "ВалютаУпр"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СебестоимостьРегл", "ВалютаРегл"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.Себестоимость, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СтоимостьБезНДС", "ВалютаУпр"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СебестоимостьБезНДС, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СебестоимостьРегл", "ВалютаРегл"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СебестоимостьРегл, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "ДопРасходыУпр", "ВалютаУпр"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "ДопРасходыРегл", "ВалютаРегл"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаДопРасходов, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "ДопРасходыБезНДС", "ВалютаУпр"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаДопРасходовБезНДС, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаНДСДополнительныхРасходов", "ВалютаУпр"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаНДСДопРасходов, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	Возврат Показатели;
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Т1 
	|	ПО Т.АналитикаУчетаПоПартнерам = Т1.КлючАналитики
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т1.Организация)
	|	И ЗначениеРазрешено(Т1.Партнер)
	|	И ЗначениеРазрешено(Т.Подразделение)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления УТ 11.4.1.
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.ВыручкаИСебестоимостьПродаж";
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОбновлению.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.Регистратор КАК Ссылка
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = ДанныеРегистра.АналитикаУчетаНоменклатуры
	|
	|	ГДЕ
	|		Ключи.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		И ДанныеРегистра.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.Регистратор КАК Ссылка
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДанныеРегистра
	|
	|	ГДЕ
	|		ДанныеРегистра.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.Регистратор КАК Ссылка
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДанныеРегистра
	|
	|	ГДЕ
	|		ДанныеРегистра.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВозвратМеждуОрганизациями.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратМеждуОрганизациями
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выручка
	|		ПО ВозвратМеждуОрганизациями.Ссылка = Выручка.Регистратор
	|	ГДЕ
	|		ВозвратМеждуОрганизациями.Договор <> Выручка.Договор
	|		И НЕ ВозвратМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВозвратМеждуОрганизациями.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратМеждуОрганизациями
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выручка
	|		ПО ВозвратМеждуОрганизациями.Ссылка = Выручка.Регистратор
	|	ГДЕ
	|		ВозвратМеждуОрганизациями.ДоговорПродажи <> Выручка.Договор
	|		И ВозвратМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПередачаМеждуОрганизациями.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаМеждуОрганизациями
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выручка
	|		ПО ПередачаМеждуОрганизациями.Ссылка = Выручка.Регистратор
	|	ГДЕ
	|		ПередачаМеждуОрганизациями.Договор <> Выручка.Договор
	|		И НЕ ПередачаМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПередачаМеждуОрганизациями.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаМеждуОрганизациями
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выручка
	|		ПО ПередачаМеждуОрганизациями.Ссылка = Выручка.Регистратор
	|	ГДЕ
	|		ПередачаМеждуОрганизациями.ДоговорПродажи <> Выручка.Договор
	|		И ПередачаМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ОтчетМеждуОрганизациями.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ОтчетМеждуОрганизациями
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выручка
	|		ПО ОтчетМеждуОрганизациями.Ссылка = Выручка.Регистратор
	|	ГДЕ
	|		ОтчетМеждуОрганизациями.Договор <> Выручка.Договор
	|		И НЕ ОтчетМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ОтчетМеждуОрганизациями.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ОтчетМеждуОрганизациями
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выручка
	|		ПО ОтчетМеждуОрганизациями.Ссылка = Выручка.Регистратор
	|	ГДЕ
	|		ОтчетМеждуОрганизациями.ДоговорПродажи <> Выручка.Договор
	|		И ОтчетМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|
	|	) КАК КОбновлению
	|");
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"), ДополнительныеПараметры);
КонецПроцедуры

// Обработчик обновления УТ 11.4.1.
// Очищаются виды запасов для работ и продукции давальца,
// заполняется измерение договор для документов интеркампани.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ПолноеИмяРегистра = "РегистрНакопления.ВыручкаИСебестоимостьПродаж";
	МетаданныеРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	РезультатыСозданияВТВозвраты = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуЗаблокированныхДляЧтенияИИзмененияДанных(Параметры.Очередь,
		"Документ.ВозвратТоваровМеждуОрганизациями",
		МенеджерВременныхТаблиц);
		
	РезультатыСозданияВТПередачи = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуЗаблокированныхДляЧтенияИИзмененияДанных(Параметры.Очередь,
		"Документ.ПередачаТоваровМеждуОрганизациями",
		МенеджерВременныхТаблиц);
		
	РезультатыСозданияВТОтчеты = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуЗаблокированныхДляЧтенияИИзмененияДанных(Параметры.Очередь,
		"Документ.ОтчетПоКомиссииМеждуОрганизациями",
		МенеджерВременныхТаблиц);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Движения.Регистратор                КАК Регистратор,
	|	Движения.Период                     КАК Период,
	|	Движения.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Движения.ЗаказКлиента               КАК ЗаказКлиента,
	|	Движения.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	Движения.Подразделение              КАК Подразделение,
	|	Движения.ТипЗапасов                 КАК ТипЗапасов,
	|	ВЫБОР КОГДА Движения.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		ИНАЧЕ Движения.ВидЗапасов
	|	КОНЕЦ                               КАК ВидЗапасов,
	|	(ВЫБОР
	|		КОГДА Движения.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|			ТОГДА Движения.РазделУчета
	|		КОГДА Движения.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА Движения.АналитикаУчетаНоменклатуры.Склад.ЦеховаяКладовая
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА Движения.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|		КОГДА Движения.АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.Партнеры
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА Движения.АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.Организации
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА Движения.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		 И Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА Движения.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		 И Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	//++ НЕ УТКА
	|		КОГДА Движения.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		 И Движения.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	//-- НЕ УТКА
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КОНЕЦ) КАК РазделУчета,
	|	Движения.Партия                     КАК Партия,
	|	Движения.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|	Движения.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	Движения.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|	Движения.Менеджер                   КАК Менеджер,
	|	Движения.Склад                      КАК Склад,
	|	Движения.Соглашение                 КАК Соглашение,
	|	ВЫБОР 
	|		КОГДА Движения.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|			ТОГДА ВЫБОР КОГДА ВозвратМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|				ТОГДА ВозвратМеждуОрганизациями.ДоговорПродажи
	|				ИНАЧЕ ВозвратМеждуОрганизациями.Договор
	|		КОНЕЦ
	|		КОГДА Движения.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	|			ТОГДА ВЫБОР КОГДА ПередачаМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|				ТОГДА ПередачаМеждуОрганизациями.ДоговорПродажи
	|				ИНАЧЕ ПередачаМеждуОрганизациями.Договор
	|		КОНЕЦ
	|		КОГДА Движения.Регистратор ССЫЛКА Документ.ОтчетПоКомиссииМеждуОрганизациями
	|			ТОГДА ВЫБОР КОГДА ОтчетМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|				ТОГДА ОтчетМеждуОрганизациями.ДоговорПродажи
	|				ИНАЧЕ ОтчетМеждуОрганизациями.Договор
	|		КОНЕЦ
	|		ИНАЧЕ Движения.Договор
	|	КОНЕЦ                               КАК Договор,
	|	Движения.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Движения.АналитикаУчетаНаборов      КАК АналитикаУчетаНаборов,
	|	Движения.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Движения.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	// Ресурсы
	|	Движения.Количество                        КАК Количество,
	|	Движения.СуммаВыручки                      КАК СуммаВыручки,
	|	Движения.СуммаВыручкиБезНДС                КАК СуммаВыручкиБезНДС,
	|	Движения.Стоимость                     	   КАК Стоимость,
	|	Движения.СтоимостьБезНДС               	   КАК СтоимостьБезНДС,
	|	Движения.ДопРасходы       				   КАК ДопРасходы,
	|	Движения.ДопРасходыБезНДС 				   КАК ДопРасходыБезНДС,
	|	Движения.СтоимостьУпр       			   КАК СтоимостьУпр,
	|	Движения.СтоимостьРегл                 	   КАК СтоимостьРегл,
	|	Движения.СтоимостьЗабалансовая             КАК СтоимостьЗабалансовая,
	|	Движения.СтоимостьЗабалансоваяРегл         КАК СтоимостьЗабалансоваяРегл,
	|	Движения.СуммаВыручкиРегл                  КАК СуммаВыручкиРегл,
	|	Движения.ДопРасходыУпр                     КАК ДопРасходыУпр,
	|	Движения.ДопРасходыРегл                    КАК ДопРасходыРегл,
	|	Движения.ПостатейныеПостоянныеСНДС         КАК ПостатейныеПостоянныеСНДС,
	|	Движения.ПостатейныеПостоянныеБезНДС       КАК ПостатейныеПостоянныеБезНДС,
	|	Движения.ПостатейныеПостоянныеУпр          КАК ПостатейныеПостоянныеУпр,
	|	Движения.ПостатейныеПостоянныеРегл         КАК ПостатейныеПостоянныеРегл,
	|	Движения.Трудозатраты                      КАК Трудозатраты,
	|	Движения.ТрудозатратыУпр                   КАК ТрудозатратыУпр,
	|	Движения.ТрудозатратыРегл                  КАК ТрудозатратыРегл,
	|	Движения.ПостатейныеПеременныеСНДС         КАК ПостатейныеПеременныеСНДС,
	|	Движения.ПостатейныеПеременныеБезНДС       КАК ПостатейныеПеременныеБезНДС,
	|	Движения.ПостатейныеПеременныеУпр          КАК ПостатейныеПеременныеУпр,
	|	Движения.ПостатейныеПеременныеРегл         КАК ПостатейныеПеременныеРегл,
	|	Движения.ПостояннаяРазница                 КАК ПостояннаяРазница,
	|	Движения.ВременнаяРазница                  КАК ВременнаяРазница,
	|	Движения.СуммаВыручкиСНДСРегл              КАК СуммаВыручкиСНДСРегл,
	|	Движения.СуммаРучнойСкидки                 КАК СуммаРучнойСкидки,
	|	Движения.СуммаАвтоматическойСкидки         КАК СуммаАвтоматическойСкидки,
	// Реквизиты
	|	Движения.НалогообложениеНДС                КАК НалогообложениеНДС,
	|	Движения.ВалютаВзаиморасчетов              КАК ВалютаВзаиморасчетов,
	|	Движения.СуммаВВалютеВзаиморасчетов        КАК СуммаВВалютеВзаиморасчетов,
	|	Движения.СуммаБезНДСВВалютеВзаиморасчетов  КАК СуммаБезНДСВВалютеВзаиморасчетов,
	|	Движения.ВалютаДокумента                   КАК ВалютаДокумента,
	|	Движения.СуммаВВалютеДокумента             КАК СуммаВВалютеДокумента,
	|	Движения.СуммаБезНДСВВалютеДокумента       КАК СуммаБезНДСВВалютеДокумента,
	|	Движения.ИсточникГФУНоменклатуры           КАК ИсточникГФУНоменклатуры,
	|	Движения.ИсточникГФУРасчетов               КАК ИсточникГФУРасчетов,
	|	Движения.ДокументДвижения                  КАК ДокументДвижения,
	|	Движения.РасчетСебестоимости               КАК РасчетСебестоимости,
	|	Движения.РасчетПартий                      КАК РасчетПартий,
	|	Движения.РасчетНеЗавершен                  КАК РасчетНеЗавершен
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Движения
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратМеждуОрганизациями
	|		ПО Движения.Регистратор = ВозвратМеждуОрганизациями.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаМеждуОрганизациями
	|		ПО Движения.Регистратор = ПередачаМеждуОрганизациями.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ОтчетМеждуОрганизациями
	|		ПО Движения.Регистратор = ОтчетМеждуОрганизациями.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ #ИмяВТЗаблокированныхРегистраторовВозврата КАК ЗаблокированныеРегистраторыВозврата
	|		ПО (ЗаблокированныеРегистраторыВозврата.Ссылка = Движения.Регистратор)
	|	ЛЕВОЕ СОЕДИНЕНИЕ #ИмяВТЗаблокированныхРегистраторовПередачи КАК ЗаблокированныеРегистраторыПередачи
	|		ПО (ЗаблокированныеРегистраторыПередачи.Ссылка = Движения.Регистратор)
	|	ЛЕВОЕ СОЕДИНЕНИЕ #ИмяВТЗаблокированныхРегистраторовОтчетов КАК ЗаблокированныеРегистраторыОтчетов
	|		ПО (ЗаблокированныеРегистраторыОтчетов.Ссылка = Движения.Регистратор)
	|ГДЕ
	|	Движения.Регистратор = &Регистратор
	|	И ЗаблокированныеРегистраторыВозврата.Ссылка ЕСТЬ NULL
	|	И ЗаблокированныеРегистраторыПередачи.Ссылка ЕСТЬ NULL
	|	И ЗаблокированныеРегистраторыОтчетов.Ссылка ЕСТЬ NULL
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"#ИмяВТЗаблокированныхРегистраторовВозврата",
		РезультатыСозданияВТВозвраты.ИмяВременнойТаблицы);
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"#ИмяВТЗаблокированныхРегистраторовПередачи",
		РезультатыСозданияВТПередачи.ИмяВременнойТаблицы);
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"#ИмяВТЗаблокированныхРегистраторовОтчетов",
		РезультатыСозданияВТОтчеты.ИмяВременнойТаблицы);
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Для каждого Выборка Из ОбновляемыеДанные Цикл
		
		Регистратор = Выборка.Регистратор;
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			Блокировка.Заблокировать();
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("Регистратор", Регистратор);
			
			Набор = РегистрыНакопления.ВыручкаИСебестоимостьПродаж.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Регистратор);
			
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() = 0 Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			Набор.Загрузить(Результат);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать документ: %Регистратор% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Регистратор%", Регистратор);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Регистратор.Метаданные(), ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
