
Процедура ЗаполнитьТабличныйДокумент_ТехникаЭтикетки(ТабличныйДокумент, МассивТехники) экспорт
	
	ТабличныйДокумент.ПолеСверху=0;
	ТабличныйДокумент.ПолеСлева=0;
	ТабличныйДокумент.ПолеСнизу=0;
	ТабличныйДокумент.ПолеСправа=0;
	
	Макет = ПолучитьМакет("ЭтикеткиТехники");
	СтрокаМакета=Новый ТабличныйДокумент;
	ТекСтрока=1;
	МаксСтрока=3;
	ТекКолонка=0;
	МаксКолонка=3;
	
	Для каждого Техника Из МассивТехники Цикл
		//Техника = Справочники.ОбъектыЭксплуатации.НайтиПоКоду("1");
		
		//Вариант не для ленты а на обычный лист
		//Если ТекКолонка=МаксКолонка Тогда
		//	Если ТекСтрока=МаксСтрока Тогда
		//		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		//		ТекСтрока=1;
		//	Иначе
		//		ТекСтрока=ТекСтрока+1;
		//	КонецЕсли; 
		//	ТабличныйДокумент.Вывести(СтрокаМакета);
		//	СтрокаМакета=Новый ТабличныйДокумент;
		//	ТекКолонка=1;
		//Иначе
		//	ТекКолонка=ТекКолонка+1;	
		//КонецЕсли; 
		
		ОбластьТелоЭтикетки = Макет.ПолучитьОбласть("ТелоЭтикетки");
		ОбластьТелоЭтикетки.Параметры.ИнвентарныйНомер=Техника.Код;
		ОбластьТелоЭтикетки.Параметры.ЗаводскойНомер=Техника.ЗаводскойНомер;
		
//Рарус Владимир Подрезов 30.03.2017
//		QRСтрока="http://erp.pekkaniska.ru/AA_ERP_PROD/"+Техника.Код;
		УстановитьПривилегированныйРежим(Истина);
		АдресСервисаТехникаQRСтикеров = СокрЛП(Константы.пкАдресWebСервисаQRСтикеровТехника.Получить());
		УстановитьПривилегированныйРежим(Ложь);
		Если АдресСервисаТехникаQRСтикеров = "" Тогда
			АдресСервисаТехникаQRСтикеров = "http://k.pekkaniska.ru/m/";
		КонецЕсли;
		QRСтрока	= АдресСервисаТехникаQRСтикеров + СокрЛП(Техника.Код);
//Рарус Владимир Подрезов Конец
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 1, 238);
		Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
			КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			ОбластьТелоЭтикетки.Рисунки.QRКод.Картинка = КартинкаQRКода;
		Иначе
			ОбластьТелоЭтикетки.Рисунки.QRКод.Высота = 0;
			ОбластьТелоЭтикетки.Рисунки.QRКод.Ширина = 0;
		КонецЕсли;
		
		//СтрокаМакета.Присоединить(ОбластьТелоЭтикетки);
		ТабличныйДокумент.Вывести(ОбластьТелоЭтикетки);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();		
	КонецЦикла; 
	
	
	//ТабличныйДокумент.Вывести(СтрокаМакета);
	
КонецПроцедуры

