Процедура СформироватьЗаписиПоДокументуСнятие(Отказ, РежимПроведения, тИсточник)
	
	НаборЗаписей  = тИсточник.Движения.пкПостановкаНаУчетВРостехнадзоре;
	НаборЗаписей.Записывать = Истина;
	
	Для Каждого текСтрока Из тИсточник.СписокТехники Цикл
	
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Регистратор					= тИсточник.Ссылка;
		НоваяЗапись.Период						= тИсточник.Дата;
		Если тИсточник.СнятиеСУчета Тогда
			НоваяЗапись.ДатаПостановкиНаУчет	= текСтрока.ДатаПостановкиНаУчет;
		//	НоваяЗапись.РегистрационныйНомер	= текСтрока.РегистрационныйНомер;
		Иначе	
			Если ЗначениеЗаполнено(текСтрока.ДатаПостановкиНаУчет) Тогда
				НоваяЗапись.ДатаПостановкиНаУчет	= текСтрока.ДатаПостановкиНаУчет;
			Иначе	
				НоваяЗапись.ДатаПостановкиНаУчет 	= тИсточник.Дата;
			КонецЕсли; 
		КонецЕсли; 
			НоваяЗапись.РегистрационныйНомер	= ?(ЗначениеЗаполнено(тИсточник.Регион),тИсточник.Регион.Код,"") + текСтрока.РегистрационныйНомер;
			НоваяЗапись.Регион					= тИсточник.Регион;
		НоваяЗапись.ПостановкаНаУчет			= не тИсточник.СнятиеСУчета;
		НоваяЗапись.Организация					= тИсточник.Организация;
		НоваяЗапись.ОсновноеСредство			= текСтрока.ОсновноеСредство;
		
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Отказ = Истина;
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

Процедура СформироватьЗаписи(Отказ, РежимПроведения, тИсточник) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивИсточников = Новый Массив;
	
	Если ТипЗнч(тИсточник) = Тип("Массив") Тогда
		МассивИсточников = тИсточник;
	Иначе
		МассивИсточников.Добавить(тИсточник);
	КонецЕсли;
	
	Для Каждого ЭлементИсточник из МассивИсточников Цикл
		
		//Если ТипЗнч(ЭлементИсточник) = Тип("ДокументОбъект.пкПретензия") или ТипЗнч(ЭлементИсточник) Тогда
			СформироватьЗаписиПоДокументуСнятие(Отказ, РежимПроведения, ЭлементИсточник);
		//КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
