///////////////////////////////////////////////////////////////////////////////////////////
//
//  Устарело. Следует использовать процедуры модуля ИнтеграцияГосИС.
//
//

#Область ПрограммныйИнтерфейс

// Устарело. Следует использовать функцию ИнтеграцияГосИС.ВыполнитьПакетЗапросов
// Формирует пакет запросов и возвращает результат каждого запроса
//
// Параметры:
//  Запрос				 - Запрос	 - запрос, параметры которого предварительно установлены.
//  ТекстыЗапроса		 - СписокЗначений	 - в списке перечислены тексты запросов и их имена.
//  ВыгрузитьРезультат	 - Булево			 - Истина, если результат запроса нужно выгрузить в таблицы значений.
// 
// Возвращаемое значение:
//  Структура - структура в которую помещены полученные таблицы
//
Функция ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса, ВыгрузитьРезультат = Ложь) Экспорт
	Возврат ИнтеграцияГосИС.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса, ВыгрузитьРезультат);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
