
/////////////////////////////////////////////////////////////////////////

Процедура СформироватьЗаписиПоДокументупкВыдачаТопливныхКарт(Отказ, РежимПроведения, тИсточник)
	
	НаборЗаписей  = тИсточник.Движения.пкВыданныеТопливныеКарты;
	НаборЗаписей.Записывать = Истина;
	
	Для Каждого текСтрока Из тИсточник.ТопливныеКарты Цикл
	
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Регистратор					= тИсточник.Ссылка;
		НоваяЗапись.Период						= тИсточник.Дата;
		
		НоваяЗапись.Организация					= тИсточник.Организация;
		НоваяЗапись.Подразделение				= тИсточник.Подразделение;
		
		НоваяЗапись.Сотрудник					= текСтрока.Сотрудник;
		НоваяЗапись.ТопливнаяКарта				= текСтрока.ТопливнаяКарта;
		НоваяЗапись.ТС							= текСтрока.ТС;
		
		НоваяЗапись.ДатаВремяВыдачи				= текСтрока.ДатаВремяВыдачи;

	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Отказ = Истина;
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
Процедура СформироватьЗаписи(Отказ, РежимПроведения, тИсточник) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивИсточников = Новый Массив;
	
	Если ТипЗнч(тИсточник) = Тип("Массив") Тогда
		МассивИсточников = тИсточник;
	Иначе
		МассивИсточников.Добавить(тИсточник);
	КонецЕсли;
	
	Для Каждого ЭлементИсточник из МассивИсточников Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ДокументОбъект.пкВыдачаТопливныхКарт") Тогда
			СформироватьЗаписиПоДокументупкВыдачаТопливныхКарт(Отказ, РежимПроведения, ЭлементИсточник);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
