
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОбъектЭксплуатации) Тогда 
		
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		ЭлементОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбъектЭксплуатации");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Параметры.ОбъектЭксплуатации;
		ЭлементОтбора.ИдентификаторПользовательскойНастройки = "ОбъектЭксплуатации";
		ЭлементОтбора.ПредставлениеПользовательскойНастройки = "Объект эксплуатации";
		ОбъектЭксплуатации = Параметры.ОбъектЭксплуатации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Для Каждого Эл Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		Если Эл.ИдентификаторПользовательскойНастройки = "ОбъектЭксплуатации" И ЗначениеЗаполнено(ОбъектЭксплуатации) Тогда 
			Эл.ПравоеЗначение = ОбъектЭксплуатации;
			Эл.Использование = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "пкПрикрепленыФайлыВДО" Тогда
		СтандартнаяОбработка = Ложь;
		Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		//Если Элементы.Список.ТекущиеДанные.пкПрикрепленыФайлыВДО = 0 Тогда
		//	Возврат;
		//КонецЕсли;
		ОткрытьФорму("Обработка.ИнтеграцияС1СДокументооборот.Форма.ПрисоединенныеФайлы", 
			Новый Структура("ВладелецФайла", Элементы.Список.ТекущиеДанные.Ссылка), 
			ЭтаФорма);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ПараметрыФормы = Новый Структура("ОбъектЭксплуатации",ОбъектЭксплуатации);
	ОткрытьФорму("Документ.пкЗаданиеНаРемонт.Форма.ФормаДокумента",ПараметрыФормы);
	
КонецПроцедуры
