
Процедура СформироватьЗаписиПоДокументуИзменениеСтатусаТехники(Отказ, РежимПроведения, тИсточник)
    
	НаборЗаписей  = тИсточник.Движения.пкСостояниеТехники;
	НаборЗаписей.Записывать = Истина;
	
    НоваяЗапись = НаборЗаписей.Добавить();
    НоваяЗапись.Регистратор = тИсточник.Ссылка;
    НоваяЗапись.Период	    = тИсточник.Дата;
    
    НоваяЗапись.Техника	    = тИсточник.Техника;
    НоваяЗапись.Показатель  = ПланыВидовХарактеристик.пкПоказателиСостоянияТехники.Местонахождения;
    
    Если тИсточник.Статус = Перечисления.пкСтатусыТехники.ВАренде Тогда
        НоваяЗапись.Значение = тИсточник.ОбъектСтроительства;
    Иначе
        НоваяЗапись.Значение = тИсточник.Склад;
    КонецЕсли;     
				    
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Отказ = Истина;
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
Процедура СформироватьЗаписи(Отказ, РежимПроведения, тИсточник) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивИсточников = Новый Массив;
	
	Если ТипЗнч(тИсточник) = Тип("Массив") Тогда
		МассивИсточников = тИсточник;
	Иначе
		МассивИсточников.Добавить(тИсточник);
	КонецЕсли;
	
	Для Каждого ЭлементИсточник из МассивИсточников Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ДокументОбъект.пкИзменениеСтатусаТехники") Тогда
            СформироватьЗаписиПоДокументуИзменениеСтатусаТехники(Отказ, РежимПроведения, ЭлементИсточник);     
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
