
Процедура ПередЗаписью(Отказ, Замещение)
	
	ТЗ = ЭтотОбъект.Выгрузить();
	Если ТЗ.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ТЗ[0].Техника) Тогда
		Возврат;	
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ДатаБлокировки КАК ПредДатаБлокировки,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.Заблокирован КАК ПредЗаблокирован,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ДатаРазблокировки КАК ПредДатаРазблокировки
		|ИЗ
		|	РегистрСведений.пкДополнительнаяИнформацияТехника.СрезПоследних(, Техника = &Техника) КАК пкДополнительнаяИнформацияТехникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Техника", ТЗ[0].Техника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		Возврат;		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.ПредЗаблокирован И ТЗ[0].Заблокирован Тогда
	
		ТЗ[0].ДатаБлокировки = ВыборкаДетальныеЗаписи.ПредДатаБлокировки;	
		
	ИначеЕсли НЕ ВыборкаДетальныеЗаписи.ПредЗаблокирован И ТЗ[0].Заблокирован	Тогда
		
		ТЗ[0].ДатаБлокировки 	= ТекущаяДата();
		ТЗ[0].ДатаРазБлокировки = Неопределено;
		
	ИначеЕсли ВыборкаДетальныеЗаписи.ПредЗаблокирован И НЕ ТЗ[0].Заблокирован	Тогда	
		
		ТЗ[0].ДатаРазБлокировки = ТекущаяДата();
		ТЗ[0].ДатаБлокировки	= Неопределено;
		
	КонецЕсли;

	ЭтотОбъект.Загрузить(ТЗ);
		
КонецПроцедуры

