
&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрацияТранспортныхСредствСрезПоследних.Период КАК ДатаРегистрации,
	               |	РегистрацияТранспортныхСредствСрезПоследних.Организация,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ОсновноеСредство,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ВключатьВНалоговуюБазу,
	               |	РегистрацияТранспортныхСредствСрезПоследних.РегистрационныйЗнак,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ИдентификационныйНомер,
	               |	РегистрацияТранспортныхСредствСрезПоследних.Марка,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ПостановкаНаУчетВНалоговомОргане,
	               |	РегистрацияТранспортныхСредствСрезПоследних.НалоговыйОрган КАК НалоговыйОрганРегистрацииТС,
	               |	РегистрацияТранспортныхСредствСрезПоследних.КодПоОКТМО,
	               |	РегистрацияТранспортныхСредствСрезПоследних.КодПоОКАТО,
	               |	РегистрацияТранспортныхСредствСрезПоследних.КодВидаТранспортногоСредства,
	               |	РегистрацияТранспортныхСредствСрезПоследних.НалоговаяБаза,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ЕдиницаИзмеренияНалоговойБазы,
	               |	РегистрацияТранспортныхСредствСрезПоследних.НалоговаяСтавка КАК ТекущаяСтавка,
	               |	РегистрацияТранспортныхСредствСрезПоследних.НалоговаяЛьгота,
	               |	РегистрацияТранспортныхСредствСрезПоследних.КодНалоговойЛьготы,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ЛьготнаяСтавка,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ПроцентУменьшения,
	               |	РегистрацияТранспортныхСредствСрезПоследних.СуммаУменьшения,
	               |	РегистрацияТранспортныхСредствСрезПоследних.РегиональныйКодЛьготы,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ЭкологическийКласс,
	               |	РегистрацияТранспортныхСредствСрезПоследних.УдалитьЭкологическийКласс,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ОбщаяСобственность,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ПовышающийКоэффициент,
	               |	РегистрацияТранспортныхСредствСрезПоследних.НалоговаяСтавкаЗависитОтГодаВыпускаТС,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ВидЗаписи,
	               |	РегистрацияТранспортныхСредствСрезПоследних.Комментарий,
	               |	РегистрацияТранспортныхСредствСрезПоследних.ОсновноеСредство.ДатаВыпуска КАК ДатаВыпуска,
	               |	пкДатыУстановкиСтавкиТранспортногоНалогаСрезПоследних.Период КАК ДатаУстановки,
	               |	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение,
	               |	РегистрацияТранспортныхСредствСрезПоследних.Организация.РегистрацияВНалоговомОргане КАК НалоговыйОрганОрганизации,
	               |	РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане КАК НалоговыйОрганПодразделения,
	               |	ВЫБОР
	               |		КОГДА НЕ РегистрацияТранспортныхСредствСрезПоследних.НалоговыйОрган = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	               |			ТОГДА РегистрацияТранспортныхСредствСрезПоследних.НалоговыйОрган
	               |		КОГДА НЕ РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане ЕСТЬ NULL 
	               |			ТОГДА РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане
	               |		ИНАЧЕ РегистрацияТранспортныхСредствСрезПоследних.Организация.РегистрацияВНалоговомОргане
	               |	КОНЕЦ КАК НалоговыйОрган
	               |ИЗ
	               |	РегистрСведений.РегистрацияТранспортныхСредств.СрезПоследних КАК РегистрацияТранспортныхСредствСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкДатыУстановкиСтавкиТранспортногоНалога.СрезПоследних КАК пкДатыУстановкиСтавкиТранспортногоНалогаСрезПоследних
	               |		ПО РегистрацияТранспортныхСредствСрезПоследних.ОсновноеСредство = пкДатыУстановкиСтавкиТранспортногоНалогаСрезПоследних.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	               |			ПО МестонахождениеОСБухгалтерскийУчетСрезПоследних.Организация = РегистрацииВНалоговомОргане.Организация
	               |				И МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение = РегистрацииВНалоговомОргане.Подразделение
	               |		ПО РегистрацияТранспортныхСредствСрезПоследних.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	               |			И РегистрацияТранспортныхСредствСрезПоследних.Организация = МестонахождениеОСБухгалтерскийУчетСрезПоследних.Организация
	               |ГДЕ
	               |	РегистрацияТранспортныхСредствСрезПоследних.ВидЗаписи <> ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.СнятиеСРегистрационногоУчета)
	               |	И РегистрацияТранспортныхСредствСрезПоследних.НалоговаяСтавкаЗависитОтГодаВыпускаТС = ИСТИНА
	               |	И (&Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИЛИ РегистрацияТранспортныхСредствСрезПоследних.Организация = &Организация)
	               |	И (&НалоговыйОрган = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	               |			ИЛИ РегистрацияТранспортныхСредствСрезПоследних.НалоговыйОрган = &НалоговыйОрган)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаРегистрации";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НалоговыйОрган", Объект.НалоговыйОрган);
	
	Результат = Запрос.Выполнить();
	ТаблицаРезультата = Результат.Выгрузить();
	
	Объект.ОсновныеСредства.Загрузить(ТаблицаРезультата);
	 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаписьНаСервере()
	ЭтаОбработка=РеквизитФормыВЗначение("Объект");
	ЭтаОбработка.ВыполнитьЗаписьВРегистры();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапись(Команда)
	ВыполнитьЗаписьНаСервере();
КонецПроцедуры
