////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции, управляющие настройками системы (локализация)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытий_ПанельСправочниковНСИ_КлассификаторыНоменклатуры

Процедура ОбработкаНавигационнойСсылкиФормы__КлассификаторыНоменклатуры(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьОКВЭД" Тогда
		ОткрытьФорму("Справочник.КлассификаторВидовЭкономическойДеятельности.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьВидыАлкогольнойПродукции" Тогда
		ОткрытьФорму("Справочник.ВидыАлкогольнойПродукции.ФормаСписка", , Форма);
	КонецЕсли;
	// ИнтеграцияГИСМ
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьВидыМехаГИСМ" Тогда
		ОткрытьФорму("Справочник.ВидыМехаГИСМ.ФормаСписка",,Форма);
	КонецЕсли;
	// Конец ИнтеграцияГИСМ
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьКлассификаторТНВЭД" Тогда
		ОткрытьФорму("Справочник.КлассификаторТНВЭД.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьОбщероссийскийКлассификаторПродукции" Тогда
		ОткрытьФорму("Справочник.ОбщероссийскийКлассификаторПродукции.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьКлассификаторОКПД2" Тогда
		ОткрытьФорму("Справочник.КлассификаторОКПД2.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьКлассификаторОКВЭД2" Тогда
		ОткрытьФорму("Справочник.КлассификаторОКВЭД2.ФормаСписка", , Форма);
	КонецЕсли;
	//-- Локализация
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Закупки

Процедура ОбработкаНавигационнойСсылкиФормы_Закупки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_Закупки(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Казначейство

Процедура ОбработкаНавигационнойСсылкиФормы_Казначейство(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	// ++ НЕ УТ
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастроитьПоддержка275ФЗ" Тогда
		ОткрытьФорму("Обработка.ПанельАдминистрированияУТ.Форма.ФЗ275", , Форма);
	КонецЕсли;
	//-- НЕ УТ
	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_Казначейство(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

//++ Локализация
Процедура НачалоВыбораЭлементовФормы_Казначейство(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма) Экспорт
	
	Элементы = Форма.Элементы;

	//++ НЕ УТ
	Если Элемент.Имя = "КаталогВыгрузкиПодтверждающихДокументов" Тогда
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогОткрытияФайла.Заголовок= НСтр("ru = 'Выберите каталог для сохранения архивов подтверждающих документов'");
		ДиалогОткрытияФайла.Каталог = Элементы.КаталогВыгрузкиПодтверждающихДокументов.ТекстРедактирования;
		
		ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("КаталогВыгрузкиПодтверждающихДокументовЗавершение", ЭтотОбъект));
	КонецЕсли;
	//-- НЕ УТ
	
КонецПроцедуры
	
//++ НЕ УТ
Процедура КаталогВыгрузкиПодтверждающихДокументовЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() Тогда
		ДенежныеСредстваВызовСервера.УстановитьЗначениеКонстантыКаталогВыгрузкиПодтверждающихДокументов(ВыбранныеФайлы[0]);
		Оповестить("Запись_НаборКонстант", Новый Структура, "КаталогВыгрузкиПодтверждающихДокументов");
	КонецЕсли;

КонецПроцедуры
//-- НЕ УТ
//-- Локализация
#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_НастройкиНоменклатуры

Процедура ОбработкаНавигационнойСсылкиФормы_НастройкиНоменклатуры(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_НастройкиНоменклатуры(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_НачальноеЗаполнение

Процедура ОбработкаНавигационнойСсылкиФормы_НачальноеЗаполнение(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	
	//++ НЕ УТКА
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЗагрузкаМетодическойМоделиМеждународногоУчета" Тогда
		ОткрытьФорму("Обработка.ПомощникВыгрузкиЗагрузкиМоделиМеждународногоУчета.Форма.Загрузка", , Форма);
	КонецЕсли;
	//-- НЕ УТКА
	
	// ++ НЕ УТ
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьДокументыПереносаДанныхПоЗарплате" Тогда
		ОткрытьФорму("Документ.ПереносДанных.ФормаСписка", , Форма);
	КонецЕсли;
	//-- НЕ УТ

	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_НачальноеЗаполнение(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Продажи

Процедура ОбработкаНавигационнойСсылкиФормы_Продажи(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьПараметрыПодключенияЕГАИС" Тогда
		ОткрытьФорму("РегистрСведений.НастройкиОбменаЕГАИС.ФормаСписка", , ЭтотОбъект);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьМобильныеПриложения" Тогда
		ОткрытьФорму("Справочник.ВерсииМобильныхПриложений.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьМобильныеКомпьютеры" Тогда
		ОткрытьФорму("Справочник.МобильныеКомпьютеры.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьНастройкиКомпонентыОбменаДаннымиСКПК" Тогда
		ОткрытьФорму("ОбщаяФорма.НастройкиКомпонентыОбменаДаннымиСКПК", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьНастройкиТорговыхПредставителей" Тогда
		ОткрытьФорму("ПланОбмена.МобильноеПриложениеТорговыйПредставитель.ФормаСписка",
			Новый Структура("НеОтображатьЭтотУзел", Истина),
			Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьНастройкиФЗ54" Тогда
		ОткрытьФорму("Обработка.ПанельАдминистрированияУТ.Форма.ФЗ54", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастроитьИспользованиеАлкоголя" Тогда
		ОткрытьФорму("Обработка.ПанельАдминистрированияУТ.Форма.АлкогольнаяПродукция", , Форма);
	КонецЕсли;
	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_Продажи(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Предприятие

Процедура ОбработкаНавигационнойСсылкиФормы_Предприятие(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_Предприятие(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_ФинансовыйРезультат

Процедура ОбработкаНавигационнойСсылкиФормы_ФинансовыйРезультат(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	//++ Локализация
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЗаполнениеАктивовПассивов" Тогда
		ЗаполнитьАктивыПассивы(Элемент, Форма);
	КонецЕсли;
	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_ФинансовыйРезультат(Элемент, Форма) Экспорт
	//++ Локализация
	НаборКонстант = Форма.НаборКонстант;
	Если Элемент.Имя = "ФормироватьУправленческийБаланс" И НаборКонстант.ФормироватьУправленческийБаланс Тогда
		ЗаполнитьАктивыПассивы(Элемент, Форма);
	КонецЕсли;	
	//-- Локализация
	Возврат
КонецПроцедуры

//++ Локализация
Процедура ЗаполнитьАктивыПассивы(Элемент, Форма)
	
	ДополнительныеПараметры = Новый Структура("Форма, Элемент", Форма, Элемент);
	ОбработчикЗакрытияФормы = Новый ОписаниеОповещения("ПослеФормированияДвиженийУпрБаланса", 
											ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.ДвиженияАктивовПассивов.Форма.ЗаполнениеРегистра",,Форма,,,,ОбработчикЗакрытияФормы);
	
КонецПроцедуры

Процедура ПослеФормированияДвиженийУпрБаланса(Результат, ДопПараметры) Экспорт
	
	Если ДопПараметры.Элемент.Имя = "ФормироватьУправленческийБаланс" Тогда
		Если Результат <> Истина Тогда
			ОбщегоНазначенияУТКлиентСервер.ВосстановитьЗначенияДоИзменения(ДопПараметры.Форма, "ФормироватьУправленческийБаланс");
			Возврат;
		КонецЕсли;
		ОбщегоНазначенияУТКлиентСервер.СохранитьЗначенияДоИзменения(ДопПараметры.Форма, "ФормироватьУправленческийБаланс");
		Оповестить("Запись_НаборКонстант", Новый Структура("Элемент", ДопПараметры.Элемент), ДопПараметры.Форма);
	КонецЕсли;
	
	Если ДопПараметры.Элемент.Имя = "ДекорацияЗаполнениеАктивовПассивов" И Результат = Истина Тогда
		Элемент = Новый Структура("Имя", "ФормироватьУправленческийБаланс");
		Оповестить("Запись_НаборКонстант", Новый Структура("Элемент", Элемент), ДопПараметры.Форма);
	КонецЕсли;
	
КонецПроцедуры
//-- Локализация

#КонецОбласти

//++ НЕ УТ
#Область ОбработчикиСобытий_ПанельАдминистрированияКА_Производство

Процедура ПриИзмененииРеквизита_Производство(Элемент, Форма) Экспорт
	//++ Локализация
	Если Элемент.Имя = "ИспользоватьПроизводство21" Тогда
		ПараметрыОповещения = Новый Структура("Элемент, Форма", Элемент, Форма);
		//++ НЕ УТКА
		Если ТребуетсяВывестиПредупреждениеПриОтключении21(Форма) Тогда
			ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения(
				"ИспользоватьПроизводство21ПриИзмененииЗавершение", ЭтотОбъект, ПараметрыОповещения);
			
			ОткрытьФорму("Обработка.ПанельАдминистрированияКА.Форма.ПредупреждениеОбИспользовании21",, Форма,,,,
				ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			Возврат;
			
		КонецЕсли;
		//-- НЕ УТКА
		ИспользоватьПроизводство21ПриИзмененииЗавершение(Истина, ПараметрыОповещения);
	КонецЕсли;
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура ОбработкаНавигационнойСсылкиФормы_Производство(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	//++ Локализация
	СтандартнаяОбработка = Ложь;
	//++ НЕ УТКА
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПереходНаУправлениеПроизводством22" Тогда
		ОткрытьФорму("Обработка.ПереходНаУправлениеПроизводствомВерсии22.Форма");
	КонецЕсли;
	//-- НЕ УТКА
	//-- Локализация
	Возврат;
КонецПроцедуры

//++ Локализация
Процедура ИспользоватьПроизводство21ПриИзмененииЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		ОбщегоНазначенияУТКлиентСервер.ВосстановитьЗначенияДоИзменения(ДопПараметры.Форма, "ИспользоватьУправлениеПроизводством");
		Возврат;
	КонецЕсли;
	ОбщегоНазначенияУТКлиентСервер.СохранитьЗначенияДоИзменения(ДопПараметры.Форма, "ИспользоватьУправлениеПроизводством");
	Оповестить("Запись_НаборКонстант", Новый Структура("Элемент", ДопПараметры.Элемент), ДопПараметры.Форма);
КонецПроцедуры

//++ НЕ УТКА
Функция ТребуетсяВывестиПредупреждениеПриОтключении21(Форма) Экспорт
	НаборКонстант = Форма.НаборКонстант;
	Если НаборКонстант.ИспользоватьУправлениеПроизводством2_2
		И НЕ НаборКонстант.ИспользоватьУправлениеПроизводством
		И ОбщегоНазначенияУТКлиентСервер.ПолучитьЗначениеДоИзменения(Форма, "ИспользоватьУправлениеПроизводством") Тогда
		
		Возврат УправлениеПроизводствомВызовСервера.ЕстьНезавершенныеОперацииВПроизводстве21();
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
//-- НЕ УТКА
//-- Локализация
#КонецОбласти
//-- НЕ УТ
#КонецОбласти