#Область ПрограммныйИнтерфейс

// Определяет список модулей библиотек и конфигурации, которые предоставляют
// основные сведения о себе: имя, версия, список обработчиков обновления
// а также зависимости от других библиотек.
//
// Состав обязательных процедур такого модуля см. в общем модуле ОбновлениеИнформационнойБазыБСП
// (область ПрограммныйИнтерфейс).
// При этом сам модуль Библиотеки стандартных подсистем ОбновлениеИнформационнойБазыБСП
// не требуется явно добавлять в массив МодулиПодсистем.
//
// Параметры:
//  МодулиПодсистем - Массив - имена серверных общих модулей библиотек и конфигурации.
//                             Например: "ОбновлениеИнформационнойБазыБРО" - библиотека,
//                                       "ОбновлениеИнформационнойБазыБП"  - конфигурация.
//                    
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБПО");
	
	//++ НЕ ГОСИС
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБТС");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыУТ");
	//++ НЕ УТ
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыКА");
	//-- НЕ УТ
	//++ НЕ УТКА
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыУП");
	//-- НЕ УТКА
	//-- НЕ ГОСИС
	
	ПодсистемыКонфигурацииЛокализация.ПриДобавленииПодсистем(МодулиПодсистем);
	
	// {УАТ}
	МодулиПодсистем.Добавить("уатОбновлениеИнформационнойБазы");
	// {/УАТ} 
	
	//Рарус Владимир Подрезов 15.08.2016
	МодулиПодсистем.Добавить("пкОбщийМодульСервер");
	//Рарус Владимир Подрезов Конец
	
КонецПроцедуры

#КонецОбласти
