
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает значение отбора пользователя, установленного в отчете.
Функция ПолучитьЗначениеОтбора(КомпоновщикНастроек, ИмяПоля, МассивОперацийСравнения = Неопределено, ТолькоЕслиИспользуется = Ложь) Экспорт
	Значение = Неопределено;
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ПоВсемОперациям = ?(ЗначениеЗаполнено(МассивОперацийСравнения), Ложь, Истина);
	Для Каждого Поле Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(Поле) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если Поле.ЛевоеЗначение = ПолеОтбора И (НЕ ТолькоЕслиИспользуется ИЛИ Поле.Использование) Тогда
			Если ПоВсемОперациям Тогда
				ПолеЗначения = ОтчетыКлиентСервер.НайтиПользовательскуюНастройку(КомпоновщикНастроек.ПользовательскиеНастройки, Поле.ИдентификаторПользовательскойНастройки);
				Значение = ПолеЗначения.ПравоеЗначение;
			Иначе
				Для Каждого ОперацияСравнения Из МассивОперацийСравнения Цикл
					Если Поле.ВидСравнения = ОперацияСравнения Тогда
						ПолеЗначения = ОтчетыКлиентСервер.НайтиПользовательскуюНастройку(КомпоновщикНастроек.ПользовательскиеНастройки, Поле.ИдентификаторПользовательскойНастройки);
						Если ПолеЗначения <> Неопределено Тогда
							Значение = ПолеЗначения.ПравоеЗначение;
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Значение;
КонецФункции

// Возвращает окончание периода отчета. Используется в методах
// по актуализации оффлайновых регистров, служит датой окончания расчета.
//	Параметры:
//		КомпоновщикНастроек - КомпоновщикНастроек - Компоновщик настроек отчета
//		ИмяПоля - Строка - Имя поля в параметрах, которое отвечает за период отчета.
//	ВозвращаемоеЗначение:
//		Дата
Функция ГраницаРасчета(КомпоновщикНастроек, ИмяПоля) Экспорт
	ПараметрПериодОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, ИмяПоля);
	Если ТипЗнч(ПараметрПериодОтчета.Значение) = Тип("СтандартныйПериод") Тогда
		ГраницаРасчета = ?(ПараметрПериодОтчета.Использование, ПараметрПериодОтчета.Значение.ДатаОкончания, ОбщегоНазначенияУТВызовСервера.ДатаСеанса());
	Иначе
		ГраницаРасчета = ?(ПараметрПериодОтчета.Использование, ПараметрПериодОтчета.Значение, ОбщегоНазначенияУТВызовСервера.ДатаСеанса());
	КонецЕсли;
	Возврат КонецМесяца(ГраницаРасчета) + 1;
КонецФункции

#КонецОбласти
