#Область ПрограммныйИнтерфейс

#Область ИсходящаяТранспортнаяОперацияВЕТИС
Процедура КомандыИсходящейТранспортнойОперации(Команды) Экспорт 
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"РеализацияТоваровУслуг",            НСтр("ru = 'Реализацию товаров услуг'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ВозвратТоваровПоставщику",          НСтр("ru = 'Возврат товаров поставщику'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПеремещениеТоваров",                НСтр("ru = 'Перемещение товаров'"),                  "ИспользоватьПеремещениеТоваров");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПередачаТоваровМеждуОрганизациями", НСтр("ru = 'Передачу товаров между организациями'"), "ИспользоватьПередачиТоваровМеждуОрганизациями");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ВозвратТоваровМеждуОрганизациями",  НСтр("ru = 'Возврат товаров между организациями'"),  "ИспользоватьПередачиТоваровМеждуОрганизациями");
	// ++ НЕ УТ
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ОтгрузкаТоваровСХранения",          НСтр("ru = 'Отгрузку товаров с хранения'"),          "ИспользоватьОтветственноеХранениеВПроцессеЗакупки");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ДвижениеПродукцииИМатериалов",      НСтр("ru = 'Движение продукции и материалов'"),      "ИспользоватьУправлениеПроизводством2_2");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПередачаСырьяПереработчику",        НСтр("ru = 'Передачу сырья переработчику'"),         "ИспользоватьПроизводствоНаСтороне");
	// -- НЕ УТ
	// ++ НЕ УТКА
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПередачаДавальцу",                  НСтр("ru = 'Передачу давальцу'"),                    "ИспользоватьПроизводствоИзДавальческогоСырья");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ВозвратСырьяДавальцу",              НСтр("ru = 'Возврат сырья давальцу'"),               "ИспользоватьПроизводствоИзДавальческогоСырья");
	// -- НЕ УТКА
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"РеализацияТоваровУслуг",            НСтр("ru = 'Реализацию товаров услуг'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратТоваровПоставщику",          НСтр("ru = 'Возврат товаров поставщику'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПеремещениеТоваров",                НСтр("ru = 'Перемещение товаров'"),                  "ИспользоватьПеремещениеТоваров");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПередачаТоваровМеждуОрганизациями", НСтр("ru = 'Передачу товаров между организациями'"), "ИспользоватьПередачиТоваровМеждуОрганизациями");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратТоваровМеждуОрганизациями",  НСтр("ru = 'Возврат товаров между организациями'"),  "ИспользоватьПередачиТоваровМеждуОрганизациями");
	// ++ НЕ УТ
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ОтгрузкаТоваровСХранения",          НСтр("ru = 'Отгрузку товаров с хранения'"),          "ИспользоватьОтветственноеХранениеВПроцессеЗакупки");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ДвижениеПродукцииИМатериалов",      НСтр("ru = 'Движение продукции и материалов'"),      "ИспользоватьУправлениеПроизводством2_2");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПередачаСырьяПереработчику",        НСтр("ru = 'Передачу сырья переработчику'"),         "ИспользоватьПроизводствоНаСтороне");
	// -- НЕ УТ
	// ++ НЕ УТКА
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПередачаДавальцу",                  НСтр("ru = 'Передачу давальцу'"),                    "ИспользоватьПроизводствоИзДавальческогоСырья");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратСырьяДавальцу",              НСтр("ru = 'Возврат сырья давальцу'"),               "ИспользоватьПроизводствоИзДавальческогоСырья");
	// -- НЕ УТКА
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандИсходящейТранспортнойОперации(Форма, Команды) Экспорт
	
	Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование)Тогда
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Ложь;
		Возврат;
	Иначе 
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Истина;
	КонецЕсли;
		
	ОднаОрганизация = (Форма.ГрузоотправительСопоставлениеХСДляОтбораОснований = Форма.ГрузополучательСопоставлениеХСДляОтбораОснований)
		И ЗначениеЗаполнено(Форма.ГрузоотправительСопоставлениеХСДляОтбораОснований);
		
	ТолькоОрганизации = ТипЗнч(Форма.ГрузополучательСопоставлениеХСДляОтбораОснований) = Тип("СправочникСсылка.Организации")
		И НЕ ОднаОрганизация;
		
	Для Каждого КлючИЗначение Из Форма.ВидимостьПодключаемыхКоманд Цикл
		
		Если  КлючИЗначение.Значение.ИмяМетаданных = "ДвижениеПродукцииИМатериалов" Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = ОднаОрганизация;
		ИначеЕсли КлючИЗначение.Значение.ИмяМетаданных = "ПеремещениеТоваров" Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = ОднаОрганизация ИЛИ ТолькоОрганизации;
		ИначеЕсли КлючИЗначение.Значение.ИмяМетаданных = "ПередачаТоваровМеждуОрганизациями"
			ИЛИ КлючИЗначение.Значение.ИмяМетаданных = "ВозвратТоваровМеждуОрганизациями" Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = ТолькоОрганизации;
		Иначе 
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = НЕ(ОднаОрганизация ИЛИ ТолькоОрганизации);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВходящаяТранспортнаяОперацияВЕТИС

Процедура КомандыВходящейТранспортнойОперации(Команды) Экспорт 
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПриобретениеТоваровУслуг",          НСтр("ru = 'Приобретение товаров и услуг'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ВозвратТоваровОтКлиента",           НСтр("ru = 'Возврат товаров от клиента'"));
	//++ НЕ УТ
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПриемкаТоваровНаХранение",          НСтр("ru = 'Приемку товаров на хранение'"),          "ИспользоватьОтветственноеХранениеВПроцессеЗакупки");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ВыкупПринятыхНаХранениеТоваров",    НСтр("ru = 'Выкуп принятых на хранение товаров'"),   "ИспользоватьОтветственноеХранениеВПроцессеЗакупки");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПоступлениеОтПереработчика",        НСтр("ru = 'Поступление от переработчика'"),         "ИспользоватьПроизводствоНаСтороне");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ВозвратСырьяОтПереработчика",       НСтр("ru = 'Возврат сырья от переработчика'"),       "ИспользоватьПроизводствоНаСтороне");
	//-- НЕ УТ
	//++ НЕ УТКА
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПоступлениеСырьяОтДавальца",        НСтр("ru = 'Поступление сырья от давальца'"),        "ИспользоватьПроизводствоИзДавальческогоСырья");
	//-- НЕ УТКА
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПриобретениеТоваровУслуг",          НСтр("ru = 'Приобретение товаров и услуг'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратТоваровОтКлиента",           НСтр("ru = 'Возврат товаров от клиента'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПеремещениеТоваров",                НСтр("ru = 'Перемещение товаров'"),                  "ИспользоватьПеремещениеТоваров");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПередачаТоваровМеждуОрганизациями", НСтр("ru = 'Передачу товаров между организациями'"), "ИспользоватьПередачиТоваровМеждуОрганизациями");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратТоваровМеждуОрганизациями",  НСтр("ru = 'Возврат товаров между организациями'"),  "ИспользоватьПередачиТоваровМеждуОрганизациями");
	//++ НЕ УТ
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПриемкаТоваровНаХранение",          НСтр("ru = 'Приемку товаров на хранение'"),          "ИспользоватьОтветственноеХранениеВПроцессеЗакупки");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВыкупПринятыхНаХранениеТоваров",    НСтр("ru = 'Выкуп принятых на хранение товаров'"),   "ИспользоватьОтветственноеХранениеВПроцессеЗакупки");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ДвижениеПродукцииИМатериалов",      НСтр("ru = 'Движение продукции и материалов'"),      "ИспользоватьУправлениеПроизводством2_2");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПоступлениеОтПереработчика",        НСтр("ru = 'Поступление от переработчика'"),         "ИспользоватьПроизводствоНаСтороне");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратСырьяОтПереработчика",       НСтр("ru = 'Возврат сырья от переработчика'"),       "ИспользоватьПроизводствоНаСтороне");
	//-- НЕ УТ
	//++ НЕ УТКА
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПоступлениеСырьяОтДавальца",        НСтр("ru = 'Поступление сырья от давальца'"),        "ИспользоватьПроизводствоИзДавальческогоСырья");
	//-- НЕ УТКА
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандВходящейТранспортнойОперации(Форма, Команды) Экспорт
	
	Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование)Тогда
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Ложь;
		Возврат;
	Иначе 
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ПроизводственнаяОперацияВЕТИС

Процедура КомандыПроизводственнойОперации(Команды) Экспорт 
	
	// ++ НЕ УТ
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды, "ПроизводствоБезЗаказа", НСтр("ru = 'Производство без заказа'"),   "ИспользоватьУправлениеПроизводством2_2");
	// -- НЕ УТ
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды, "СборкаТоваров",         НСтр("ru = 'Сборку (разборку) товаров'"), "ИспользоватьСборкуРазборку");
	
	// ++ НЕ УТ
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПроизводствоБезЗаказа", НСтр("ru = 'Производство без заказа'"),   "ИспользоватьУправлениеПроизводством2_2");
	// -- НЕ УТ
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "СборкаТоваров",         НСтр("ru = 'Сборку (разборку) товаров'"), "ИспользоватьСборкуРазборку");
	// ++ НЕ УТКА
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ЭтапПроизводства2_2",   НСтр("ru = 'Этап производства'"),         "ИспользоватьУправлениеПроизводством2_2");
	// -- НЕ УТКА
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандПроизводственнойОперации(Форма, Команды) Экспорт
	
	Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование)Тогда
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Ложь;
		Возврат;
	Иначе 
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнвентаризацияПродукцииВЕТИС

Процедура КомандыИнвентаризацииПродукции(Команды) Экспорт 
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды, "ВнутреннееПотреблениеТоваров",      НСтр("ru = 'Внутреннее потребление товаров'"),        "ИспользоватьВнутреннееПотребление");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды, "СписаниеНедостачТоваров",           НСтр("ru = 'Списание недостач товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды, "ПрочееОприходованиеТоваров",        НСтр("ru = 'Прочее оприходование товаров'"),          "ИспользоватьПрочееОприходованиеТоваров");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды, "ОприходованиеИзлишковТоваров",      НСтр("ru = 'Оприходование излишков товаров'"));
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ВнутреннееПотреблениеТоваров",      НСтр("ru = 'Внутреннее потребление товаров'"),        "ИспользоватьВнутреннееПотребление");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "СписаниеНедостачТоваров",           НСтр("ru = 'Списание недостач товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПересортицаТоваров",                НСтр("ru = 'Пересортицу товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПрочееОприходованиеТоваров",        НСтр("ru = 'Прочее оприходование товаров'"),          "ИспользоватьПрочееОприходованиеТоваров");
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ОприходованиеИзлишковТоваров",      НСтр("ru = 'Оприходование излишков товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПорчаТоваров",                      НСтр("ru = 'Порчу товаров'"),                         "ИспользоватьКачествоТоваров");
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандИнвентаризацииПродукции(Форма, Команды) Экспорт
	
	Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование)Тогда
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Ложь;
		Возврат;
	Иначе 
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Истина;
	КонецЕсли;
		
	ЕстьРасход = Ложь;
	ЕстьПриход = Ложь;
	Для Каждого СтрокаТЧ Из Форма.Объект.Товары Цикл
		Если СтрокаТЧ.КоличествоИзменениеВЕТИС<0 Тогда 
			ЕстьРасход = Истина;
		ИначеЕсли СтрокаТЧ.КоличествоИзменениеВЕТИС>0 Тогда 
			ЕстьПриход = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из Форма.ВидимостьПодключаемыхКоманд Цикл
		Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование)Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = Ложь;
		ИначеЕсли КлючИЗначение.Значение.ИмяМетаданных = "ПересортицаТоваров"
			ИЛИ КлючИЗначение.Значение.ИмяМетаданных = "ПорчаТоваров" Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = ЕстьПриход = ЕстьРасход;
		ИначеЕсли КлючИЗначение.Значение.ИмяМетаданных = "ОприходованиеИзлишковТоваров"
			ИЛИ КлючИЗначение.Значение.ИмяМетаданных = "ПрочееОприходованиеТоваров" Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = НЕ ЕстьРасход;
		Иначе
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = НЕ ЕстьПриход;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ПересчитатьКоличествоЕдиницВЕТИС(Количество, Номенклатура, ЕдиницаИзмеренияВЕТИС, НужноОкруглять, КэшированныеЗначения, ТекстОшибки = Неопределено) Экспорт
	
	НовоеКоличествоВЕТИС = Неопределено;
	ТекстОшибки = Неопределено;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		ДанныеЕдиницыИзмерения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьКоэффициентЕдиницыИзмеренияВЕТИС(
									ЕдиницаИзмеренияВЕТИС, 
									КэшированныеЗначения,
									Номенклатура);
		
		Если ЗначениеЗаполнено(ЕдиницаИзмеренияВЕТИС) Тогда
			
			Если ДанныеЕдиницыИзмерения.КодОшибки <> 0 Тогда
				
				ТекстОшибки = ТекстОшибкиПересчетаЕдиницыИзмеренияВЕТИС(
										ДанныеЕдиницыИзмерения.КодОшибки,
										Номенклатура, 
										ЕдиницаИзмеренияВЕТИС, 
										ДанныеЕдиницыИзмерения.ТипИзмеряемойВеличины);
				
				Возврат Неопределено;
				
			КонецЕсли;
			
			НовоеКоличествоВЕТИС = Количество / ДанныеЕдиницыИзмерения.Коэффициент;
		
			Если НужноОкруглять
				И ДанныеЕдиницыИзмерения.НужноОкруглятьКоличествоВЕТИС Тогда
				
				НовоеКоличествоВЕТИС = Окр(НовоеКоличествоВЕТИС, 0, РежимОкругления.Окр15как20);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат НовоеКоличествоВЕТИС;
	
КонецФункции

Функция ПересчитатьКоличествоЕдиниц(КоличествоВЕТИС, Номенклатура, ЕдиницаИзмеренияВЕТИС, НужноОкруглять, КэшированныеЗначения, ТекстОшибки = Неопределено) Экспорт
	
	НовоеКоличество = Неопределено;
	ТекстОшибки = Неопределено;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		ДанныеЕдиницыИзмерения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьКоэффициентЕдиницыИзмеренияВЕТИС(
									ЕдиницаИзмеренияВЕТИС, 
									КэшированныеЗначения,
									Номенклатура);
		
		Если ЗначениеЗаполнено(ЕдиницаИзмеренияВЕТИС) Тогда
			
			Если ДанныеЕдиницыИзмерения.КодОшибки <> 0 Тогда
				
				ТекстОшибки = ТекстОшибкиПересчетаЕдиницыИзмеренияВЕТИС(
										ДанныеЕдиницыИзмерения.КодОшибки,
										Номенклатура,
										ЕдиницаИзмеренияВЕТИС,
										ДанныеЕдиницыИзмерения.ТипИзмеряемойВеличины,
										"ВЕТИС");
				
				Возврат Неопределено;
				
			КонецЕсли;
			
			НовоеКоличество = КоличествоВЕТИС * ДанныеЕдиницыИзмерения.Коэффициент;
			
			Если НужноОкруглять
				И ДанныеЕдиницыИзмерения.НужноОкруглятьКоличество Тогда
				
				НовоеКоличество = Окр(НовоеКоличество, 0, РежимОкругления.Окр15как20);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат НовоеКоличество;
	
КонецФункции

// Возвращает параметры оформления серии по данным строки (если использование условного оформления не возможно).
//
//	Параметры:
//		ОсобыйВариантУказанияСерий - Булево, Строка - Ложь, если серии указываются в отдельной ТЧ,
//			"СерииВсегдаВТЧТовары" - если у объекта нет специальной ТЧ для указания серий,
//			"СерииПриПланированииОтгрузкиУказываютсяВТЧТовары" - если серии могут указываться в разных ТЧ,
//				при этом серии с политикой учета "При планировании отгрузки" указываются в ТЧ Товары,
//		ДанныеСтроки - Структура, ДанныеФормыЭлементКоллекции - данные, в которых содержится информация по оформлению серии
//		ПутьКПолюОтбораСтатусУказанияСерий - Строка - имя поля в "ДанныеСтроки" к реквизиту "Статус указания серий",
//														если он отличается от "СтатусУказанияСерий"
//		ПутьКПолюОтбораТипНоменклатуры - Строка - имя поля в "ДанныеСтроки" к реквизиту "Тип номенклатуры",
//														если он отличается от "ТипНоменклатуры".
//
//	Возвращаемое значение:
//		Структура - структура, содержащая поля, на основании которых можно оформить элемент формы, содержит свойства:
//			ИмяЦветаТекста - Строка - имя цвета текста поля, которое в последствии можно назначить элементу
//								"Цвет текста" поля управляемой формы, значение по умолчанию "ЦветТекстаПоля";
//			ОтметкаНезаполненного - Булево - будет назначаться в аналогичный признак поля управляемой формы, значение по умолчанию Истина;
//			ТолькоПросмотр - Булево - будет назначаться в аналогичный признак поля управляемой формы, значение по умолчанию Ложь;
//			Текст - Строка - строка, которая может быть использована в качестве представления текущего значения серии.
//
Функция ПараметрыОформленияСерииПоДаннымСтроки(ОсобыйВариантУказанияСерий, ДанныеСтроки,
														ПутьКПолюОтбораСтатусУказанияСерий = "СтатусУказанияСерий",
														ПутьКПолюОтбораТипНоменклатуры = "ТипНоменклатуры") Экспорт
	
	// Значения по умолчанию:
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ИмяЦветаТекста", "ЦветТекстаПоля");
	СтруктураВозврата.Вставить("ОтметкаНезаполненного", Истина);
	СтруктураВозврата.Вставить("ТолькоПросмотр", Ложь);
	
	ТипНоменклатуры = ДанныеСтроки[ПутьКПолюОтбораТипНоменклатуры];
	СтатусСерии = ДанныеСтроки[ПутьКПолюОтбораСтатусУказанияСерий];
	
	СерииВсегдаВТЧТовары = (ОсобыйВариантУказанияСерий = "СерииВсегдаВТЧТовары");
	СерииПриПланированииОтгрузкиУказываютсяВТЧТовары = (ОсобыйВариантУказанияСерий = "СерииПриПланированииОтгрузкиУказываютсяВТЧТовары");
	
	СписокТиповДляСерий = Новый СписокЗначений;
	СписокТиповДляСерий.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар"));
	СписокТиповДляСерий.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара"));
	
	// Для товаров
	Если СписокТиповДляСерий.НайтиПоЗначению(ТипНоменклатуры) = Неопределено Тогда
		СтруктураВозврата.Вставить("ИмяЦветаТекста", "ТекстЗапрещеннойЯчейкиЦвет");
		СтруктураВозврата.Вставить("ОтметкаНезаполненного", Ложь);
		СтруктураВозврата.Вставить("Текст", НСтр("ru = '<для товаров>'"));
		СтруктураВозврата.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;
	
	// Серия не указывается
	Если СписокТиповДляСерий.НайтиПоЗначению(ТипНоменклатуры) <> Неопределено И СтатусСерии = 0 Тогда
		СтруктураВозврата.Вставить("ИмяЦветаТекста", "ТекстЗапрещеннойЯчейкиЦвет");
		СтруктураВозврата.Вставить("ОтметкаНезаполненного", Ложь);
		СтруктураВозврата.Вставить("Текст", НСтр("ru = '<серия не указывается>'"));
		СтруктураВозврата.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;
	
	Если Не СерииВсегдаВТЧТовары Тогда
		
		СписокСтатусовСерий = Новый СписокЗначений;
		СписокСтатусовСерий.ЗагрузитьЗначения(НоменклатураКлиентСервер.СтатусыСерийСериюМожноУказать());
		СписокСтатусовСерий.Удалить(СписокСтатусовСерий.НайтиПоЗначению(15));
		Если СерииПриПланированииОтгрузкиУказываютсяВТЧТовары Тогда
			СписокСтатусовСерий.Удалить(СписокСтатусовСерий.НайтиПоЗначению(11));
		КонецЕсли;
		
		// Серия указывается отдельно
		Если СписокТиповДляСерий.НайтиПоЗначению(ТипНоменклатуры) <> Неопределено И СтатусСерии <> 0
			И (СтатусСерии <= ?(СерииПриПланированииОтгрузкиУказываютсяВТЧТовары, 8, 11)
			Или СписокСтатусовСерий.НайтиПоЗначению(СтатусСерии) <> Неопределено) Тогда
			СтруктураВозврата.Вставить("ИмяЦветаТекста", "ТекстЗапрещеннойЯчейкиЦвет");
			СтруктураВозврата.Вставить("ОтметкаНезаполненного", Ложь);
			СтруктураВозврата.Вставить("Текст", НСтр("ru = '<серия указывается отдельно>'"));
			СтруктураВозврата.Вставить("ТолькоПросмотр", Истина);
		КонецЕсли;
		
		СписокСтатусовСерий = Новый СписокЗначений;
		СписокСтатусовСерий.Добавить(15);
		Если СерииПриПланированииОтгрузкиУказываютсяВТЧТовары Тогда
			СписокСтатусовСерий.Добавить(11);
		КонецЕсли;
		
		//
		Если СписокТиповДляСерий.НайтиПоЗначению(ТипНоменклатуры) <> Неопределено
			И СписокСтатусовСерий.НайтиПоЗначению(СтатусСерии) <> Неопределено Тогда
			СтруктураВозврата.Вставить("ОтметкаНезаполненного", Ложь);
		КонецЕсли;		
		
	Иначе
		
		// Серия указывается в ТЧ Товары
		Если НоменклатураКлиентСервер.СтатусыСерийСериюМожноУказать().Найти(СтатусСерии) <> Неопределено Тогда
			СтруктураВозврата.Вставить("ОтметкаНезаполненного", Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстОшибкиПересчетаЕдиницыИзмеренияВЕТИС(КодОшибки, Номенклатура, ЕдиницаИзмеренияВЕТИС, ТипИзмеряемойВеличины, СуффиксКоличества = "")
	
	ПересчетВЕТИС        = СокрЛП(СуффиксКоличества) = "ВЕТИС";
	ТекстЕдиницыХранения = ?(ПересчетВЕТИС, НСтр("ru = 'в единицу хранения'"), НСтр("ru='количества (ВетИС)'"));
	
	ШаблонСообщенияНеЗаполненаЕдиницаИзмерения    = НСтр("ru = 'Не удалось выполнить пересчет %ЕдиницаХранения%, т.к. не заполнено поле ""Единица измерения"" в карточке единицы измерения ВетИС ""%ЕдиницаИзмеренияВетИС%""'");
	ШаблонСообщенияНеУказанТипИзмеряемойВеличины  = НСтр("ru = 'Не удалось выполнить пересчет %ЕдиницаХранения%, т.к. в карточке номенклатуры ""%Номенклатура%"" выключена возможность указания количества в единицах измерения %ТипИзмеряемойВеличины%'");
	ШаблонСообщенияНеСопоставленыЕдиницыИзмерения = НСтр("ru = 'Не удалось выполнить пересчет %ЕдиницаХранения%. Приведите в соответствие единицу измерения в карточке единицы измерения ВетИС ""%ЕдиницаИзмеренияВетИС%"" с единицей хранения номенклатуры ""%Номенклатура%"" или укажите %ТипКоличества% вручную'");
	
	Если КодОшибки = 1 Тогда
		ТекстСообщения = ШаблонСообщенияНеЗаполненаЕдиницаИзмерения;
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаХранения%",       ТекстЕдиницыХранения);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаИзмеренияВетИС%", Строка(ЕдиницаИзмеренияВЕТИС));
	ИначеЕсли КодОшибки = 2 Тогда
		
		Если ТипИзмеряемойВеличины = ПредопределенноеЗначение("Перечисление.ТипыИзмеряемыхВеличин.Вес") Тогда
			ИмяТипаИзмеряемойВеличины = НСтр("ru = 'веса'");
		ИначеЕсли ТипИзмеряемойВеличины = ПредопределенноеЗначение("Перечисление.ТипыИзмеряемыхВеличин.Объем") Тогда
			ИмяТипаИзмеряемойВеличины = НСтр("ru = 'объема'");
		ИначеЕсли ТипИзмеряемойВеличины = ПредопределенноеЗначение("Перечисление.ТипыИзмеряемыхВеличин.Длина") Тогда
			ИмяТипаИзмеряемойВеличины = НСтр("ru = 'длины'");
		КонецЕсли;
		
		ТекстСообщения = ШаблонСообщенияНеУказанТипИзмеряемойВеличины;
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаХранения%",       ТекстЕдиницыХранения);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%",          Строка(Номенклатура));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипИзмеряемойВеличины%", ИмяТипаИзмеряемойВеличины);
		
	ИначеЕсли КодОшибки = 3 Тогда
		ТекстТипаКоличества = ?(ПересчетВЕТИС, НСтр("ru = 'количество'"), НСтр("ru='количество (ВетИС)'"));
		
		ТекстСообщения = ШаблонСообщенияНеСопоставленыЕдиницыИзмерения;
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаХранения%",       ТекстЕдиницыХранения);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаИзмеренияВетИС%", Строка(ЕдиницаИзмеренияВЕТИС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%",          Строка(Номенклатура));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипКоличества%",         ТекстТипаКоличества);
	Иначе
		ТекстСообщения = "";
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

#КонецОбласти
