
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ВидОбъектаУчета = Перечисления.ВидыОбъектовУчетаНМА.РасходыНаНИОКР Тогда
		
		ВидНМА = Неопределено;
		АмортизационнаяГруппа = Неопределено;
		
		ДокументРегистрацииНаименование = "";
		ДокументРегистрацииНомер = "";
		ДокументРегистрацииДата = '000101010000';
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

