
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыЗавершение",ЭтотОбъект,ПараметрКоманды);
	ОткрытьФорму("ПланОбмена.пкОбменСМобильнымиУстройствами.ФормаВыбора",Новый Структура("МножественныйВыбор",Истина),,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение (Рез, ДополнительныеПараметры) Экспорт
	Если Рез <> Неопределено Тогда
		Для Каждого Эл Из Рез Цикл
			ОбработкаКомандыСервер(Эл,ДополнительныеПараметры);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ОбработкаКомандыСервер (Рез,ПараметрКоманды) 
	Справочники.пкСтруктураДанных.ЗарегистрироватьИзмененияПоСтруктуреДанных(ПараметрКоманды,Рез);
КонецПроцедуры	

