
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УправлениеЭлементами();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		// Изменены настройки программы в панелях администрирования
		УправлениеЭлементами();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьГруппыОС(Команда)
	
	//++ НЕ УТКА
	ОткрытьФорму("Справочник.ГруппыОСМеждународныйУчет.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТКА
	
	Возврат; // в КА пустой обработчик
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыНМА(Команда)
	
	//++ НЕ УТКА
	ОткрытьФорму("Справочник.ГруппыНМАМеждународныйУчет.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТКА
	
	Возврат; // в КА пустой обработчик
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГодовыеГрафикиАмортизацииОС(Команда)
	
	ОткрытьФорму("Справочник.ГодовыеГрафикиАмортизацииОС.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоказателиНаработки(Команда)
	
	ОткрытьФорму("Справочник.ПоказателиНаработки.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлассификаторОКОФ(Команда)
	
	ОткрытьФорму("Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлассификаторЕНАОФ(Команда)
	
	ОткрытьФорму("Справочник.ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыФинансовогоУчетаВнеоборотныхАктивов(Команда)
	
	ОткрытьФорму("Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()

	//++ НЕ УТКА
	Элементы.ОткрытьГруппыОС.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ГруппыОСМеждународныйУчет);
	Элементы.ОткрытьГруппыНМА.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ГруппыНМАМеждународныйУчет);
	//-- НЕ УТКА
	Элементы.ОткрытьКлассификаторЕНАОФ.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов);
	Элементы.ОткрытьКлассификаторОКОФ.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ОбщероссийскийКлассификаторОсновныхФондов);
	Элементы.ОткрытьПоказателиНаработки.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ПоказателиНаработки);
	Элементы.ОткрытьГодовыеГрафикиАмортизацииОС.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ГодовыеГрафикиАмортизацииОС);
	Элементы.ОткрытьГруппыФинансовогоУчетаВнеоборотныхАктивов.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ГруппыФинансовогоУчетаВнеоборотныхАктивов);

КонецПроцедуры

#КонецОбласти


