#Область СлужебныйПрограммныйИнтерфейс

Функция ПредставленияСтатейФинансирования() Экспорт
	
	Представления = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиФинансированияЗарплата.Ссылка,
	|	СтатьиФинансированияЗарплата.Код
	|ИЗ
	|	Справочник.СтатьиФинансированияЗарплата КАК СтатьиФинансированияЗарплата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Представления.Вставить(Выборка.Ссылка, СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Выборка.Код, 3, " ", "Справа"));
	КонецЦикла;
	
	Возврат Представления
	
КонецФункции

Функция ПредставленияСтатейРасходов() Экспорт
	
	Представления = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиРасходовЗарплата.Ссылка,
	|	СтатьиРасходовЗарплата.Код
	|ИЗ
	|	Справочник.СтатьиРасходовЗарплата КАК СтатьиРасходовЗарплата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Представления.Вставить(Выборка.Ссылка, СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Выборка.Код, 3, " ", "Слева"));
	КонецЦикла;
	
	Возврат Представления
	
КонецФункции

#КонецОбласти
