Перем ИмяВременногоФайла;
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ДанныеЗаписи = РегистрыСведений.пкШаблоныПодписейДокументов.ПолучитьПоследнее(Запись.Период, 
	//+++DubI Рарус-СПб 24.03.2017
		//Новый Структура("Наименование, Подразделение, ВидПечатнойФормы, СПодписью", Запись.Наименование, Запись.Подразделение, Запись.ВидПечатнойФормы, Запись.СПодписью));  
		Новый Структура("Наименование, Подразделение, ВидПечатнойФормы, СПодписью, Подписант", Запись.Наименование, Запись.Подразделение, Запись.ВидПечатнойФормы, Запись.СПодписью, Запись.Подписант));  
	//---DubI Рарус-СПб	
	
    ХранимоеЗначение = ДанныеЗаписи.Макет.Получить();
    
    Если ХранимоеЗначение <> НеОпределено Тогда
    	РасширениеВременногоФайла = ".mxl";
    	
    	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеВременногоФайла);
        
        Попытка
    		ХранимоеЗначение.Записать(ИмяВременногоФайла);
    	Исключение
    		Сообщить("Ошибка при сохранении файла: " + ОписаниеОшибки(), СтатусСообщения.Важное);
    		Возврат;
    	КонецПопытки;
    
    	ПолеРедактированияМакета.Прочитать(ИмяВременногоФайла);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
        
    ПриЗакрытииНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
    
	ВременныйФайл = Новый Файл(ИмяВременногоФайла);

	Если ВременныйФайл.Существует() Тогда
		УдалитьФайлы(ИмяВременногоФайла);
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    
	Если НЕ ЗначениеЗаполнено(ИмяВременногоФайла) Тогда
		РасширениеВременногоФайла = ".mxl";
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеВременногоФайла);
	КонецЕсли;
		
	ПолеРедактированияМакета.Записать(ИмяВременногоФайла);
	
	ВнешнийФайл = Новый ДвоичныеДанные(ИмяВременногоФайла);
    
    МенеджерЗаписи = РегистрыСведений.пкШаблоныПодписейДокументов.СоздатьМенеджерЗаписи();
	
	Запись.Пользователь = Пользователи.ТекущийПользователь();
	Запись.ДатаИзменения = ТекущаяДата();

	
    ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
	    
	МенеджерЗаписи.Макет = Новый ХранилищеЗначения(ВнешнийФайл);
    
    МенеджерЗаписи.Записать();
    
КонецПроцедуры


