
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// 1. Установим признак отказа от выполнения стандартной обработки события.
	СтандартнаяОбработка = Ложь;
	
	//// 2. Получим макет, в котором хранится "шапка" и "подвал" отчета.
	//МакетДопОформление = ЭтотОбъект.ПолучитьМакет("ПФ_MXL_ДопОформлениеСКД");
	//
	//// 3. Выведем в табличный документ шапку отчета.
	//ШапкаОтчета = МакетДопОформление.ПолучитьОбласть("ШапкаОтчета");
	//ДокументРезультат.Вывести(ШапкаОтчета);
	
	// 4. Получим копию настроек компоновки данных.
	НастройкиОтчета = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();		
	
	Период = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Период").Значение;
	
	ДатаНачала = Период.ДатаНачала;	
	
	МассивДат = Новый Массив;
	
	Пока ДатаНачала <= Период.ДатаОкончания + 1 Цикл
		
		Если ДеньНедели(ДатаНачала) = 1 Тогда
			
			МассивДат.Добавить(ДатаНачала);			
		КонецЕсли;
		
		ДатаНачала = ДатаНачала + 60 * 60 * 24;
		
	КонецЦикла;
	
	Если МассивДат.Количество() = 0 Тогда
		Сообщить("В данный период не попал ни один понедельник");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделениеТехники.Значение КАК Подразделение,
	|	&НомерНедели КАК НомерНедели,
	|	СУММА(ВЫБОР
	|			КОГДА пкСтатусыТехникиСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.ВАренде)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоНаБазе,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(пкСтатусыРемонтаТехникиСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ВРемонте)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоВРемонте
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыТехники.СрезПоследних(&Дата, ) КАК пкСтатусыТехникиСрезПоследних
	|		ПО ОбъектыЭксплуатации.Ссылка = пкСтатусыТехникиСрезПоследних.Техника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкСостояниеТехники.СрезПоследних(&Дата, Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Подразделение)) КАК ПодразделениеТехники
	|		ПО ОбъектыЭксплуатации.Ссылка = ПодразделениеТехники.Техника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыРемонтаТехники.СрезПоследних(&Дата, ) КАК пкСтатусыРемонтаТехникиСрезПоследних
	|		ПО ОбъектыЭксплуатации.Ссылка = пкСтатусыРемонтаТехникиСрезПоследних.Техника
	|ГДЕ
	|	НЕ ОбъектыЭксплуатации.ЭтоГруппа
	|	И НЕ пкСтатусыТехникиСрезПоследних.Техника ЕСТЬ NULL
	|	И пкСтатусыТехникиСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.Недоступен)
	|	И ПодразделениеТехники.Значение В(&Подразделения)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодразделениеТехники.Значение";
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	ПодразделениеТехники.Значение КАК Подразделение,
	|	&НомерНедели КАК НомерНедели,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(пкСтатусыРемонтаТехники.Регистратор) = ТИП(Документ.пкЗаказНаряд)
	|					И ЕСТЬNULL(пкСтатусыРемонтаТехники.Статус, ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ВРемонте)
	|				ТОГДА ВЫБОР
	|						КОГДА пкСтатусыРемонтаТехники.Регистратор.МестоРемонта = ЗНАЧЕНИЕ(Перечисление.пкМестоРемонта.УКлиента)
	|							ТОГДА 1
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоРемонтовУКлиента,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(пкСтатусыРемонтаТехники.Регистратор) = ТИП(Документ.пкЗаказНаряд)
	|					И ЕСТЬNULL(пкСтатусыРемонтаТехники.Статус, ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ВРемонте)
	|				ТОГДА ВЫБОР
	|						КОГДА пкСтатусыРемонтаТехники.Регистратор.МестоРемонта = ЗНАЧЕНИЕ(Перечисление.пкМестоРемонта.НаБазе)
	|							ТОГДА 1
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоРемонтовНаБазе
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыТехники.СрезПоследних(&Дата, ) КАК пкСтатусыТехникиСрезПоследних
	|		ПО ОбъектыЭксплуатации.Ссылка = пкСтатусыТехникиСрезПоследних.Техника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.пкСостояниеТехники.СрезПоследних(&Дата, Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Подразделение)) КАК ПодразделениеТехники
	|		ПО ОбъектыЭксплуатации.Ссылка = ПодразделениеТехники.Техника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыРемонтаТехники КАК пкСтатусыРемонтаТехники
	|		ПО ОбъектыЭксплуатации.Ссылка = пкСтатусыРемонтаТехники.Техника
	|ГДЕ
	|	НЕ ОбъектыЭксплуатации.ЭтоГруппа
	|	И НЕ пкСтатусыТехникиСрезПоследних.Техника ЕСТЬ NULL
	|	И пкСтатусыТехникиСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.Недоступен)
	|	И ПодразделениеТехники.Значение В(&Подразделения)
	|	И пкСтатусыРемонтаТехники.Период МЕЖДУ &ДатаНачала И &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодразделениеТехники.Значение";
	
	
	//НомерНедели = 1;
	Для каждого ДатаСреза Из МассивДат Цикл
		Если МассивДат.Найти(ДатаСреза) = 0 Тогда
			
			Запрос.УстановитьПараметр("НомерНедели",НеделяГода(ДатаСреза));
			Запрос.УстановитьПараметр("Дата",ДатаСреза + 60 * 60 * 12);
			
			Запрос2.УстановитьПараметр("НомерНедели",НеделяГода(ДатаСреза));
			Запрос2.УстановитьПараметр("Дата",ДатаСреза + 60 * 60 * 12);
			Запрос2.УстановитьПараметр("ДатаНачала",ДатаСреза - 604800 + 60 * 60 * 12);
		Иначе
			
			Запрос.Текст= Запрос.Текст +"
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПодразделениеТехники.Значение,
			|	&НомерНедели"+НеделяГода(ДатаСреза)+",
			|	СУММА(ВЫБОР
			|			КОГДА пкСтатусыТехникиСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.ВАренде)
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ),
			|	СУММА(ВЫБОР
			|			КОГДА ЕСТЬNULL(пкСтатусыРемонтаТехникиСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ВРемонте)
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ)
			|
			|ИЗ
			|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыТехники.СрезПоследних(&Дата"+Строка(НеделяГода(ДатаСреза))+", ) КАК пкСтатусыТехникиСрезПоследних
			|		ПО ОбъектыЭксплуатации.Ссылка = пкСтатусыТехникиСрезПоследних.Техника
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкСостояниеТехники.СрезПоследних(&Дата"+Строка(НеделяГода(ДатаСреза))+", Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Подразделение)) КАК ПодразделениеТехники
			|		ПО ОбъектыЭксплуатации.Ссылка = ПодразделениеТехники.Техника
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыРемонтаТехники.СрезПоследних(&Дата"+Строка(НеделяГода(ДатаСреза))+", ) КАК пкСтатусыРемонтаТехникиСрезПоследних
			|		ПО ОбъектыЭксплуатации.Ссылка = пкСтатусыРемонтаТехникиСрезПоследних.Техника
			|ГДЕ
			|	НЕ ОбъектыЭксплуатации.ЭтоГруппа
			|	И НЕ пкСтатусыТехникиСрезПоследних.Техника ЕСТЬ NULL
			|	И пкСтатусыТехникиСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.Недоступен)
			|	И ПодразделениеТехники.Значение В (&Подразделения)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПодразделениеТехники.Значение";
			
			
			
			
			Запрос2.Текст= Запрос2.Текст +"
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|	ПодразделениеТехники.Значение КАК Подразделение,
			|	&НомерНедели"+НеделяГода(ДатаСреза)+",
			|	СУММА(ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(пкСтатусыРемонтаТехники.Регистратор) = ТИП(Документ.пкЗаказНаряд)
			|					И ЕСТЬNULL(пкСтатусыРемонтаТехники.Статус, ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ВРемонте)
			|				ТОГДА ВЫБОР
			|						КОГДА пкСтатусыРемонтаТехники.Регистратор.МестоРемонта = ЗНАЧЕНИЕ(Перечисление.пкМестоРемонта.УКлиента)
			|							ТОГДА 1
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КоличествоРемонтовУКлиента,
			|	СУММА(ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(пкСтатусыРемонтаТехники.Регистратор) = ТИП(Документ.пкЗаказНаряд)
			|					И ЕСТЬNULL(пкСтатусыРемонтаТехники.Статус, ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.пкСтатусыРемонтаТехники.ВРемонте)
			|				ТОГДА ВЫБОР
			|						КОГДА пкСтатусыРемонтаТехники.Регистратор.МестоРемонта = ЗНАЧЕНИЕ(Перечисление.пкМестоРемонта.НаБазе)
			|							ТОГДА 1
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КоличествоРемонтовНаБазе
			|ИЗ
			|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыТехники.СрезПоследних(&Дата"+Строка(НеделяГода(ДатаСреза))+", ) КАК пкСтатусыТехникиСрезПоследних
			|		ПО ОбъектыЭксплуатации.Ссылка = пкСтатусыТехникиСрезПоследних.Техника
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.пкСостояниеТехники.СрезПоследних(&Дата"+Строка(НеделяГода(ДатаСреза))+", Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Подразделение)) КАК ПодразделениеТехники
			|		ПО ОбъектыЭксплуатации.Ссылка = ПодразделениеТехники.Техника
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыРемонтаТехники КАК пкСтатусыРемонтаТехники
			|		ПО ОбъектыЭксплуатации.Ссылка = пкСтатусыРемонтаТехники.Техника
			|ГДЕ
			|	НЕ ОбъектыЭксплуатации.ЭтоГруппа
			|	И НЕ пкСтатусыТехникиСрезПоследних.Техника ЕСТЬ NULL
			|	И пкСтатусыТехникиСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.Недоступен)
			|	И ПодразделениеТехники.Значение В(&Подразделения)
			|	И пкСтатусыРемонтаТехники.Период МЕЖДУ &ДатаНачала"+Строка(НеделяГода(ДатаСреза))+" И &Дата"+Строка(НеделяГода(ДатаСреза))+"
			|
			|СГРУППИРОВАТЬ ПО
			|	ПодразделениеТехники.Значение";
			
			Запрос.УстановитьПараметр("НомерНедели"+НеделяГода(ДатаСреза),НеделяГода(ДатаСреза));
			Запрос.УстановитьПараметр("Дата"+НеделяГода(ДатаСреза),ДатаСреза + 60 * 60 * 12);
			
			Запрос2.УстановитьПараметр("НомерНедели"+НеделяГода(ДатаСреза),НеделяГода(ДатаСреза));
			Запрос2.УстановитьПараметр("Дата"+НеделяГода(ДатаСреза),ДатаСреза + 60 * 60 * 12);
			Запрос2.УстановитьПараметр("ДатаНачала"+НеделяГода(ДатаСреза),ДатаСреза - 604800 + 60 * 60 * 12);
			
		КонецЕсли;	
		
		
	КонецЦикла;
	
	Запрос.Текст= Запрос.Текст +"
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерНедели ВОЗР";
	
		Запрос2.Текст= Запрос2.Текст +"
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерНедели ВОЗР";

	
	Запрос.УстановитьПараметр("Подразделения",НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Подразделения").Значение);
	Запрос2.УстановитьПараметр("Подразделения",НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Подразделения").Значение);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ2 = Запрос2.Выполнить().Выгрузить();
	
	
	// 6. Загрузим настройки в компоновщик (пользовательские настройки заново заполняются на основе этих настроек).
	ЭтотОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	
	// 7. Создадим объект для компоновки макета и выполним компоновку макета.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
	ЭтотОбъект.СхемаКомпоновкиДанных,
	ЭтотОбъект.КомпоновщикНастроек.Настройки,
	ДанныеРасшифровки);
	
	ВнешнийНаборДанных = Новый Структура("ТЗ,ТЗ2", ТЗ,ТЗ2);
	
	// 8. Создадим объект, выполняющий компоновку данных, и инициализируем его.
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешнийНаборДанных , ДанныеРасшифровки, Истина);
	
	// 9. Создадим объект для вывода результата компоновки в табличный документ, установим табличный документ, в который нужно вывести результат и выведем весь результат в установленный табличный документ.
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// 10. Выведем в табличный документ подвал отчета.
	//ПодвалОтчета = МакетДопОформление.ПолучитьОбласть("ПодвалОтчета");
	//ДокументРезультат.Вывести(ПодвалОтчета);
КонецПроцедуры
