
Процедура СформироватьПакетЗапросов(НаборыЗапросов)
	
	ЭталонныйТипДанных = ЭтотОбъект.ДанныеОтчета[0].ТипДанных;
	
	Для Каждого СравниваемыеДанные Из ЭтотОбъект.ДанныеОтчета Цикл
		
		СравниваемыйТипДанных = СравниваемыеДанные.ТипДанных;
		
		Если ЭталонныйТипДанных = "План" И СравниваемыйТипДанных = "Факт" Тогда
			
			ДобавитьФакт_План(СравниваемыеДанные, ЭтотОбъект.ДанныеОтчета[0], НаборыЗапросов);
			
		ИначеЕсли ЭталонныйТипДанных = "Факт" И СравниваемыйТипДанных = "План" Тогда
			
			ДобавитьПлан_Факт(СравниваемыеДанные, ЭтотОбъект.ДанныеОтчета[0], НаборыЗапросов);
			
		ИначеЕсли ЭталонныйТипДанных = "План" И СравниваемыйТипДанных = "План" Тогда
			
			ДобавитьПлан_План(СравниваемыеДанные, ЭтотОбъект.ДанныеОтчета[0], НаборыЗапросов);
			
		ИначеЕсли ЭталонныйТипДанных = "Факт" И СравниваемыйТипДанных = "Факт" Тогда
			
			ДобавитьФакт_Факт(СравниваемыеДанные, ЭтотОбъект.ДанныеОтчета[0], НаборыЗапросов);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Эталонные данные - "Факт", текущие данные - "План"
Процедура ДобавитьПлан_Факт(СравниваемыеДанные, ЭталонныеДанные, НаборыЗапросов)
	
	НомерСтроки = СравниваемыеДанные.НомерСтроки;
	
	ТекстЗапроса =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
	|	РезультатАнализа.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Организация) КАК ОрганизацияПредставление,
	|	РезультатАнализа.Сценарий КАК Сценарий,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Сценарий) КАК СценарийПредставление,
	|	РезультатАнализа.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
	|	РезультатАнализа.ТС КАК ТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТС) КАК ТСПредставление,
	|	РезультатАнализа.МодельТС КАК МодельТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.МодельТС) КАК МодельТСПредставление,
	|	РезультатАнализа.ТипТС КАК ТипТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТипТС) КАК ТипТСПредставление,
	|	РезультатАнализа.ДокументПланирования КАК ДокументПланирования,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ДокументПланирования) КАК ДокументПланированияПредставление,
	|	РезультатАнализа.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
	|	РезультатАнализа.ПараметрВыработки КАК ПараметрВыработки,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ПараметрВыработки) КАК ПараметрВыработкиПредставление,
	|	РезультатАнализа.Заказ КАК Заказ,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
	|	РезультатАнализа.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
	|	РезультатАнализа.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
	|	РезультатАнализа.Маршрут КАК Маршрут,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Маршрут) КАК МаршрутПредставление,
	|	РезультатАнализа.ВидБилета КАК ВидБилета,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ВидБилета) КАК ВидБилетаПредставление,
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.Количество ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.Количество < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.Количество / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.Количество / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоБазовыхЕдиниц
	|	КОНЕЦ КАК КоличествоБазовыхЕдиниц,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоЕдиницОтчетов ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоЕдиницОтчетов < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоЕдиницОтчетов
	|	КОНЕЦ КАК КоличествоЕдиницОтчетов,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоОтклонение
	|	КОНЕЦ КАК КоличествоОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоБазовыхЕдиницОтклонение
	|	КОНЕЦ КАК КоличествоБазовыхЕдиницОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоЕдиницОтчетовОтклонение
	|	КОНЕЦ КАК КоличествоЕдиницОтчетовОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.Количество = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.Количество = РезультатАнализа.КоличествоОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	РезультатАнализа.НДС КАК НДС,
	|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьБезНДС = РезультатАнализа.СтоимостьБезНДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.НДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.НДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.НДС = РезультатАнализа.НДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьСНДС = РезультатАнализа.СтоимостьСНДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Сценарий.*,
	|	Подразделение.*,
	|	ТС.*,
	|	МодельТС.*,
	|	ТипТС.*,
	|	ДокументПланирования.*,
	|	Номенклатура.*,
	|	ПараметрВыработки.*,
	|	Заказ.*,
	|	Контрагент.*,
	|	Договор.*,
	|	Маршрут.*,
	|	ВидБилета.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоБазовыхЕдиниц,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоОтклонение,
	|	КоличествоБазовыхЕдиницОтклонение,
	|	КоличествоЕдиницОтчетовОтклонение,
	|	КоличествоОтклонениеПроцент,
	|	СтоимостьБезНДС,
	|	НДС,
	|	СтоимостьСНДС,
	|	СтоимостьБезНДСОтклонение,
	|	СтоимостьБезНДСОтклонениеПроцент,
	|	НДСОтклонение,
	|	НДСОтклонениеПроцент,
	|	СтоимостьСНДСОтклонение,
	|	СтоимостьСНДСОтклонениеПроцент}
	|ИЗ
	|	(ВЫБРАТЬ
	|		АнализируемыеДанные.Период КАК Период,
	|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
	|		АнализируемыеДанные.Регистратор КАК Регистратор,
	|		АнализируемыеДанные.Организация КАК Организация,
	|		АнализируемыеДанные.Сценарий КАК Сценарий,
	|		АнализируемыеДанные.Подразделение КАК Подразделение,
	|		АнализируемыеДанные.ТС КАК ТС,
	|		АнализируемыеДанные.МодельТС КАК МодельТС,
	|		АнализируемыеДанные.ТипТС КАК ТипТС,
	|		АнализируемыеДанные.ДокументПланирования КАК ДокументПланирования,
	|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
	|		АнализируемыеДанные.ПараметрВыработки КАК ПараметрВыработки,
	|		АнализируемыеДанные.Заказ КАК Заказ,
	|		АнализируемыеДанные.Контрагент КАК Контрагент,
	|		АнализируемыеДанные.Договор КАК Договор,
	|		АнализируемыеДанные.Маршрут КАК Маршрут,
	|		АнализируемыеДанные.ВидБилета КАК ВидБилета,
	|		СУММА(АнализируемыеДанные.ПланКоличество) КАК Количество,
	|		СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	|		СУММА(АнализируемыеДанные.ПланКоличество) - СУММА(АнализируемыеДанные.ФактКоличество) КАК КоличествоОтклонение,
	|		СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиниц) - СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиницОтклонение,
	|		СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетов) - СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетовОтклонение,
	|		СУММА(АнализируемыеДанные.ПланСтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		СУММА(АнализируемыеДанные.ПланНДС) КАК НДС,
	|		СУММА(АнализируемыеДанные.ПланСтоимостьСНДС) КАК СтоимостьСНДС,
	|		СУММА(АнализируемыеДанные.ПланСтоимостьБезНДС) - СУММА(АнализируемыеДанные.ФактСтоимостьБезНДС) КАК СтоимостьБезНДСОтклонение,
	|		СУММА(АнализируемыеДанные.ПланНДС) - СУММА(АнализируемыеДанные.ФактНДС) КАК НДСОтклонение,
	|		СУММА(АнализируемыеДанные.ПланСтоимостьСНДС) - СУММА(АнализируемыеДанные.ФактСтоимостьСНДС) КАК СтоимостьСНДСОтклонение
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПланРаботыТСОбороты.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ГОД) КАК ПериодГод,
	|			ПланРаботыТСОбороты.Регистратор КАК Регистратор,
	|			ПланРаботыТСОбороты.ДокументПланирования.Организация КАК Организация,
	|			ПланРаботыТСОбороты.Сценарий КАК Сценарий,
	|			ПланРаботыТСОбороты.Подразделение КАК Подразделение,
	|			ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|					ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)
	|			КОНЕЦ КАК Справочник.ТранспортныеСредства) КАК ТС,
	|			ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|					ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.уатМодель
	|				КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
	|					ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уатМоделиТС.ПустаяСсылка)
	|			КОНЕЦ КАК Справочник.уатМоделиТС) КАК МодельТС,
	|			ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|					ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.Тип
	|				КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
	|					ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.ТипТС
	|				ИНАЧЕ ПланРаботыТСОбороты.ДетализацияПланирования
	|			КОНЕЦ КАК Справочник.ТипыТранспортныхСредств) КАК ТипТС,
	|			ПланРаботыТСОбороты.ДокументПланирования КАК ДокументПланирования,
	|			ПланРаботыТСОбороты.Номенклатура КАК Номенклатура,
	|			ПланРаботыТСОбороты.ПараметрВыработки КАК ПараметрВыработки,
	|			ПланРаботыТСОбороты.Заказ КАК Заказ,
	|			ПланРаботыТСОбороты.Контрагент КАК Контрагент,
	|			ПланРаботыТСОбороты.Договор КАК Договор,
	|			ПланРаботыТСОбороты.Маршрут КАК Маршрут,
	|			ПланРаботыТСОбороты.ВидБилета КАК ВидБилета,
	|			ПланРаботыТСОбороты.КоличествоОборот КАК ПланКоличество,
	|			ПланРаботыТСОбороты.КоличествоОборот КАК ПланКоличествоБазовыхЕдиниц,
	|			ПланРаботыТСОбороты.КоличествоОборот КАК ПланКоличествоЕдиницОтчетов,
	|			0 КАК ФактКоличество,
	|			0 КАК ФактКоличествоБазовыхЕдиниц,
	|			0 КАК ФактКоличествоЕдиницОтчетов,
	|			ПланРаботыТСОбороты.СтоимостьОборот КАК ПланСтоимостьБезНДС,
	|			ПланРаботыТСОбороты.НДСОборот КАК ПланНДС,
	|			ПланРаботыТСОбороты.СтоимостьОборот + ПланРаботыТСОбороты.НДСОборот КАК ПланСтоимостьСНДС,
	|			0 КАК ФактСтоимостьБезНДС,
	|			0 КАК ФактНДС,
	|			0 КАК ФактСтоимостьСНДС
	|		ИЗ
	|			РегистрНакопления.уатПланРаботыТС.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ВЫБОР КОГДА &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ Сценарий = &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " КОНЕЦ) КАК ПланРаботыТСОбороты
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВыработкаОбороты.Период,
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ДЕНЬ),
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, НЕДЕЛЯ),
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ДЕКАДА),
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, МЕСЯЦ),
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, КВАРТАЛ),
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ПОЛУГОДИЕ),
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ГОД),
	|			ВыработкаОбороты.Регистратор,
	|			ВыработкаОбороты.Организация,
	|			NULL,
	|			ВыработкаОбороты.Подразделение,
	|			ВыработкаОбороты.ТС,
	|			ВыработкаОбороты.ТС.уатМодель,
	|			ВыработкаОбороты.ТС.Тип,
	|			NULL,
	|			NULL,
	|			ВыработкаОбороты.ПараметрВыработки,
	|			NULL,
	|			ВыработкаОбороты.Контрагент,
	|			NULL,
	|			ВыработкаОбороты.Маршрут,
	|			NULL,
	|			0,
	|			0,
	|			0,
	|			ВыработкаОбороты.КоличествоОборот,
	|			NULL,
	|			NULL,
	|			0,
	|			0,
	|			0,
	|			NULL,
	|			NULL,
	|			NULL
	|		ИЗ
	|			РегистрНакопления.уатВыработкаТС.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, ) КАК ВыработкаОбороты
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВыручкаОбороты.Период,
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ДЕНЬ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, НЕДЕЛЯ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ДЕКАДА),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, МЕСЯЦ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, КВАРТАЛ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ПОЛУГОДИЕ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ГОД),
	|			ВыручкаОбороты.Регистратор,
	|			ВыручкаОбороты.Организация,
	|			NULL,
	|			NULL,
	|			ВыручкаОбороты.ТС,
	|			ВыручкаОбороты.ТС.уатМодель,
	|			ВыручкаОбороты.ТС.Тип,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			ВыручкаОбороты.Маршрут,
	|			ВыручкаОбороты.Билет.ВидБилета,
	|			0,
	|			0,
	|			0,
	|			ВыручкаОбороты.КоличествоОборот,
	|			NULL,
	|			NULL,
	|			0,
	|			0,
	|			0,
	|			ВыручкаОбороты.СуммаОборот,
	|			NULL,
	|			NULL
	|		ИЗ
	|			РегистрНакопления.уатВыручка.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, ) КАК ВыручкаОбороты) КАК АнализируемыеДанные
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АнализируемыеДанные.Организация,
	|		АнализируемыеДанные.Сценарий,
	|		АнализируемыеДанные.Подразделение,
	|		АнализируемыеДанные.ТС,
	|		АнализируемыеДанные.МодельТС,
	|		АнализируемыеДанные.ТипТС,
	|		АнализируемыеДанные.ДокументПланирования,
	|		АнализируемыеДанные.Номенклатура,
	|		АнализируемыеДанные.ПараметрВыработки,
	|		АнализируемыеДанные.Заказ,
	|		АнализируемыеДанные.Контрагент,
	|		АнализируемыеДанные.Договор,
	|		АнализируемыеДанные.Маршрут,
	|		АнализируемыеДанные.ВидБилета,
	|		АнализируемыеДанные.Регистратор,
	|		АнализируемыеДанные.Период,
	|		АнализируемыеДанные.ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
	|{ГДЕ
	|	РезультатАнализа.Организация.*,
	|	РезультатАнализа.Сценарий.*,
	|	РезультатАнализа.Подразделение.*,
	|	РезультатАнализа.ТС.*,
	|	РезультатАнализа.МодельТС.*,
	|	РезультатАнализа.ТипТС.*,
	|	РезультатАнализа.ДокументПланирования.*,
	|	РезультатАнализа.Номенклатура.*,
	|	РезультатАнализа.ПараметрВыработки.*,
	|	РезультатАнализа.Заказ.*,
	|	РезультатАнализа.Контрагент.*,
	|	РезультатАнализа.Договор.*,
	|	РезультатАнализа.Маршрут.*,
	|	РезультатАнализа.ВидБилета.*,
	|	РезультатАнализа.Регистратор.*,
	|	РезультатАнализа.Период,
	|	РезультатАнализа.ПериодДень,
	|	РезультатАнализа.ПериодНеделя,
	|	РезультатАнализа.ПериодДекада,
	|	РезультатАнализа.ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие,
	|	РезультатАнализа.ПериодГод,
	|	РезультатАнализа.Количество,
	|	РезультатАнализа.КоличествоБазовыхЕдиниц,
	|	РезультатАнализа.КоличествоЕдиницОтчетов,
	|	РезультатАнализа.КоличествоОтклонение,
	|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение,
	|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.Количество = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.Количество = РезультатАнализа.КоличествоОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС,
	|	РезультатАнализа.НДС,
	|	РезультатАнализа.СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.СтоимостьБезНДС = РезультатАнализа.СтоимостьБезНДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.НДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.НДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.НДС = РезультатАнализа.НДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.СтоимостьСНДС = РезультатАнализа.СтоимостьСНДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьСНДСОтклонениеПроцент,
	|	(ВЫБОР
	|		КОГДА РезультатАнализа.ТС.уатДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА РезультатАнализа.ТС.уатДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЛОЖЬ
	|		КОНЕЦ) КАК ТСВыбыло}";
	
	Набор = НаборыЗапросов.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	Набор.АвтоЗаполнениеДоступныхПолей = Истина;
	Набор.Запрос = ТекстЗапроса;
	Набор.Имя    = "НаборДанных" + НомерСтроки;
	Набор.ИсточникДанных = "ИсточникДанныхКомпоновки";
	
КонецПроцедуры // ДобавитьПлан_Факт()

// Эталонные данные - "План", текущие данные - "Факт"
Процедура ДобавитьФакт_План(СравниваемыеДанные, ЭталонныеДанные, НаборыЗапросов)
	
	НомерСтроки = СравниваемыеДанные.НомерСтроки;
	
	ТекстЗапроса =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
	|	РезультатАнализа.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Организация) КАК ОрганизацияПредставление,
	|	РезультатАнализа.Сценарий КАК Сценарий,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Сценарий) КАК СценарийПредставление,
	|	РезультатАнализа.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
	|	РезультатАнализа.ТС КАК ТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТС) КАК ТСПредставление,
	|	РезультатАнализа.МодельТС КАК МодельТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.МодельТС) КАК МодельТСПредставление,
	|	РезультатАнализа.ТипТС КАК ТипТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТипТС) КАК ТипТСПредставление,
	|	РезультатАнализа.ДокументПланирования КАК ДокументПланирования,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ДокументПланирования) КАК ДокументПланированияПредставление,
	|	РезультатАнализа.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
	|	РезультатАнализа.ПараметрВыработки КАК ПараметрВыработки,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ПараметрВыработки) КАК ПараметрВыработкиПредставление,
	|	РезультатАнализа.Заказ КАК Заказ,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
	|	РезультатАнализа.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
	|	РезультатАнализа.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
	|	РезультатАнализа.Маршрут КАК Маршрут,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Маршрут) КАК МаршрутПредставление,
	|	РезультатАнализа.ВидБилета КАК ВидБилета,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ВидБилета) КАК ВидБилетаПредставление,
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.Количество ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.Количество < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.Количество / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.Количество / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоБазовыхЕдиниц
	|	КОНЕЦ КАК КоличествоБазовыхЕдиниц,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоЕдиницОтчетов ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоЕдиницОтчетов < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоЕдиницОтчетов
	|	КОНЕЦ КАК КоличествоЕдиницОтчетов,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоОтклонение
	|	КОНЕЦ КАК КоличествоОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоБазовыхЕдиницОтклонение
	|	КОНЕЦ КАК КоличествоБазовыхЕдиницОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоЕдиницОтчетовОтклонение
	|	КОНЕЦ КАК КоличествоЕдиницОтчетовОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.Количество = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.Количество = РезультатАнализа.КоличествоОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	РезультатАнализа.НДС КАК НДС,
	|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьБезНДС = РезультатАнализа.СтоимостьБезНДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.НДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.НДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.НДС = РезультатАнализа.НДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьСНДС = РезультатАнализа.СтоимостьСНДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Сценарий.*,
	|	Подразделение.*,
	|	ТС.*,
	|	МодельТС.*,
	|	ТипТС.*,
	|	ДокументПланирования.*,
	|	Номенклатура.*,
	|	ПараметрВыработки.*,
	|	Заказ.*,
	|	Контрагент.*,
	|	Договор.*,
	|	Маршрут.*,
	|	ВидБилета.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоБазовыхЕдиниц,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоОтклонение,
	|	КоличествоБазовыхЕдиницОтклонение,
	|	КоличествоЕдиницОтчетовОтклонение,
	|	КоличествоОтклонениеПроцент,
	|	СтоимостьБезНДС,
	|	НДС,
	|	СтоимостьСНДС,
	|	СтоимостьБезНДСОтклонение,
	|	СтоимостьБезНДСОтклонениеПроцент,
	|	НДСОтклонение,
	|	НДСОтклонениеПроцент,
	|	СтоимостьСНДСОтклонение,
	|	СтоимостьСНДСОтклонениеПроцент}
	|ИЗ
	|	(ВЫБРАТЬ
	|		АнализируемыеДанные.Период КАК Период,
	|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
	|		АнализируемыеДанные.Регистратор КАК Регистратор,
	|		АнализируемыеДанные.Организация КАК Организация,
	|		АнализируемыеДанные.Сценарий КАК Сценарий,
	|		АнализируемыеДанные.Подразделение КАК Подразделение,
	|		АнализируемыеДанные.ТС КАК ТС,
	|		АнализируемыеДанные.МодельТС КАК МодельТС,
	|		АнализируемыеДанные.ТипТС КАК ТипТС,
	|		АнализируемыеДанные.ДокументПланирования КАК ДокументПланирования,
	|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
	|		АнализируемыеДанные.ПараметрВыработки КАК ПараметрВыработки,
	|		АнализируемыеДанные.Заказ КАК Заказ,
	|		АнализируемыеДанные.Контрагент КАК Контрагент,
	|		АнализируемыеДанные.Договор КАК Договор,
	|		АнализируемыеДанные.Маршрут КАК Маршрут,
	|		АнализируемыеДанные.ВидБилета КАК ВидБилета,
	|		СУММА(АнализируемыеДанные.ФактКоличество) КАК Количество,
	|		СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	|		СУММА(АнализируемыеДанные.ФактКоличество) - СУММА(АнализируемыеДанные.ПланКоличество) КАК КоличествоОтклонение,
	|		СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиниц) - СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиницОтклонение,
	|		СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетов) - СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетовОтклонение,
	|		СУММА(АнализируемыеДанные.ФактСтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		СУММА(АнализируемыеДанные.ФактНДС) КАК НДС,
	|		СУММА(АнализируемыеДанные.ФактСтоимостьСНДС) КАК СтоимостьСНДС,
	|		СУММА(АнализируемыеДанные.ФактСтоимостьБезНДС) - СУММА(АнализируемыеДанные.ПланСтоимостьБезНДС) КАК СтоимостьБезНДСОтклонение,
	|		СУММА(АнализируемыеДанные.ФактНДС) - СУММА(АнализируемыеДанные.ПланНДС) КАК НДСОтклонение,
	|		СУММА(АнализируемыеДанные.ФактСтоимостьСНДС) - СУММА(АнализируемыеДанные.ПланСтоимостьСНДС) КАК СтоимостьСНДСОтклонение
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВыработкаОбороты.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ГОД) КАК ПериодГод,
	|			ВыработкаОбороты.Регистратор КАК Регистратор,
	|			ВыработкаОбороты.Организация КАК Организация,
	|			NULL КАК Сценарий,
	|			ВыработкаОбороты.Подразделение КАК Подразделение,
	|			ВыработкаОбороты.ТС КАК ТС,
	|			ВыработкаОбороты.ТС.уатМодель КАК МодельТС,
	|			ВыработкаОбороты.ТС.Тип КАК ТипТС,
	|			NULL КАК ДокументПланирования,
	|			NULL КАК Номенклатура,
	|			ВыработкаОбороты.ПараметрВыработки КАК ПараметрВыработки,
	|			NULL КАК Заказ,
	|			ВыработкаОбороты.Контрагент КАК Контрагент,
	|			NULL КАК Договор,
	|			ВыработкаОбороты.Маршрут КАК Маршрут,
	|			NULL КАК ВидБилета,
	|			ВыработкаОбороты.КоличествоОборот КАК ФактКоличество,
	|			NULL КАК ФактКоличествоБазовыхЕдиниц,
	|			NULL КАК ФактКоличествоЕдиницОтчетов,
	|			0 КАК ПланКоличество,
	|			0 КАК ПланКоличествоБазовыхЕдиниц,
	|			0 КАК ПланКоличествоЕдиницОтчетов,
	|			NULL КАК ФактСтоимостьБезНДС,
	|			NULL КАК ФактНДС,
	|			NULL КАК ФактСтоимостьСНДС,
	|			0 КАК ПланСтоимостьБезНДС,
	|			0 КАК ПланНДС,
	|			0 КАК ПланСтоимостьСНДС
	|		ИЗ
	|			РегистрНакопления.уатВыработкаТС.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ) КАК ВыработкаОбороты
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВыручкаОбороты.Период,
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ДЕНЬ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, НЕДЕЛЯ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ДЕКАДА),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, МЕСЯЦ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, КВАРТАЛ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ПОЛУГОДИЕ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ГОД),
	|			ВыручкаОбороты.Регистратор,
	|			ВыручкаОбороты.Организация,
	|			NULL,
	|			NULL,
	|			ВыручкаОбороты.ТС,
	|			ВыручкаОбороты.ТС.уатМодель,
	|			ВыручкаОбороты.ТС.Тип,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			ВыручкаОбороты.Маршрут,
	|			ВыручкаОбороты.Билет.ВидБилета,
	|			ВыручкаОбороты.КоличествоОборот,
	|			NULL,
	|			NULL,
	|			0,
	|			0,
	|			0,
	|			ВыручкаОбороты.СуммаОборот,
	|			NULL,
	|			NULL,
	|			0,
	|			0,
	|			0
	|		ИЗ
	|			РегистрНакопления.уатВыручка.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ) КАК ВыручкаОбороты
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ПланРаботыТСОбороты.Период,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ДЕНЬ),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, НЕДЕЛЯ),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ДЕКАДА),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, МЕСЯЦ),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, КВАРТАЛ),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ПОЛУГОДИЕ),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ГОД),
	|			ПланРаботыТСОбороты.Регистратор,
	|			ПланРаботыТСОбороты.ДокументПланирования.Организация,
	|			ПланРаботыТСОбороты.Сценарий,
	|			ПланРаботыТСОбороты.Подразделение,
	|			ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|						ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)
	|				КОНЕЦ КАК Справочник.ТранспортныеСредства),
	|			ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|						ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.уатМодель
	|					КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
	|						ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уатМоделиТС.ПустаяСсылка)
	|				КОНЕЦ КАК Справочник.уатМоделиТС),
	|			ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|						ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.Тип
	|					КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
	|						ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.ТипТС
	|					ИНАЧЕ ПланРаботыТСОбороты.ДетализацияПланирования
	|				КОНЕЦ КАК Справочник.ТипыТранспортныхСредств),
	|			ПланРаботыТСОбороты.ДокументПланирования,
	|			ПланРаботыТСОбороты.Номенклатура,
	|			ПланРаботыТСОбороты.ПараметрВыработки,
	|			ПланРаботыТСОбороты.Заказ,
	|			ПланРаботыТСОбороты.Контрагент,
	|			ПланРаботыТСОбороты.Договор,
	|			ПланРаботыТСОбороты.Маршрут,
	|			ПланРаботыТСОбороты.ВидБилета,
	|			0,
	|			0,
	|			0,
	|			ПланРаботыТСОбороты.КоличествоОборот,
	|			ПланРаботыТСОбороты.КоличествоОборот,
	|			ПланРаботыТСОбороты.КоличествоОборот,
	|			0,
	|			0,
	|			0,
	|			ПланРаботыТСОбороты.СтоимостьОборот,
	|			ПланРаботыТСОбороты.НДСОборот,
	|			ПланРаботыТСОбороты.СтоимостьОборот + ПланРаботыТСОбороты.НДСОборот
	|		ИЗ
	|			РегистрНакопления.уатПланРаботыТС.Обороты(
	|					&ДатаНач1,
	|					&ДатаКон1,
	|					Регистратор,
	|					ВЫБОР
	|						КОГДА &Сценарий1 = НЕОПРЕДЕЛЕНО
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Сценарий = &Сценарий1
	|					КОНЕЦ) КАК ПланРаботыТСОбороты) КАК АнализируемыеДанные
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АнализируемыеДанные.Организация,
	|		АнализируемыеДанные.Сценарий,
	|		АнализируемыеДанные.Подразделение,
	|		АнализируемыеДанные.ТС,
	|		АнализируемыеДанные.МодельТС,
	|		АнализируемыеДанные.ТипТС,
	|		АнализируемыеДанные.ДокументПланирования,
	|		АнализируемыеДанные.Номенклатура,
	|		АнализируемыеДанные.ПараметрВыработки,
	|		АнализируемыеДанные.Заказ,
	|		АнализируемыеДанные.Контрагент,
	|		АнализируемыеДанные.Договор,
	|		АнализируемыеДанные.Маршрут,
	|		АнализируемыеДанные.ВидБилета,
	|		АнализируемыеДанные.Регистратор,
	|		АнализируемыеДанные.Период,
	|		АнализируемыеДанные.ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
	|{ГДЕ
	|	РезультатАнализа.Организация.*,
	|	РезультатАнализа.Сценарий.*,
	|	РезультатАнализа.Подразделение.*,
	|	РезультатАнализа.ТС.*,
	|	РезультатАнализа.МодельТС.*,
	|	РезультатАнализа.ТипТС.*,
	|	РезультатАнализа.ДокументПланирования.*,
	|	РезультатАнализа.Номенклатура.*,
	|	РезультатАнализа.ПараметрВыработки.*,
	|	РезультатАнализа.Заказ.*,
	|	РезультатАнализа.Контрагент.*,
	|	РезультатАнализа.Договор.*,
	|	РезультатАнализа.Маршрут.*,
	|	РезультатАнализа.ВидБилета.*,
	|	РезультатАнализа.Регистратор.*,
	|	РезультатАнализа.Период,
	|	РезультатАнализа.ПериодДень,
	|	РезультатАнализа.ПериодНеделя,
	|	РезультатАнализа.ПериодДекада,
	|	РезультатАнализа.ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие,
	|	РезультатАнализа.ПериодГод,
	|	РезультатАнализа.Количество,
	|	РезультатАнализа.КоличествоБазовыхЕдиниц,
	|	РезультатАнализа.КоличествоЕдиницОтчетов,
	|	РезультатАнализа.КоличествоОтклонение,
	|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение,
	|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.Количество = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.Количество = РезультатАнализа.КоличествоОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС,
	|	РезультатАнализа.НДС,
	|	РезультатАнализа.СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.СтоимостьБезНДС = РезультатАнализа.СтоимостьБезНДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.НДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.НДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.НДС = РезультатАнализа.НДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.СтоимостьСНДС = РезультатАнализа.СтоимостьСНДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьСНДСОтклонениеПроцент,
	|	(ВЫБОР
	|		КОГДА РезультатАнализа.ТС.уатДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА РезультатАнализа.ТС.уатДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЛОЖЬ
	|		КОНЕЦ) КАК ТСВыбыло}";
	
	Набор = НаборыЗапросов.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	Набор.АвтоЗаполнениеДоступныхПолей = Истина;
	Набор.Запрос = ТекстЗапроса;
	Набор.Имя    = "НаборДанных" + НомерСтроки;
	Набор.ИсточникДанных = "ИсточникДанныхКомпоновки";
	
КонецПроцедуры // ДобавитьФакт_План()

// Эталонные данные - "План", текущие данные - "План"
Процедура ДобавитьПлан_План(СравниваемыеДанные, ЭталонныеДанные, НаборыЗапросов)
	
	НомерСтроки = СравниваемыеДанные.НомерСтроки;
	
	ТекстЗапроса =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
	|	РезультатАнализа.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Организация) КАК ОрганизацияПредставление,
	|	РезультатАнализа.Сценарий КАК Сценарий,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Сценарий) КАК СценарийПредставление,
	|	РезультатАнализа.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
	|	РезультатАнализа.ТС КАК ТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТС) КАК ТСПредставление,
	|	РезультатАнализа.МодельТС КАК МодельТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.МодельТС) КАК МодельТСПредставление,
	|	РезультатАнализа.ТипТС КАК ТипТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТипТС) КАК ТипТСПредставление,
	|	РезультатАнализа.ДокументПланирования КАК ДокументПланирования,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ДокументПланирования) КАК ДокументПланированияПредставление,
	|	РезультатАнализа.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
	|	РезультатАнализа.ПараметрВыработки КАК ПараметрВыработки,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ПараметрВыработки) КАК ПараметрВыработкиПредставление,
	|	РезультатАнализа.Заказ КАК Заказ,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
	|	РезультатАнализа.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
	|	РезультатАнализа.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
	|	РезультатАнализа.Маршрут КАК Маршрут,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Маршрут) КАК МаршрутПредставление,
	|	РезультатАнализа.ВидБилета КАК ВидБилета,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ВидБилета) КАК ВидБилетаПредставление,
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.Количество ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.Количество < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.Количество / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.Количество / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоБазовыхЕдиниц
	|	КОНЕЦ КАК КоличествоБазовыхЕдиниц,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоЕдиницОтчетов ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоЕдиницОтчетов < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоЕдиницОтчетов
	|	КОНЕЦ КАК КоличествоЕдиницОтчетов,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоОтклонение
	|	КОНЕЦ КАК КоличествоОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоБазовыхЕдиницОтклонение
	|	КОНЕЦ КАК КоличествоБазовыхЕдиницОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоЕдиницОтчетовОтклонение
	|	КОНЕЦ КАК КоличествоЕдиницОтчетовОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.Количество = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.Количество = РезультатАнализа.КоличествоОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	РезультатАнализа.НДС КАК НДС,
	|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьБезНДС = РезультатАнализа.СтоимостьБезНДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.НДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.НДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.НДС = РезультатАнализа.НДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьСНДС = РезультатАнализа.СтоимостьСНДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Сценарий.*,
	|	Подразделение.*,
	|	ТС.*,
	|	МодельТС.*,
	|	ТипТС.*,
	|	ДокументПланирования.*,
	|	Номенклатура.*,
	|	ПараметрВыработки.*,
	|	Заказ.*,
	|	Контрагент.*,
	|	Договор.*,
	|	Маршрут.*,
	|	ВидБилета.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоБазовыхЕдиниц,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоОтклонение,
	|	КоличествоБазовыхЕдиницОтклонение,
	|	КоличествоЕдиницОтчетовОтклонение,
	|	КоличествоОтклонениеПроцент,
	|	СтоимостьБезНДС,
	|	НДС,
	|	СтоимостьСНДС,
	|	СтоимостьБезНДСОтклонение,
	|	СтоимостьБезНДСОтклонениеПроцент,
	|	НДСОтклонение,
	|	НДСОтклонениеПроцент,
	|	СтоимостьСНДСОтклонение,
	|	СтоимостьСНДСОтклонениеПроцент}
	|ИЗ
	|	(ВЫБРАТЬ
	|		АнализируемыеДанные.Период КАК Период,
	|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
	|		АнализируемыеДанные.Регистратор КАК Регистратор,
	|		АнализируемыеДанные.Организация КАК Организация,
	|		АнализируемыеДанные.Сценарий КАК Сценарий,
	|		АнализируемыеДанные.Подразделение КАК Подразделение,
	|		АнализируемыеДанные.ТС КАК ТС,
	|		АнализируемыеДанные.МодельТС КАК МодельТС,
	|		АнализируемыеДанные.ТипТС КАК ТипТС,
	|		АнализируемыеДанные.ДокументПланирования КАК ДокументПланирования,
	|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
	|		АнализируемыеДанные.ПараметрВыработки КАК ПараметрВыработки,
	|		АнализируемыеДанные.Заказ КАК Заказ,
	|		АнализируемыеДанные.Контрагент КАК Контрагент,
	|		АнализируемыеДанные.Договор КАК Договор,
	|		АнализируемыеДанные.Маршрут КАК Маршрут,
	|		АнализируемыеДанные.ВидБилета КАК ВидБилета,
	|		СУММА(АнализируемыеДанные.ПланКоличествоТекущие) КАК Количество,
	|		СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиницТекущие) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетовТекущие) КАК КоличествоЕдиницОтчетов,
	|		СУММА(АнализируемыеДанные.ПланКоличествоТекущие) - СУММА(АнализируемыеДанные.ПланКоличествоЭталонные) КАК КоличествоОтклонение,
	|		СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиницТекущие) - СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиницЭталонные) КАК КоличествоБазовыхЕдиницОтклонение,
	|		СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетовТекущие) - СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетовЭталонные) КАК КоличествоЕдиницОтчетовОтклонение,
	|		СУММА(АнализируемыеДанные.ПланСтоимостьБезНДСТекущие) КАК СтоимостьБезНДС,
	|		СУММА(АнализируемыеДанные.ПланНДСТекущие) КАК НДС,
	|		СУММА(АнализируемыеДанные.ПланСтоимостьСНДСТекущие) КАК СтоимостьСНДС,
	|		СУММА(АнализируемыеДанные.ПланСтоимостьБезНДСТекущие) - СУММА(АнализируемыеДанные.ПланСтоимостьБезНДСЭталонные) КАК СтоимостьБезНДСОтклонение,
	|		СУММА(АнализируемыеДанные.ПланНДСТекущие) - СУММА(АнализируемыеДанные.ПланНДСЭталонные) КАК НДСОтклонение,
	|		СУММА(АнализируемыеДанные.ПланСтоимостьСНДСТекущие) - СУММА(АнализируемыеДанные.ПланСтоимостьСНДСЭталонные) КАК СтоимостьСНДСОтклонение
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПланРаботыТСОборотыТекущие.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, ГОД) КАК ПериодГод,
	|			ПланРаботыТСОборотыТекущие.Регистратор КАК Регистратор,
	|			ПланРаботыТСОборотыТекущие.ДокументПланирования.Организация КАК Организация,
	|			ПланРаботыТСОборотыТекущие.Сценарий КАК Сценарий,
	|			ПланРаботыТСОборотыТекущие.Подразделение КАК Подразделение,
	|			ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|					ТОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)
	|			КОНЕЦ КАК Справочник.ТранспортныеСредства) КАК ТС,
	|			ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|					ТОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования.уатМодель
	|				КОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
	|					ТОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уатМоделиТС.ПустаяСсылка)
	|			КОНЕЦ КАК Справочник.уатМоделиТС) КАК МодельТС,
	|			ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|					ТОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования.Тип
	|				КОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
	|					ТОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования.ТипТС
	|				ИНАЧЕ ПланРаботыТСОборотыТекущие.ДетализацияПланирования
	|			КОНЕЦ КАК Справочник.ТипыТранспортныхСредств) КАК ТипТС,
	|			ПланРаботыТСОборотыТекущие.ДокументПланирования КАК ДокументПланирования,
	|			ПланРаботыТСОборотыТекущие.Номенклатура КАК Номенклатура,
	|			ПланРаботыТСОборотыТекущие.ПараметрВыработки КАК ПараметрВыработки,
	|			ПланРаботыТСОборотыТекущие.Заказ КАК Заказ,
	|			ПланРаботыТСОборотыТекущие.Контрагент КАК Контрагент,
	|			ПланРаботыТСОборотыТекущие.Договор КАК Договор,
	|			ПланРаботыТСОборотыТекущие.Маршрут КАК Маршрут,
	|			ПланРаботыТСОборотыТекущие.ВидБилета КАК ВидБилета,
	|			ПланРаботыТСОборотыТекущие.КоличествоОборот КАК ПланКоличествоТекущие,
	|			ПланРаботыТСОборотыТекущие.КоличествоОборот КАК ПланКоличествоБазовыхЕдиницТекущие,
	|			ПланРаботыТСОборотыТекущие.КоличествоОборот КАК ПланКоличествоЕдиницОтчетовТекущие,
	|			0 КАК ПланКоличествоЭталонные,
	|			0 КАК ПланКоличествоБазовыхЕдиницЭталонные,
	|			0 КАК ПланКоличествоЕдиницОтчетовЭталонные,
	|			ПланРаботыТСОборотыТекущие.СтоимостьОборот КАК ПланСтоимостьБезНДСТекущие,
	|			ПланРаботыТСОборотыТекущие.НДСОборот КАК ПланНДСТекущие,
	|			ПланРаботыТСОборотыТекущие.СтоимостьОборот + ПланРаботыТСОборотыТекущие.НДСОборот КАК ПланСтоимостьСНДСТекущие,
	|			0 КАК ПланСтоимостьБезНДСЭталонные,
	|			0 КАК ПланНДСЭталонные,
	|			0 КАК ПланСтоимостьСНДСЭталонные
	|		ИЗ
	|			РегистрНакопления.уатПланРаботыТС.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ВЫБОР КОГДА &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ Сценарий = &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " КОНЕЦ) КАК ПланРаботыТСОборотыТекущие
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ПланРаботыТСОборотыЭталонные.Период,
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, ДЕНЬ),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, НЕДЕЛЯ),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, ДЕКАДА),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, МЕСЯЦ),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, КВАРТАЛ),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, ПОЛУГОДИЕ),
	|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, ГОД),
	|			ПланРаботыТСОборотыЭталонные.Регистратор,
	|			ПланРаботыТСОборотыЭталонные.ДокументПланирования.Организация,
	|			ПланРаботыТСОборотыЭталонные.Сценарий,
	|			ПланРаботыТСОборотыЭталонные.Подразделение,
	|			ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|						ТОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)
	|				КОНЕЦ КАК Справочник.ТранспортныеСредства),
	|			ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|						ТОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования.уатМодель
	|					КОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
	|						ТОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уатМоделиТС.ПустаяСсылка)
	|				КОНЕЦ КАК Справочник.уатМоделиТС),
	|			ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования ССЫЛКА Справочник.ТранспортныеСредства
	|						ТОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования.Тип
	|					КОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
	|						ТОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования.ТипТС
	|					ИНАЧЕ ПланРаботыТСОборотыЭталонные.ДетализацияПланирования
	|				КОНЕЦ КАК Справочник.ТипыТранспортныхСредств),
	|			ПланРаботыТСОборотыЭталонные.ДокументПланирования,
	|			ПланРаботыТСОборотыЭталонные.Номенклатура,
	|			ПланРаботыТСОборотыЭталонные.ПараметрВыработки,
	|			ПланРаботыТСОборотыЭталонные.Заказ,
	|			ПланРаботыТСОборотыЭталонные.Контрагент,
	|			ПланРаботыТСОборотыЭталонные.Договор,
	|			ПланРаботыТСОборотыЭталонные.Маршрут,
	|			ПланРаботыТСОборотыЭталонные.ВидБилета,
	|			0 КАК ПланКоличествоТекущие,
	|			0 КАК ПланКоличествоБазовыхЕдиницТекущие,
	|			0 КАК ПланыПродажКоличествоЕдиницОтчетовТекущие,
	|			ПланРаботыТСОборотыЭталонные.КоличествоОборот КАК ПланКоличествоЭталонные,
	|			ПланРаботыТСОборотыЭталонные.КоличествоОборот КАК ПланКоличествоБазовыхЕдиницЭталонные,
	|			ПланРаботыТСОборотыЭталонные.КоличествоОборот КАК ПланКоличествоЕдиницОтчетовЭталонные,
	|			0 КАК ПланСтоимостьБезНДСТекущие,
	|			0 КАК ПланНДСТекущие,
	|			0 КАК ПланСтоимостьСНДСТекущие,
	|			ПланРаботыТСОборотыЭталонные.СтоимостьОборот КАК ПланСтоимостьБезНДСЭталонные,
	|			ПланРаботыТСОборотыЭталонные.НДСОборот КАК ПланНДСЭталонные,
	|			ПланРаботыТСОборотыЭталонные.СтоимостьОборот + ПланРаботыТСОборотыЭталонные.НДСОборот КАК ПланСтоимостьСНДСЭталонные
	|		ИЗ
	|			РегистрНакопления.уатПланРаботыТС.Обороты(
	|					&ДатаНач1,
	|					&ДатаКон1,
	|					Регистратор,
	|					ВЫБОР
	|						КОГДА &Сценарий1 = НЕОПРЕДЕЛЕНО
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Сценарий = &Сценарий1
	|					КОНЕЦ) КАК ПланРаботыТСОборотыЭталонные) КАК АнализируемыеДанные
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АнализируемыеДанные.Организация,
	|		АнализируемыеДанные.Сценарий,
	|		АнализируемыеДанные.Подразделение,
	|		АнализируемыеДанные.ТС,
	|		АнализируемыеДанные.МодельТС,
	|		АнализируемыеДанные.ТипТС,
	|		АнализируемыеДанные.ДокументПланирования,
	|		АнализируемыеДанные.Номенклатура,
	|		АнализируемыеДанные.ПараметрВыработки,
	|		АнализируемыеДанные.Заказ,
	|		АнализируемыеДанные.Контрагент,
	|		АнализируемыеДанные.Договор,
	|		АнализируемыеДанные.Маршрут,
	|		АнализируемыеДанные.ВидБилета,
	|		АнализируемыеДанные.Регистратор,
	|		АнализируемыеДанные.Период,
	|		АнализируемыеДанные.ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
	|{ГДЕ
	|	РезультатАнализа.Организация.*,
	|	РезультатАнализа.Сценарий.*,
	|	РезультатАнализа.Подразделение.*,
	|	РезультатАнализа.ТС.*,
	|	РезультатАнализа.МодельТС.*,
	|	РезультатАнализа.ТипТС.*,
	|	РезультатАнализа.ДокументПланирования.*,
	|	РезультатАнализа.Номенклатура.*,
	|	РезультатАнализа.ПараметрВыработки.*,
	|	РезультатАнализа.Заказ.*,
	|	РезультатАнализа.Контрагент.*,
	|	РезультатАнализа.Договор.*,
	|	РезультатАнализа.Маршрут.*,
	|	РезультатАнализа.ВидБилета.*,
	|	РезультатАнализа.Регистратор.*,
	|	РезультатАнализа.Период,
	|	РезультатАнализа.ПериодДень,
	|	РезультатАнализа.ПериодНеделя,
	|	РезультатАнализа.ПериодДекада,
	|	РезультатАнализа.ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие,
	|	РезультатАнализа.ПериодГод,
	|	РезультатАнализа.Количество,
	|	РезультатАнализа.КоличествоБазовыхЕдиниц,
	|	РезультатАнализа.КоличествоЕдиницОтчетов,
	|	РезультатАнализа.КоличествоОтклонение,
	|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение,
	|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.Количество = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.Количество = РезультатАнализа.КоличествоОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС,
	|	РезультатАнализа.НДС,
	|	РезультатАнализа.СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.СтоимостьБезНДС = РезультатАнализа.СтоимостьБезНДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.НДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.НДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.НДС = РезультатАнализа.НДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.СтоимостьСНДС = РезультатАнализа.СтоимостьСНДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьСНДСОтклонениеПроцент,
	|	(ВЫБОР
	|		КОГДА РезультатАнализа.ТС.уатДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА РезультатАнализа.ТС.уатДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЛОЖЬ
	|		КОНЕЦ) КАК ТСВыбыло}";
	
	Набор = НаборыЗапросов.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	Набор.АвтоЗаполнениеДоступныхПолей = Истина;
	Набор.Запрос = ТекстЗапроса;
	Набор.Имя    = "НаборДанных" + НомерСтроки;
	Набор.ИсточникДанных = "ИсточникДанныхКомпоновки";
	
КонецПроцедуры // ДобавитьПлан_План()

// Эталонные данные - "Факт", текущие данные - "Факт"
Процедура ДобавитьФакт_Факт(СравниваемыеДанные, ЭталонныеДанные, НаборыЗапросов)
	
	НомерСтроки = СравниваемыеДанные.НомерСтроки;
	
	ТекстЗапроса =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
	|	РезультатАнализа.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Организация) КАК ОрганизацияПредставление,
	|	РезультатАнализа.Сценарий КАК Сценарий,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Сценарий) КАК СценарийПредставление,
	|	РезультатАнализа.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
	|	РезультатАнализа.ТС КАК ТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТС) КАК ТСПредставление,
	|	РезультатАнализа.МодельТС КАК МодельТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.МодельТС) КАК МодельТСПредставление,
	|	РезультатАнализа.ТипТС КАК ТипТС,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТипТС) КАК ТипТСПредставление,
	|	РезультатАнализа.ДокументПланирования КАК ДокументПланирования,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ДокументПланирования) КАК ДокументПланированияПредставление,
	|	РезультатАнализа.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
	|	РезультатАнализа.ПараметрВыработки КАК ПараметрВыработки,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ПараметрВыработки) КАК ПараметрВыработкиПредставление,
	|	РезультатАнализа.Заказ КАК Заказ,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
	|	РезультатАнализа.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
	|	РезультатАнализа.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
	|	РезультатАнализа.Маршрут КАК Маршрут,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Маршрут) КАК МаршрутПредставление,
	|	РезультатАнализа.ВидБилета КАК ВидБилета,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ВидБилета) КАК ВидБилетаПредставление,
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.Количество ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.Количество < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.Количество / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.Количество / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.Количество / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.Количество / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиниц / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоБазовыхЕдиниц
	|	КОНЕЦ КАК КоличествоБазовыхЕдиниц,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоЕдиницОтчетов ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоЕдиницОтчетов < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетов / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетов / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоЕдиницОтчетов
	|	КОНЕЦ КАК КоличествоЕдиницОтчетов,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоОтклонение
	|	КОНЕЦ КАК КоличествоОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоБазовыхЕдиницОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоБазовыхЕдиницОтклонение
	|	КОНЕЦ КАК КоличествоБазовыхЕдиницОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫБОР
	|					КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение < 0
	|						ТОГДА ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - ВЫБОР
	|								КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) > 0
	|									ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ) * 0.6
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ + (РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - ВЫБОР
	|							КОГДА РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 - (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) < 0
	|								ТОГДА (ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))) - 1
	|							ИНАЧЕ ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 0))
	|						КОНЕЦ) * 0.6
	|				КОНЕЦ
	|		КОГДА РезультатАнализа.ПараметрВыработки.Временный
	|				И НЕ &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(РезультатАнализа.КоличествоЕдиницОтчетовОтклонение / 3600 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ РезультатАнализа.КоличествоЕдиницОтчетовОтклонение
	|	КОНЕЦ КАК КоличествоЕдиницОтчетовОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.Количество = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.Количество = РезультатАнализа.КоличествоОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	РезультатАнализа.НДС КАК НДС,
	|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьБезНДС = РезультатАнализа.СтоимостьБезНДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.НДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.НДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.НДС = РезультатАнализа.НДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьСНДС = РезультатАнализа.СтоимостьСНДСОтклонение
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Сценарий.*,
	|	Подразделение.*,
	|	ТС.*,
	|	МодельТС.*,
	|	ТипТС.*,
	|	ДокументПланирования.*,
	|	Номенклатура.*,
	|	ПараметрВыработки.*,
	|	Заказ.*,
	|	Контрагент.*,
	|	Договор.*,
	|	Маршрут.*,
	|	ВидБилета.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоБазовыхЕдиниц,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоОтклонение,
	|	КоличествоБазовыхЕдиницОтклонение,
	|	КоличествоЕдиницОтчетовОтклонение,
	|	КоличествоОтклонениеПроцент,
	|	СтоимостьБезНДС,
	|	НДС,
	|	СтоимостьСНДС,
	|	СтоимостьБезНДСОтклонение,
	|	СтоимостьБезНДСОтклонениеПроцент,
	|	НДСОтклонение,
	|	НДСОтклонениеПроцент,
	|	СтоимостьСНДСОтклонение,
	|	СтоимостьСНДСОтклонениеПроцент}
	|ИЗ
	|	(ВЫБРАТЬ
	|		АнализируемыеДанные.Период КАК Период,
	|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
	|		АнализируемыеДанные.Регистратор КАК Регистратор,
	|		АнализируемыеДанные.Организация КАК Организация,
	|		АнализируемыеДанные.Сценарий КАК Сценарий,
	|		АнализируемыеДанные.Подразделение КАК Подразделение,
	|		АнализируемыеДанные.ТС КАК ТС,
	|		АнализируемыеДанные.МодельТС КАК МодельТС,
	|		АнализируемыеДанные.ТипТС КАК ТипТС,
	|		АнализируемыеДанные.ДокументПланирования КАК ДокументПланирования,
	|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
	|		АнализируемыеДанные.ПараметрВыработки КАК ПараметрВыработки,
	|		АнализируемыеДанные.Заказ КАК Заказ,
	|		АнализируемыеДанные.Контрагент КАК Контрагент,
	|		АнализируемыеДанные.Договор КАК Договор,
	|		АнализируемыеДанные.Маршрут КАК Маршрут,
	|		АнализируемыеДанные.ВидБилета КАК ВидБилета,
	|		СУММА(АнализируемыеДанные.ФактКоличествоТекущие) КАК Количество,
	|		СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиницТекущие) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетовТекущие) КАК КоличествоЕдиницОтчетов,
	|		СУММА(АнализируемыеДанные.ФактКоличествоТекущие) - СУММА(АнализируемыеДанные.ФактКоличествоЭталонные) КАК КоличествоОтклонение,
	|		СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиницТекущие) - СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиницЭталонные) КАК КоличествоБазовыхЕдиницОтклонение,
	|		СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетовТекущие) - СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетовЭталонные) КАК КоличествоЕдиницОтчетовОтклонение,
	|		СУММА(АнализируемыеДанные.ФактСтоимостьБезНДСТекущие) КАК СтоимостьБезНДС,
	|		СУММА(АнализируемыеДанные.ФактНДСТекущие) КАК НДС,
	|		СУММА(АнализируемыеДанные.ФактСтоимостьСНДСТекущие) КАК СтоимостьСНДС,
	|		СУММА(АнализируемыеДанные.ФактСтоимостьБезНДСТекущие) - СУММА(АнализируемыеДанные.ФактСтоимостьБезНДСЭталонные) КАК СтоимостьБезНДСОтклонение,
	|		СУММА(АнализируемыеДанные.ФактНДСТекущие) - СУММА(АнализируемыеДанные.ФактНДСЭталонные) КАК НДСОтклонение,
	|		СУММА(АнализируемыеДанные.ФактСтоимостьСНДСТекущие) - СУММА(АнализируемыеДанные.ФактСтоимостьСНДСЭталонные) КАК СтоимостьСНДСОтклонение
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВыработкаОборотыТекущие.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, ГОД) КАК ПериодГод,
	|			ВыработкаОборотыТекущие.Регистратор КАК Регистратор,
	|			ВыработкаОборотыТекущие.Организация КАК Организация,
	|			NULL КАК Сценарий,
	|			ВыработкаОборотыТекущие.Подразделение КАК Подразделение,
	|			ВыработкаОборотыТекущие.ТС КАК ТС,
	|			ВыработкаОборотыТекущие.ТС.уатМодель КАК МодельТС,
	|			ВыработкаОборотыТекущие.ТС.Тип КАК ТипТС,
	|			NULL КАК ДокументПланирования,
	|			NULL КАК Номенклатура,
	|			ВыработкаОборотыТекущие.ПараметрВыработки КАК ПараметрВыработки,
	|			NULL КАК Заказ,
	|			ВыработкаОборотыТекущие.Контрагент КАК Контрагент,
	|			NULL КАК Договор,
	|			ВыработкаОборотыТекущие.Маршрут КАК Маршрут,
	|			NULL КАК ВидБилета,
	|			ВыработкаОборотыТекущие.КоличествоОборот КАК ФактКоличествоТекущие,
	|			NULL КАК ФактКоличествоБазовыхЕдиницТекущие,
	|			NULL КАК ФактКоличествоЕдиницОтчетовТекущие,
	|			0 КАК ФактКоличествоЭталонные,
	|			0 КАК ФактКоличествоБазовыхЕдиницЭталонные,
	|			0 КАК ФактКоличествоЕдиницОтчетовЭталонные,
	|			NULL КАК ФактСтоимостьБезНДСТекущие,
	|			NULL КАК ФактНДСТекущие,
	|			NULL КАК ФактСтоимостьСНДСТекущие,
	|			0 КАК ФактСтоимостьБезНДСЭталонные,
	|			0 КАК ФактНДСЭталонные,
	|			0 КАК ФактСтоимостьСНДСЭталонные
	|		ИЗ
	|			РегистрНакопления.уатВыработкаТС.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ) КАК ВыработкаОборотыТекущие
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВыручкаОборотыТекущие.Период,
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, ДЕНЬ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, НЕДЕЛЯ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, ДЕКАДА),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, МЕСЯЦ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, КВАРТАЛ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, ПОЛУГОДИЕ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, ГОД),
	|			ВыручкаОборотыТекущие.Регистратор,
	|			ВыручкаОборотыТекущие.Организация,
	|			NULL,
	|			NULL,
	|			ВыручкаОборотыТекущие.ТС,
	|			ВыручкаОборотыТекущие.ТС.уатМодель,
	|			ВыручкаОборотыТекущие.ТС.Тип,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			ВыручкаОборотыТекущие.Маршрут,
	|			ВыручкаОборотыТекущие.Билет.ВидБилета,
	|			ВыручкаОборотыТекущие.КоличествоОборот КАК ФактКоличествоТекущие,
	|			NULL КАК ФактКоличествоБазовыхЕдиницТекущие,
	|			NULL КАК ФактКоличествоЕдиницОтчетовТекущие,
	|			0 КАК ФактКоличествоЭталонные,
	|			0 КАК ФактКоличествоБазовыхЕдиницЭталонные,
	|			0 КАК ФактКоличествоЕдиницОтчетовЭталонные,
	|			ВыручкаОборотыТекущие.СуммаОборот КАК ФактСтоимостьБезНДСТекущие,
	|			NULL КАК ФактНДСТекущие,
	|			NULL КАК ФактСтоимостьСНДСТекущие,
	|			0 КАК ФактСтоимостьБезНДСЭталонные,
	|			0 КАК ФактНДСЭталонные,
	|			0 КАК ФактСтоимостьСНДСЭталонные
	|		ИЗ
	|			РегистрНакопления.уатВыручка.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ) КАК ВыручкаОборотыТекущие
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВыработкаОборотыЭталонные.Период,
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, ДЕНЬ),
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, НЕДЕЛЯ),
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, ДЕКАДА),
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, МЕСЯЦ),
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, КВАРТАЛ),
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, ПОЛУГОДИЕ),
	|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, ГОД),
	|			ВыработкаОборотыЭталонные.Регистратор,
	|			ВыработкаОборотыЭталонные.Организация,
	|			NULL,
	|			ВыработкаОборотыЭталонные.Подразделение,
	|			ВыработкаОборотыЭталонные.ТС,
	|			ВыработкаОборотыЭталонные.ТС.уатМодель,
	|			ВыработкаОборотыЭталонные.ТС.Тип,
	|			NULL,
	|			NULL,
	|			ВыработкаОборотыЭталонные.ПараметрВыработки,
	|			NULL,
	|			ВыработкаОборотыЭталонные.Контрагент,
	|			NULL,
	|			ВыработкаОборотыЭталонные.Маршрут,
	|			NULL,
	|			0 КАК ФактКоличествоТекущие,
	|			0 КАК ФактКоличествоБазовыхЕдиницТекущие,
	|			0 КАК ФактКоличествоЕдиницОтчетовТекущие,
	|			ВыработкаОборотыЭталонные.КоличествоОборот КАК ФактКоличествоЭталонные,
	|			NULL КАК ФактКоличествоБазовыхЕдиницЭталонные,
	|			NULL КАК ФактКоличествоЕдиницОтчетовЭталонные,
	|			0 КАК ФактСтоимостьБезНДСТекущие,
	|			0 КАК ФактНДСТекущие,
	|			0 КАК ФактСтоимостьСНДСТекущие,
	|			NULL КАК ФактСтоимостьБезНДСЭталонные,
	|			NULL КАК ФактНДСЭталонные,
	|			NULL КАК ФактСтоимостьСНДСЭталонные
	|		ИЗ
	|			РегистрНакопления.уатВыработкаТС.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, ) КАК ВыработкаОборотыЭталонные
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВыручкаОборотыЭталонные.Период,
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, ДЕНЬ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, НЕДЕЛЯ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, ДЕКАДА),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, МЕСЯЦ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, КВАРТАЛ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, ПОЛУГОДИЕ),
	|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, ГОД),
	|			ВыручкаОборотыЭталонные.Регистратор,
	|			ВыручкаОборотыЭталонные.Организация,
	|			NULL,
	|			NULL,
	|			ВыручкаОборотыЭталонные.ТС,
	|			ВыручкаОборотыЭталонные.ТС.уатМодель,
	|			ВыручкаОборотыЭталонные.ТС.Тип,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			ВыручкаОборотыЭталонные.Маршрут,
	|			ВыручкаОборотыЭталонные.Билет.ВидБилета,
	|			0 КАК ФактКоличествоТекущие,
	|			0 КАК ФактКоличествоБазовыхЕдиницТекущие,
	|			0 КАК ФактКоличествоЕдиницОтчетовТекущие,
	|			ВыручкаОборотыЭталонные.КоличествоОборот КАК ФактКоличествоЭталонные,
	|			NULL КАК ФактКоличествоБазовыхЕдиницЭталонные,
	|			NULL КАК ФактКоличествоЕдиницОтчетовЭталонные,
	|			0 КАК ФактСтоимостьБезНДСТекущие,
	|			0 КАК ФактНДСТекущие,
	|			0 КАК ФактСтоимостьСНДСТекущие,
	|			ВыручкаОборотыЭталонные.СуммаОборот КАК ФактСтоимостьБезНДСЭталонные,
	|			NULL КАК ФактНДСЭталонные,
	|			NULL КАК ФактСтоимостьСНДСЭталонные
	|		ИЗ
	|			РегистрНакопления.уатВыручка.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, ) КАК ВыручкаОборотыЭталонные) КАК АнализируемыеДанные
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АнализируемыеДанные.Организация,
	|		АнализируемыеДанные.Сценарий,
	|		АнализируемыеДанные.Подразделение,
	|		АнализируемыеДанные.ТС,
	|		АнализируемыеДанные.МодельТС,
	|		АнализируемыеДанные.ТипТС,
	|		АнализируемыеДанные.ДокументПланирования,
	|		АнализируемыеДанные.Номенклатура,
	|		АнализируемыеДанные.ПараметрВыработки,
	|		АнализируемыеДанные.Заказ,
	|		АнализируемыеДанные.Контрагент,
	|		АнализируемыеДанные.Договор,
	|		АнализируемыеДанные.Маршрут,
	|		АнализируемыеДанные.ВидБилета,
	|		АнализируемыеДанные.Регистратор,
	|		АнализируемыеДанные.Период,
	|		АнализируемыеДанные.ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
	|{ГДЕ
	|	РезультатАнализа.Организация.*,
	|	РезультатАнализа.Сценарий.*,
	|	РезультатАнализа.Подразделение.*,
	|	РезультатАнализа.ТС.*,
	|	РезультатАнализа.МодельТС.*,
	|	РезультатАнализа.ТипТС.*,
	|	РезультатАнализа.ДокументПланирования.*,
	|	РезультатАнализа.Номенклатура.*,
	|	РезультатАнализа.ПараметрВыработки.*,
	|	РезультатАнализа.Заказ.*,
	|	РезультатАнализа.Контрагент.*,
	|	РезультатАнализа.Договор.*,
	|	РезультатАнализа.Маршрут.*,
	|	РезультатАнализа.ВидБилета.*,
	|	РезультатАнализа.Регистратор.*,
	|	РезультатАнализа.Период,
	|	РезультатАнализа.ПериодДень,
	|	РезультатАнализа.ПериодНеделя,
	|	РезультатАнализа.ПериодДекада,
	|	РезультатАнализа.ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие,
	|	РезультатАнализа.ПериодГод,
	|	РезультатАнализа.Количество,
	|	РезультатАнализа.КоличествоБазовыхЕдиниц,
	|	РезультатАнализа.КоличествоЕдиницОтчетов,
	|	РезультатАнализа.КоличествоОтклонение,
	|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение,
	|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.Количество = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.Количество = РезультатАнализа.КоличествоОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС,
	|	РезультатАнализа.НДС,
	|	РезультатАнализа.СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.СтоимостьБезНДС = РезультатАнализа.СтоимостьБезНДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.НДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.НДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.НДС = РезультатАнализа.НДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение,
	|	(ВЫБОР
	|			КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|						ТОГДА -100
	|					ИНАЧЕ ВЫБОР
	|							КОГДА РезультатАнализа.СтоимостьСНДС = РезультатАнализа.СтоимостьСНДСОтклонение
	|								ТОГДА ""-""
	|							ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьСНДСОтклонениеПроцент,
	|	(ВЫБОР
	|		КОГДА РезультатАнализа.ТС.уатДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА РезультатАнализа.ТС.уатДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЛОЖЬ
	|		КОНЕЦ) КАК ТСВыбыло}";
	
	Набор = НаборыЗапросов.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	Набор.АвтоЗаполнениеДоступныхПолей = Истина;
	Набор.Запрос = ТекстЗапроса;
	Набор.Имя    = "НаборДанных" + НомерСтроки;
	Набор.ИсточникДанных = "ИсточникДанныхКомпоновки";
	
КонецПроцедуры // ДобавитьФакт_Факт()

Функция ПолучитьПредставлениеДанных(Данные)
	
	Результат = Формат(Данные.НомерСтроки, "ЧГ=0") + ". ";
	
	Если Данные.НомерСтроки = 1 Тогда
		
		Результат = Результат + "Эталонный период.";
		
	Иначе
		
		Результат = Результат + "Сравниваемый период.";
		
	КонецЕсли;
	
	Результат = Результат + Символы.ПС + Данные.ТипДанных + ". " + Символы.ПС;
	
	Если Не Данные.Сценарий.Пустая() Тогда
		
		Результат = Результат + Строка(Данные.Сценарий) + Символы.ПС;
		
	КонецЕсли;
	
	Если Данные.ДатаНач = Дата('00010101') И Данные.ДатаКон = Дата('00010101') Тогда
		
		Если ЭтотОбъект.ПериодОтчета.ДатаНачала = Дата('00010101') И ЭтотОбъект.ПериодОтчета.ДатаОкончания = Дата('00010101') Тогда
			
			Результат = Результат + "Без ограничения периода.";
			
		Иначе
			
			Результат = Результат + "С " + Формат(ЭтотОбъект.ПериодОтчета.ДатаНачала, "ДЛФ=Д; ДП = ""...""") + " по " + Формат(ЭтотОбъект.ПериодОтчета.ДатаОкончания, "ДЛФ=Д; ДП = ""...""");
			
		КонецЕсли;
		
	Иначе
		
		Результат = Результат + "С " + Формат(Данные.ДатаНач, "ДЛФ=Д; ДП = ""...""") + " по " + Формат(Данные.ДатаКон, "ДЛФ=Д; ДП = ""...""");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьПредставлениеДанных()

// Функция формирует макет СКД и заполняет его требуемыми запросами выборки и параметрами
Функция ПолучитьСхемуКомпоновки() Экспорт 
	
	СхемаКомпоновкиДанныхРезультат = ЭтотОбъект.ПолучитьМакет("ПланФактныйАнализРаботыТС");
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить("Дата");
	МассивТипов.Добавить("Граница");
	ТипДатаГраница = Новый ОписаниеТипов(МассивТипов,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	
	СхемаКомпоновкиДанныхРезультат.Параметры.Очистить();
	
	НовыйПараметр = СхемаКомпоновкиДанныхРезультат.Параметры.Добавить();
	НовыйПараметр.ВключатьВДоступныеПоля         = Ложь;
	НовыйПараметр.Выражение                      = "";
	НовыйПараметр.ДоступенСписокЗначений         = Ложь;
	НовыйПараметр.Заголовок                      = "Выводить время в формате ЧЧММ";
	НовыйПараметр.ЗапрещатьНезаполненныеЗначения = Ложь;
	НовыйПараметр.Значение                       = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ПользователиКлиентСервер.ТекущийПользователь(), ПланыВидовХарактеристик.уатПраваИНастройки.ФорматироватьВремяВОтчетах);
	НовыйПараметр.Имя                            = "ВыводитьВремяВФорматеЧЧММ";
	НовыйПараметр.Использование                  = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	НовыйПараметр.ОграничениеИспользования       = Ложь;
	НовыйПараметр.ПараметрФункциональныхОпций    = "";
	НовыйПараметр.ТипЗначения                    = Новый ОписаниеТипов("Булево");
	
	Для Каждого Данные Из ЭтотОбъект.ДанныеОтчета Цикл
		
		НовыйПараметр = СхемаКомпоновкиДанныхРезультат.Параметры.Добавить();
		НовыйПараметр.ВключатьВДоступныеПоля         = Истина;
		НовыйПараметр.Выражение                      = "";
		НовыйПараметр.ДоступенСписокЗначений         = Ложь;
		НовыйПараметр.Заголовок                      = "ТипДанных" + Формат(Данные.НомерСтроки, "ЧГ=0");
		НовыйПараметр.ЗапрещатьНезаполненныеЗначения = Ложь;
		НовыйПараметр.Значение                       = ПолучитьПредставлениеДанных(Данные);
		НовыйПараметр.Имя                            = "ТипДанных" + Формат(Данные.НомерСтроки, "ЧГ=0");
		НовыйПараметр.Использование                  = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		НовыйПараметр.ОграничениеИспользования       = Ложь;
		НовыйПараметр.ПараметрФункциональныхОпций    = "";
		НовыйПараметр.ТипЗначения                    = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50,ДопустимаяДлина.Переменная));
		
		НовыйПараметр = СхемаКомпоновкиДанныхРезультат.Параметры.Добавить();
		НовыйПараметр.ВключатьВДоступныеПоля         = Истина;
		НовыйПараметр.Выражение                      = "";
		НовыйПараметр.ДоступенСписокЗначений         = Ложь;
		НовыйПараметр.Заголовок                      = "Сценарий" + Формат(Данные.НомерСтроки, "ЧГ=0");
		НовыйПараметр.ЗапрещатьНезаполненныеЗначения = Ложь;
		НовыйПараметр.Значение                       = ?(Данные.Сценарий.Пустая(), Неопределено, Данные.Сценарий);
		НовыйПараметр.Имя                            = "Сценарий" + Формат(Данные.НомерСтроки, "ЧГ=0");
		НовыйПараметр.Использование                  = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		НовыйПараметр.ОграничениеИспользования       = Ложь;
		НовыйПараметр.ПараметрФункциональныхОпций    = "";
		НовыйПараметр.ТипЗначения                    = Новый ОписаниеТипов("СправочникСсылка.уатСценарииПланирования");
		
		Если Данные.ДатаНач = Дата('00010101') И Данные.ДатаКон = Дата('00010101') Тогда
			
			НовыйПараметр = СхемаКомпоновкиДанныхРезультат.Параметры.Добавить();
			НовыйПараметр.ВключатьВДоступныеПоля         = Истина;
			НовыйПараметр.Выражение                      = "";
			НовыйПараметр.ДоступенСписокЗначений         = Ложь;
			НовыйПараметр.Заголовок                      = "ДатаНач" + Формат(Данные.НомерСтроки, "ЧГ=0");
			НовыйПараметр.ЗапрещатьНезаполненныеЗначения = Ложь;
			НовыйПараметр.Значение                       = ?(ЭтотОбъект.ПериодОтчета.ДатаНачала = Дата('00010101'), ЭтотОбъект.ПериодОтчета.ДатаНачала, Новый Граница(НачалоДня(ЭтотОбъект.ПериодОтчета.ДатаНачала), ВидГраницы.Включая));
			НовыйПараметр.Имя                            = "ДатаНач" + Формат(Данные.НомерСтроки, "ЧГ=0");
			НовыйПараметр.Использование                  = ИспользованиеПараметраКомпоновкиДанных.Всегда;
			НовыйПараметр.ОграничениеИспользования       = Ложь;
			НовыйПараметр.ПараметрФункциональныхОпций    = "";
			НовыйПараметр.ТипЗначения                    = ТипДатаГраница;
			
			НовыйПараметр = СхемаКомпоновкиДанныхРезультат.Параметры.Добавить();
			НовыйПараметр.ВключатьВДоступныеПоля         = Истина;
			НовыйПараметр.Выражение                      = "";
			НовыйПараметр.ДоступенСписокЗначений         = Ложь;
			НовыйПараметр.Заголовок                      = "ДатаКон" + Формат(Данные.НомерСтроки, "ЧГ=0");
			НовыйПараметр.ЗапрещатьНезаполненныеЗначения = Ложь;
			НовыйПараметр.Значение                       = ?(ЭтотОбъект.ПериодОтчета.ДатаОкончания = Дата('00010101'), ЭтотОбъект.ПериодОтчета.ДатаОкончания, Новый Граница(КонецДня(ЭтотОбъект.ПериодОтчета.ДатаОкончания), ВидГраницы.Включая));
			НовыйПараметр.Имя                            = "ДатаКон" + Формат(Данные.НомерСтроки, "ЧГ=0");
			НовыйПараметр.Использование                  = ИспользованиеПараметраКомпоновкиДанных.Всегда;
			НовыйПараметр.ОграничениеИспользования       = Ложь;
			НовыйПараметр.ПараметрФункциональныхОпций    = "";
			НовыйПараметр.ТипЗначения                    = ТипДатаГраница;
			
		Иначе
			
			НовыйПараметр = СхемаКомпоновкиДанныхРезультат.Параметры.Добавить();
			НовыйПараметр.ВключатьВДоступныеПоля         = Истина;
			НовыйПараметр.Выражение                      = "";
			НовыйПараметр.ДоступенСписокЗначений         = Ложь;
			НовыйПараметр.Заголовок                      = "ДатаНач" + Формат(Данные.НомерСтроки, "ЧГ=0");
			НовыйПараметр.ЗапрещатьНезаполненныеЗначения = Ложь;
			НовыйПараметр.Значение                       = ?(Данные.ДатаНач = Дата('00010101'), Данные.ДатаНач, Новый Граница(НачалоДня(Данные.ДатаНач), ВидГраницы.Включая));
			НовыйПараметр.Имя                            = "ДатаНач" + Формат(Данные.НомерСтроки, "ЧГ=0");
			НовыйПараметр.Использование                  = ИспользованиеПараметраКомпоновкиДанных.Всегда;
			НовыйПараметр.ОграничениеИспользования       = Ложь;
			НовыйПараметр.ПараметрФункциональныхОпций    = "";
			НовыйПараметр.ТипЗначения                    = ТипДатаГраница;
			
			НовыйПараметр = СхемаКомпоновкиДанныхРезультат.Параметры.Добавить();
			НовыйПараметр.ВключатьВДоступныеПоля         = Истина;
			НовыйПараметр.Выражение                      = "";
			НовыйПараметр.ДоступенСписокЗначений         = Ложь;
			НовыйПараметр.Заголовок                      = "ДатаКон" + Формат(Данные.НомерСтроки, "ЧГ=0");
			НовыйПараметр.ЗапрещатьНезаполненныеЗначения = Ложь;
			НовыйПараметр.Значение                       = ?(Данные.ДатаКон = Дата('00010101'), Данные.ДатаКон, Новый Граница(КонецДня(Данные.ДатаКон), ВидГраницы.Включая));
			НовыйПараметр.Имя                            = "ДатаКон" + Формат(Данные.НомерСтроки, "ЧГ=0");
			НовыйПараметр.Использование                  = ИспользованиеПараметраКомпоновкиДанных.Всегда;
			НовыйПараметр.ОграничениеИспользования       = Ложь;
			НовыйПараметр.ПараметрФункциональныхОпций    = "";
			НовыйПараметр.ТипЗначения                    = ТипДатаГраница;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПакетЗапросов = СхемаКомпоновкиДанныхРезультат.НаборыДанных.Найти("ПакетЗапросов");
	ПакетЗапросов.Элементы.Очистить();
	
	СформироватьПакетЗапросов(ПакетЗапросов.Элементы);
	
	Возврат СхемаКомпоновкиДанныхРезультат;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ПериодОтчета.ДатаНачала) 
			Или Не ЗначениеЗаполнено(ЭтотОбъект.ПериодОтчета.ДатаОкончания) Тогда 
		ТекстОшибки = НСтр("ru = 'Неверно указаны даты начала и окончания периода'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
	КонецЕсли;
	
	Если ЭтотОбъект.ПериодОтчета.ДатаНачала > ЭтотОбъект.ПериодОтчета.ДатаОкончания Тогда
		ТекстОшибки = НСтр("ru = 'Дата начала периода не может быть больше даты окончания периода'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновки = ЭтотОбъект.ПолучитьСхемуКомпоновки();
	
	НастрокиКомпоновки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	Для Каждого ТекПараметр Из СхемаКомпоновки.Параметры Цикл 
		НайдПараметр = НастрокиКомпоновки.ПараметрыДанных.Элементы.Найти(ТекПараметр.Имя);
		Если НайдПараметр = Неопределено Тогда 
			Прервать;
		КонецЕсли;
		НайдПараметр.Значение = ТекПараметр.Значение;
		НайдПараметр.Использование = Истина;
	КонецЦикла;
	
	КомпоновщикМакета         = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки           = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастрокиКомпоновки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
	ПроцессорВывода           = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

